[
  {
    "episode_name": "51: Parshas Bamidbar- Place Your Order Now",
    "episode_description": "Parshas Bamidbar: Place Your Order Now In this enlightening episode of the Prism of Torah podcast, you will delve into the intricate world of Torah details. The focus will be on the point of structure and organization within the Torah. By exploring various elements such as the tents, flags, Leviim, and the count of Yidden, you will uncover their deeper significance and the connection to DNA. Additionally, this episode features captivating stories from the pitch, including the fable of Arturo Toscanini and the elusive violin. Through these stories, you will unravel the hidden messages and lessons they convey.  Furthermore, you will have the opportunity to understand the transformative power of the 7x7 in sefiras, which relates to the practice of counting the Omer. This practice serves as a pathway to personal growth and perfection. Join us on this illuminating journey as we uncover the secrets of change and gain valuable insights from the prism of Torah. Don't miss out on this enriching experience!",
    "release_date": "18-05-23",
    "duration_minutes": 19.92,
    "spotify_web_url": "https://open.spotify.com/episode/1RrlTBEZeRWQrE7Euc3bGY",
    "spotify_uri": "spotify:episode:1RrlTBEZeRWQrE7Euc3bGY",
    "embed_url": "https://open.spotify.com/embed/episode/1RrlTBEZeRWQrE7Euc3bGY"
  },
  {
    "episode_name": "Parshas Bamidbar- Feed Your Soul, Starve Your Ego",
    "episode_description": "Are you struggling to connect with Hashem and Torah? Do you feel lost in the spiritual wilderness? Join us as we delve into the profound lessons hidden within Parshas Bamidbar. Discover the secrets of harnessing the transformative powers of fire, water, and the desert to ignite your soul's yearning for Hashem. Learn how consistency and self-sacrifice can help you shed the layers of impurity and prepare your heart for the ultimate revelation at Shavuos. Explore the eternal battle between the yetzer tov and yetzer hora, and uncover the tools to emerge victorious in your spiritual journey. Don't miss this illuminating discussion that will transform your perspective on life and bring you closer to Hashem. Always on www.prismoftorah.org",
    "release_date": "06-06-24",
    "duration_minutes": 14.62,
    "spotify_web_url": "https://open.spotify.com/episode/5vJGk4UR2M0a2wvp3Ykpzp",
    "spotify_uri": "spotify:episode:5vJGk4UR2M0a2wvp3Ykpzp",
    "embed_url": "https://open.spotify.com/embed/episode/5vJGk4UR2M0a2wvp3Ykpzp"
  },
  {
    "episode_name": "Parshas Bamidbar The master key for Avodas Hashem",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 14.75,
    "spotify_web_url": "https://open.spotify.com/episode/7gxNopqGm9QOvrpk9wMyQL",
    "spotify_uri": "spotify:episode:7gxNopqGm9QOvrpk9wMyQL",
    "embed_url": "https://open.spotify.com/embed/episode/7gxNopqGm9QOvrpk9wMyQL"
  },
  {
    "episode_name": "The Danger of Being Counted - Bamidbar - 385",
    "episode_description": "Why does the Torah prohibit counting people directly? What spiritual danger lies behind being singled out from the crowd? In Parshas Bamidbar, discover the shocking connection between counting, the evil eye, and losing divine protection. Through a powerful basketball tournament story, uncover how teams with superstars often lose to unified groups of average players. This exploration reveals why being \"nobody special\" might be your greatest spiritual asset. Don't miss the podcast with Rabeinu Bechayi critical concept about the protective power of community and collective merit.",
    "release_date": "28-05-25",
    "duration_minutes": 8.21,
    "spotify_web_url": "https://open.spotify.com/episode/7eTBOhUCCjDkwRMOjVh7qt",
    "spotify_uri": "spotify:episode:7eTBOhUCCjDkwRMOjVh7qt",
    "embed_url": "https://open.spotify.com/embed/episode/7eTBOhUCCjDkwRMOjVh7qt"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas  Naso - The ONLY things we acquire for eternity",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 13.74,
    "spotify_web_url": "https://open.spotify.com/episode/0hoQMpuuJebnQo51Ds8z7g",
    "spotify_uri": "spotify:episode:0hoQMpuuJebnQo51Ds8z7g",
    "embed_url": "https://open.spotify.com/embed/episode/0hoQMpuuJebnQo51Ds8z7g"
  },
  {
    "episode_name": "The Art of Saying No - Parshas Nasso -Ep. 386",
    "episode_description": "What's the hidden connection between abstaining from wine & grapes and witnessing potential adultery? In Parashat Naso, discover the profound wisdom linking personal boundaries to our divine image. Through an incredible story of $2,300 found in a parking lot, uncover how saying \"no\" to temptation doesn't close doors—it opens ones you never knew existed. Join us to explore why your ability to resist instinct is your greatest superpower and the one thing that separates humans from animals.",
    "release_date": "05-06-25",
    "duration_minutes": 8.9,
    "spotify_web_url": "https://open.spotify.com/episode/7cMyZNMHHpKdCHJ4IrIItH",
    "spotify_uri": "spotify:episode:7cMyZNMHHpKdCHJ4IrIItH",
    "embed_url": "https://open.spotify.com/embed/episode/7cMyZNMHHpKdCHJ4IrIItH"
  },
  {
    "episode_name": "Parshas Naso - Enjoying life",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 7.97,
    "spotify_web_url": "https://open.spotify.com/episode/1eq3eZFxSt4oOAkBAMf58G",
    "spotify_uri": "spotify:episode:1eq3eZFxSt4oOAkBAMf58G",
    "embed_url": "https://open.spotify.com/embed/episode/1eq3eZFxSt4oOAkBAMf58G"
  },
  {
    "episode_name": "Parshas Naso - The importance of Shalom",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.03,
    "spotify_web_url": "https://open.spotify.com/episode/5OHJHHzADti1Hld9UD4v05",
    "spotify_uri": "spotify:episode:5OHJHHzADti1Hld9UD4v05",
    "embed_url": "https://open.spotify.com/embed/episode/5OHJHHzADti1Hld9UD4v05"
  },
  {
    "episode_name": "Parshas Naso - The Nazir's Mixed Messages",
    "episode_description": "In this thought-provoking episode of \"The Prism of Torah,\" Reb Asaf Aaron Prisman delves into the fascinating paradox of the Nazir. Why does the Torah describe the Nazir as both holy and sinful? Unravel the mystery as we explore the delicate balance between physical indulgence and spiritual elevation. Through captivating stories and insightful Torah wisdom, we'll examine the different levels of holiness one can achieve in this world. Are you depriving yourself or truly elevating your existence? Discover how to transform perceived sacrifices into joyful opportunities for growth. This episode promises to challenge your perspective on pleasure, purpose, and the path to genuine spiritual fulfillment. Tune in to gain a deeper understanding of your own spiritual journey and learn how to navigate the complex interplay between body and soul in Jewish life.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 12,
    "spotify_web_url": "https://open.spotify.com/episode/2XyMyBkxALydmqdQsB6qQU",
    "spotify_uri": "spotify:episode:2XyMyBkxALydmqdQsB6qQU",
    "embed_url": "https://open.spotify.com/embed/episode/2XyMyBkxALydmqdQsB6qQU"
  },
  {
    "episode_name": "5 Nasso: The sparks of Kabbalah",
    "episode_description": "Join Reb Asaf Aharon Prisman as we explore: The impure sparks surround us and cause us to do bad. What does this have to do with the Nazir? What do your good actions do on a metaphysical level? Visit our website prismanoftorah.com email us prismanoftorah@gmail.com. Don’t forget to share the link with your friends and neighbors. Thank you to Yona Veffer for his studio equipment. This podcast is produced by Eli Podcast Productions for free לע\"נ יצחק אייזק בן ר' משה",
    "release_date": "08-06-22",
    "duration_minutes": 19.05,
    "spotify_web_url": "https://open.spotify.com/episode/59fSp4mDsap7JGVrC62gMS",
    "spotify_uri": "spotify:episode:59fSp4mDsap7JGVrC62gMS",
    "embed_url": "https://open.spotify.com/embed/episode/59fSp4mDsap7JGVrC62gMS"
  },
  {
    "episode_name": "53: Parshas Naso- Playing Heart To Get",
    "episode_description": "Join us on the latest episode of the Prism of Torah as we delve into the profound depths of the Nazir's journey. Embark on an exploration of the rich symbolism and profound implications behind this ancient vow of abstinence from wine, haircuts, and contact with the deceased. Uncover the captivating story of the sole \"true\" Nazir as described by the Gemora, unraveling the unique qualities that set him apart from his fellow Nazirim. Moreover, we delve into the practical wisdom gleaned from the Nazir's path, revealing how it still can be relevant and transformative in our own lives. Don't miss out on this enlightening discussion, offering fresh perspectives and actionable insights for personal growth and meaningful actions. Tune in now to discover the timeless lessons of the Nazir on the Prism of Torah podcast.",
    "release_date": "01-06-23",
    "duration_minutes": 18.53,
    "spotify_web_url": "https://open.spotify.com/episode/6A4VeWukVz0MloGiO8sjDq",
    "spotify_uri": "spotify:episode:6A4VeWukVz0MloGiO8sjDq",
    "embed_url": "https://open.spotify.com/embed/episode/6A4VeWukVz0MloGiO8sjDq"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Bad at Machshava (But Expert at Strategic Planning) Parshas Behaaloscha Ep 387",
    "episode_description": "Why do we claim we can't memorize Torah but know every detail about our hobbies? Why endless energy for personal pursuits but feel drained by spiritual growth?What happens when our own achievements become witnesses against our spiritual excuses?Through the story of a sharp rabbi and a Silicon Valley developer's embarrassing revelation, discover why your supposed limitations might actually be choices... and why that matters more than you think.",
    "release_date": "12-06-25",
    "duration_minutes": 10.73,
    "spotify_web_url": "https://open.spotify.com/episode/1clTrO8WLTUa4oULYkMTls",
    "spotify_uri": "spotify:episode:1clTrO8WLTUa4oULYkMTls",
    "embed_url": "https://open.spotify.com/embed/episode/1clTrO8WLTUa4oULYkMTls"
  },
  {
    "episode_name": "54: Parshas Behaaloscha- Driving On Hashem's Highway",
    "episode_description": "In Parshas Behaaloscha, we encounter a recurring verse that states, \"At the commandment of Hashem they journeyed, and at the commandment of Hashem they encamped.\" This repetition may raise questions in our minds: Why is it emphasized so frequently? Why is the wording extensive? Similarly, we wonder about the existence of ten sefirot instead of just one. Couldn't Hashem have created the world with a single attribute? Furthermore, Judaism seems to place great importance on the minutiae, from which shoe to put on first to the specific order of our actions. Does Hashem truly concern Himself with such details? Does He genuinely care about our every action?  To gain a deeper understanding of these questions and to explore how they impact our daily lives, let us embark on a metaphorical drive down the highway of enlightenment. Join us on the Prism of Torah podcast as we delve into the significance of these seemingly small details and discover how they can truly make a difference. Along the journey, we will uncover how Hashem's precise guidance and attention to detail serve as powerful tools for enhancing our day-to-day lives. Buckle up, tune in, and witness the transformative potential of aligning ourselves with the divine intricacies of existence.",
    "release_date": "01-06-23",
    "duration_minutes": 17.02,
    "spotify_web_url": "https://open.spotify.com/episode/3QMDy25k6Fl3NzrEFj3v1P",
    "spotify_uri": "spotify:episode:3QMDy25k6Fl3NzrEFj3v1P",
    "embed_url": "https://open.spotify.com/embed/episode/3QMDy25k6Fl3NzrEFj3v1P"
  },
  {
    "episode_name": "Parshas Behaaloscha Consistency wins the race",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 12.05,
    "spotify_web_url": "https://open.spotify.com/episode/5MDOaLRBC3GtnZJdKbwAC5",
    "spotify_uri": "spotify:episode:5MDOaLRBC3GtnZJdKbwAC5",
    "embed_url": "https://open.spotify.com/embed/episode/5MDOaLRBC3GtnZJdKbwAC5"
  },
  {
    "episode_name": "Parshas Behaaloscha- Eating kugel too early",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 8.82,
    "spotify_web_url": "https://open.spotify.com/episode/3s6UTtDPYACx2eLkhfJjo2",
    "spotify_uri": "spotify:episode:3s6UTtDPYACx2eLkhfJjo2",
    "embed_url": "https://open.spotify.com/embed/episode/3s6UTtDPYACx2eLkhfJjo2"
  },
  {
    "episode_name": "Parshas Behaaloscha- Elevate Yourself",
    "episode_description": "Why did the cloud hover over the Mishkan? Why did the cloud symbolize Hashem's message to remain in our current location? What can it teach us about navigating the ups and downs of our spiritual journey? Uncover the hidden depths of life's challenges in this week's Prism of Torah. Reb Prisman shares profound insights from the Nesivos Shalom that will change the way you view your struggles and help you find the strength to persevere. Also, he presents a powerful parable from his Rebbe about a trip to the dentist that will make you rethink the purpose of pain in your life. Listen now to discover how you can harness the challenges in your life to reach new heights in your relationship with Hashem. Always on www.prismoftorah.org",
    "release_date": "20-06-24",
    "duration_minutes": 14.65,
    "spotify_web_url": "https://open.spotify.com/episode/4zSQOGAto6GLI7580wxKBV",
    "spotify_uri": "spotify:episode:4zSQOGAto6GLI7580wxKBV",
    "embed_url": "https://open.spotify.com/embed/episode/4zSQOGAto6GLI7580wxKBV"
  },
  {
    "episode_name": "Parshas Behaaloscha- Influence via insulation",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 11.57,
    "spotify_web_url": "https://open.spotify.com/episode/2DtAoDdKANNFP0chChEPbP",
    "spotify_uri": "spotify:episode:2DtAoDdKANNFP0chChEPbP",
    "embed_url": "https://open.spotify.com/embed/episode/2DtAoDdKANNFP0chChEPbP"
  },
  {
    "episode_name": "Parshas Behaaloscha- Trusting Hashem",
    "episode_description": "In this thought-provoking episode of \"The Prism of Torah,\" Reb Asaf Aaron Prisman delves into the perplexing events of Parshas Behaaloscha. Why did the generation that witnessed miracles complain about the manna? What motivated their eagerness to leave Har Sinai? Uncover the deeper spiritual lessons hidden within these seemingly contradictory actions. Explore the delicate balance between living a supernatural existence and embracing life's challenges. Discover why trusting Hashem's timing is crucial for our growth, and learn valuable insights about preparing our children for the complexities of the outside world. Join us for a fascinating journey that will reshape your understanding of this parsha and provide practical wisdom for navigating your own spiritual path.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 9.28,
    "spotify_web_url": "https://open.spotify.com/episode/5Wt4xk3OWrXVmLtRACzkd9",
    "spotify_uri": "spotify:episode:5Wt4xk3OWrXVmLtRACzkd9",
    "embed_url": "https://open.spotify.com/embed/episode/5Wt4xk3OWrXVmLtRACzkd9"
  },
  {
    "episode_name": "6- Parshas Behaloscha - Does the end justify the meat?",
    "episode_description": "Parshas Behaloscha - Does the end justify the meat? Our podcast is about to see some changes… stay tuned… The Prisman of Torah podcast with Reb Asaf Aharon Prisman. Visit our website prismanoftorah.com Parshas Behaloscha- there is so much drama in this week's Parsha about some meat… many questions about what the Jews really wanted, and why this maybe was the ultimate downfall of the Jews of that generation. Reb Asaf really gets into it this week and shares a story on the topic. Feel free to contact us on prismanoftorah.com, Subscribe to the podcast and send the link to your friends and family. Eli Podcast Production לע\"נ יצחק אייזק בן ר' משה",
    "release_date": "16-06-22",
    "duration_minutes": 20.72,
    "spotify_web_url": "https://open.spotify.com/episode/79pvsoECtA2TB8q3DJK2WF",
    "spotify_uri": "spotify:episode:79pvsoECtA2TB8q3DJK2WF",
    "embed_url": "https://open.spotify.com/embed/episode/79pvsoECtA2TB8q3DJK2WF"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "55 Parshas Shelach: The Main Event; Heart VS Brain",
    "episode_description": "Parshas Shelach: The Main Event; Heart VS Brain Join us for an insightful episode of the Prism of Torah podcast as we delve into Parshas Shelach and explore the intriguing connection Rashi makes between the spies and the mitzvah of tzitz. Discover the profound relevance this connection holds for us today and how it can transform the way we perceive the world around us.",
    "release_date": "08-06-23",
    "duration_minutes": 12.13,
    "spotify_web_url": "https://open.spotify.com/episode/2w2J08fH7UqCV5Qy79ZFpr",
    "spotify_uri": "spotify:episode:2w2J08fH7UqCV5Qy79ZFpr",
    "embed_url": "https://open.spotify.com/embed/episode/2w2J08fH7UqCV5Qy79ZFpr"
  },
  {
    "episode_name": "Parshas Shelach - Positive Attitude",
    "episode_description": "In this illuminating episode of 'The Prism of Torah', Reb Asaf delves into Parshat Shlach, unraveling the profound impact of attitude on our life's missions. Through a fascinating analysis of the spies' journey, we explore how our initial perspective shapes our outcomes. Discover the Kli Yakar's insightful interpretation of three distinct Hebrew words for 'spying', each revealing a different intention. From the optimism of Yehoshua and Calev to the skepticism of the other spies, learn how your outlook can make or break your endeavors. Plus, heartwarming stories that illustrate the transformative power of positive words and thoughts. Tune in to unlock the secret of turning challenges into opportunities and infusing your daily life with the wisdom of the Torah.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 14.89,
    "spotify_web_url": "https://open.spotify.com/episode/3yjOMqgj01InLLgbdK1cxF",
    "spotify_uri": "spotify:episode:3yjOMqgj01InLLgbdK1cxF",
    "embed_url": "https://open.spotify.com/embed/episode/3yjOMqgj01InLLgbdK1cxF"
  },
  {
    "episode_name": "Parshas Shlach - Perception is reality",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 9.83,
    "spotify_web_url": "https://open.spotify.com/episode/4idctMxHMtuKwwY91W1WGo",
    "spotify_uri": "spotify:episode:4idctMxHMtuKwwY91W1WGo",
    "embed_url": "https://open.spotify.com/embed/episode/4idctMxHMtuKwwY91W1WGo"
  },
  {
    "episode_name": "Parshas Shlach - Your Spiritual Jackpot",
    "episode_description": "Parshas Shlach -  Your Spiritual Jackpot Why did the Jews suddenly change their hearts about entering Eretz Yisrael? What caused this dramatic shift from fear to determination? Why do mitzvos sometimes feel like a struggle? Is there a hidden purpose behind our spiritual challenges? What if the moments we find most difficult are actually our greatest opportunities for growth? Join us as we unravel the paradox of Divine commands and discover how understanding the Yetzer Hara's tactics can transform our approach to Jewish life. Always on www.prismoftorah.org",
    "release_date": "27-06-24",
    "duration_minutes": 20.92,
    "spotify_web_url": "https://open.spotify.com/episode/3froU7Xl4CpvWPaEcVy0Y6",
    "spotify_uri": "spotify:episode:3froU7Xl4CpvWPaEcVy0Y6",
    "embed_url": "https://open.spotify.com/embed/episode/3froU7Xl4CpvWPaEcVy0Y6"
  },
  {
    "episode_name": "How Your Self-Worth Shapes Your Reality. Ep 388 - Parshas Shlach",
    "episode_description": "How did the spies know exactly how they appeared in their enemies' eyes? Why do we confuse confidence with arrogance? What if your \"modesty\" is actually hurting those around you? In Parshat Shlach, discover the profound connection between self-perception and reality, and why hiding your God-given talents isn't humility—it's selfishness. Through the inspiring story of a programmer who almost let false modesty derail his team's success, uncover how to balance genuine modesty with confident purpose.",
    "release_date": "19-06-25",
    "duration_minutes": 9.71,
    "spotify_web_url": "https://open.spotify.com/episode/2z05ux5ohoTBSAas2QT0Mz",
    "spotify_uri": "spotify:episode:2z05ux5ohoTBSAas2QT0Mz",
    "embed_url": "https://open.spotify.com/embed/episode/2z05ux5ohoTBSAas2QT0Mz"
  },
  {
    "episode_name": "7: Parshas Shelach & Korach – Perception or Deception",
    "episode_description": "7: Parshas Shelach & Korach – Perception or Deception  IMPROVED AUDIO!! Reb Asaf Ahron Prisman on the Parsha. Visit our website prismanoftorah.com . email us prismanoftorah@gmail.com .  The mitzvah of Tzitz… The fight between Korach and Moshe…The 402 bus to Yerushalim…  Reb Asaf takes a dive into the disagreement of what causes people to sin, does the heart desire and then the eye sees or does the eye see  what causes the heart to desire. What is the difference or are they the same thing?  Subscribe to the podcast, and share it with your friends and neighbours you can listen directly from our homepage of the website prismanoftorah.com.  Good news! Our website is being upgraded stay tuned!  Thank you to Yona Veffer for your recording equipment  Technical support for the podcast is done for free by Eli Podcast Productions; לע\"נ יעקב אלכסנדר בן מרדכי דוב",
    "release_date": "22-06-22",
    "duration_minutes": 16.54,
    "spotify_web_url": "https://open.spotify.com/episode/6hg9YXyUG50aXrljHWBjVj",
    "spotify_uri": "spotify:episode:6hg9YXyUG50aXrljHWBjVj",
    "embed_url": "https://open.spotify.com/embed/episode/6hg9YXyUG50aXrljHWBjVj"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "56 - Parshas Korach: Nuclear tefilla",
    "episode_description": "Parshas Korach: Nuclear tefilla   In this thought-provoking podcast episode, we delve deep into Parshas Korach to unravel the profound impact of prayer. As the intense confrontation between Moshe and Korach reaches its climax, the air is filled with the aroma of sacred incense offerings. Amidst this pivotal moment, Moshe, with utmost urgency, directs his prayers towards preventing the acceptance of Korach's offerings. The question arises: Why did Moshe feel the need to pray? Could Hashem truly entertain the acceptance of Korach's offering, posing a potential threat to the essence of Yiddishkeit? Astonishingly, the answer might just be yes.  Join us on a captivating journey as we explore the incredible power of Teffilah (prayer) and its unparalleled ability to establish an unbreakable connection with Hashem. Prepare to be amazed as we uncover the wondrous potential that lies within a single prayer. Furthermore, we present two captivating stories that vividly illustrate how the transformative nature of prayer can shape the course of our destiny. Don't miss out on this enlightening podcast episode, where the secrets of prayer's incredible influence are unveiled before your very ears.   All this and more on www.prismoftorah.com or wherever you get your podcasts from.",
    "release_date": "15-06-23",
    "duration_minutes": 15.14,
    "spotify_web_url": "https://open.spotify.com/episode/6xwG0pJYcACqlsQrFB81Uq",
    "spotify_uri": "spotify:episode:6xwG0pJYcACqlsQrFB81Uq",
    "embed_url": "https://open.spotify.com/embed/episode/6xwG0pJYcACqlsQrFB81Uq"
  },
  {
    "episode_name": "8: Korach- Small is big",
    "episode_description": "Reb Asaf Aharon Prisman on the Parsha-Korach -Small is big Visit our soon-to-be-updated website prismanoftorah.com where you can play and download the Dvar Torah. You can download the Dvar Torah from here: This week we explore the idea that some great Jewish leaders are absurdly obsessed with small amounts of money or small actions. Reb Dessler explains how this is what life is really about. Reb Asaf shares a story he heard in Arizona when he was but a child! Thank you to Yona Veffer for your studio equipment. Produced by Eli Podcast Production לע\"נ יעקב אלכסנדר בן מרדכי דוב",
    "release_date": "30-06-22",
    "duration_minutes": 19,
    "spotify_web_url": "https://open.spotify.com/episode/6CW7tcsMjPuqbL2qMgEZWi",
    "spotify_uri": "spotify:episode:6CW7tcsMjPuqbL2qMgEZWi",
    "embed_url": "https://open.spotify.com/embed/episode/6CW7tcsMjPuqbL2qMgEZWi"
  },
  {
    "episode_name": "Parshas Korach - Arguing the real way",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 7.68,
    "spotify_web_url": "https://open.spotify.com/episode/6q3Y7XDFRChH2PxJbQMzUf",
    "spotify_uri": "spotify:episode:6q3Y7XDFRChH2PxJbQMzUf",
    "embed_url": "https://open.spotify.com/embed/episode/6q3Y7XDFRChH2PxJbQMzUf"
  },
  {
    "episode_name": "Parshas Korach - Give & Take or the World's At Stake",
    "episode_description": "Parshas Korach - Give & Take or the World's At Stake In this week's Parsha, Korach's rebellion raises profound questions about the nature of holiness and leadership. But beneath the surface lies a deeper exploration of the very fabric of creation. What if the world is designed as an intricate symphony, with each of us playing a crucial role? Reb Asaf Prisman unravels the mystical concept of mashpia and mushpa (influencing vs being influenced), revealing how this divine dance of giving and receiving permeates every aspect of our lives. From the sun and moon to our daily interactions, discover how understanding your unique position in this cosmic orchestra can unlock abundant blessings. Always on www.prismoftorah.org",
    "release_date": "04-07-24",
    "duration_minutes": 13.14,
    "spotify_web_url": "https://open.spotify.com/episode/6LBvM6ry9N6gN6uBjCTqhk",
    "spotify_uri": "spotify:episode:6LBvM6ry9N6gN6uBjCTqhk",
    "embed_url": "https://open.spotify.com/embed/episode/6LBvM6ry9N6gN6uBjCTqhk"
  },
  {
    "episode_name": "Parshas Korach - Korach: True Oved Hashem",
    "episode_description": "What drives a person to rebel against divine authority, even at the cost of their own life? In this thought-provoking episode of \"The Prism of Torah,\" Reb Asaf Aaron Prisman delves into the perplexing story of Korach's rebellion. Uncover the surprising motives behind the 250 men who joined Korach, and discover how their misguided devotion led to a fiery fate. Through a fascinating interpretation by the Netziv, we'll explore the fine line between zealous service and true obedience to Hashem. Are we sometimes guilty of creating our own mitzvos? Learn how the Yetzer Hara can disguise rebellion as righteousness, and gain insight into becoming a genuine Oved Hashem. This episode challenges us to examine our own motivations in serving Hashem and offers a powerful lesson in humility and divine wisdom.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 12.53,
    "spotify_web_url": "https://open.spotify.com/episode/3q6zPxpE4kqsgExJweEbeA",
    "spotify_uri": "spotify:episode:3q6zPxpE4kqsgExJweEbeA",
    "embed_url": "https://open.spotify.com/embed/episode/3q6zPxpE4kqsgExJweEbeA"
  },
  {
    "episode_name": "Parshas Korach -The ability to influence",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 15.88,
    "spotify_web_url": "https://open.spotify.com/episode/2WxCRi3G3dcKFhkzCoiV2d",
    "spotify_uri": "spotify:episode:2WxCRi3G3dcKFhkzCoiV2d",
    "embed_url": "https://open.spotify.com/embed/episode/2WxCRi3G3dcKFhkzCoiV2d"
  },
  {
    "episode_name": "Parshas Korach True Peace",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 13.42,
    "spotify_web_url": "https://open.spotify.com/episode/5csiLgPwBbYWqUnOtcC8h8",
    "spotify_uri": "spotify:episode:5csiLgPwBbYWqUnOtcC8h8",
    "embed_url": "https://open.spotify.com/embed/episode/5csiLgPwBbYWqUnOtcC8h8"
  },
  {
    "episode_name": "Stop Playing Nice, Start Playing Smart - Parshas Korach - Ep. 389",
    "episode_description": "Why does achieving peace sometimes require violence? Pinchas killed sinners and received a \"covenant of peace.\" The Kohanim - descendants of Aharon the peace-pursuer - executed their own relatives after the Golden Calf. How can aggressive acts create harmony? Discover the hidden mechanics of real shalom - why it's deeper than just \"getting along,\" what makes it the divine vessel for bracha, and why sometimes the most loving thing you can do is remove what's destroying the whole. Through eye-opening insights from Parshas Korach and a compelling restaurant story, uncover what separates fake peace from authentic harmony.",
    "release_date": "26-06-25",
    "duration_minutes": 11.62,
    "spotify_web_url": "https://open.spotify.com/episode/2IH3WHChx982DXobUEji09",
    "spotify_uri": "spotify:episode:2IH3WHChx982DXobUEji09",
    "embed_url": "https://open.spotify.com/embed/episode/2IH3WHChx982DXobUEji09"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "When Your Words Hit Rock Bottom - Chukas - Ep. 390",
    "episode_description": "Why does speaking to a rock yield water, yet striking it brings punishment? Why a rock, of all things? In Parshas Chukas, discover the hidden wisdom of persistence that can soften even the hardest hearts. Through the miraculous story of water from stone—and a modern-day empire built from an empty room—you’ll uncover the divine algorithm for creating breakthroughs when nothing seems to work. Join us to explore this timeless concept, which can transform your outlook on tackling seemingly impossible situations—and reveal why your words are far more powerful than you think.",
    "release_date": "03-07-25",
    "duration_minutes": 10.8,
    "spotify_web_url": "https://open.spotify.com/episode/0B1KIaNSPoJkDjoU90WXsT",
    "spotify_uri": "spotify:episode:0B1KIaNSPoJkDjoU90WXsT",
    "embed_url": "https://open.spotify.com/embed/episode/0B1KIaNSPoJkDjoU90WXsT"
  },
  {
    "episode_name": "Parshas Chukas - Nature one big optical Illusion",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.66,
    "spotify_web_url": "https://open.spotify.com/episode/4RSbvJ6rJceTTz6DAXeZ2E",
    "spotify_uri": "spotify:episode:4RSbvJ6rJceTTz6DAXeZ2E",
    "embed_url": "https://open.spotify.com/embed/episode/4RSbvJ6rJceTTz6DAXeZ2E"
  },
  {
    "episode_name": "Parshas Chukas - True Reasoning of Mitzvos",
    "episode_description": "Embark on a thought-provoking journey into the enigma of the Parah Adumah (Red Heifer) and the nature of chukim (divine decrees). Challenge your understanding of mitzvos as we explore the difference between their \"taste\" and their true, unknowable reasons. Discover how this perspective can deepen your appreciation for Torah and humility before Hashem's infinite wisdom.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 13.13,
    "spotify_web_url": "https://open.spotify.com/episode/6F0RsWpTN7vu9XrSUOblic",
    "spotify_uri": "spotify:episode:6F0RsWpTN7vu9XrSUOblic",
    "embed_url": "https://open.spotify.com/embed/episode/6F0RsWpTN7vu9XrSUOblic"
  },
  {
    "episode_name": "Parshas Chukas- In good hands, always",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 16.98,
    "spotify_web_url": "https://open.spotify.com/episode/1pznv0hx9xs2meCowpHTDZ",
    "spotify_uri": "spotify:episode:1pznv0hx9xs2meCowpHTDZ",
    "embed_url": "https://open.spotify.com/embed/episode/1pznv0hx9xs2meCowpHTDZ"
  },
  {
    "episode_name": "Parshas Chukas- Intent and Impact",
    "episode_description": "Get ready for an exhilarating adventure as we dive into Parshas Chukas - Intent and Impact! Brace yourself for some serious self-reflection, because this week's parsha takes us on an extraordinary journey of introspection, known as chesbon hanfesh. Hold onto your seats as we uncover the fascinating connection between the Jews' experience in a place called chesbon and the power of self-reflection. But that's not all! We're about to embark on a mind-blowing expedition to San Pietro di Stra, where we'll witness the awe-inspiring sights that the legendary Ramchal once beheld. Get ready to transform your life by making the right choices and discovering the art of decision-making. We also find a captivating palindrome of belief, and it all culminates in not one, but two incredible stories of helping hands.  Listen to it here. Download here For those in chutz laretz parshas Korach can be heard here But always available on www.prismoftorah.com",
    "release_date": "22-06-23",
    "duration_minutes": 24.28,
    "spotify_web_url": "https://open.spotify.com/episode/2WZ78rvebYpBN2MGorTfmN",
    "spotify_uri": "spotify:episode:2WZ78rvebYpBN2MGorTfmN",
    "embed_url": "https://open.spotify.com/embed/episode/2WZ78rvebYpBN2MGorTfmN"
  },
  {
    "episode_name": "Parshas Chukas- Wielding the Yetzer's Secret Weapon",
    "episode_description": "Why did Hashem orchestrate punishment through snakes? What's the deeper significance of a copper serpent on a pole? How can we use the strategy of the Yetzer Hara to our advantage? How can this be a HUGE turnaround in our Spiritual growth? This week's Parshah takes us on a journey from complaints in the desert to profound lessons about perception and teshuvah. Uncover the power of this secret weapon and learn how great Tzaddikim harnessed this tool for spiritual elevation. From mon to modern-day missiles, see how seemingly unrelated stories weave together to reveal divine guidance.",
    "release_date": "11-07-24",
    "duration_minutes": 12.11,
    "spotify_web_url": "https://open.spotify.com/episode/58WrFXVuQnmv70LJRqnWW3",
    "spotify_uri": "spotify:episode:58WrFXVuQnmv70LJRqnWW3",
    "embed_url": "https://open.spotify.com/embed/episode/58WrFXVuQnmv70LJRqnWW3"
  },
  {
    "episode_name": "9 Parshas Chukas - Snakes and Ladders",
    "episode_description": "The Prisman of Torah- With Reb Asaf Aharon Prisman. Visit our website primanoftorah.com. Email prismanoftorah@gmail.com This week Parshas Chukas – Snakes and ladders. Download Link: shorturl.at/dltx7 When the Jews complained about the snakes attacking them, they implied there was a singular snake, this contradicts the previous passuk, how does this make sense? What is the deal with snakes anyway? Are they healers or attackers? What does this have to do with Korach? This and more in this week's episode. Thank you to Yona Veffer for your studio equipment. Produced by Eli Podcast Production לע\"נ לאה בת יונה",
    "release_date": "06-07-22",
    "duration_minutes": 20.7,
    "spotify_web_url": "https://open.spotify.com/episode/7fHLQB4Q8FbsSNYqgfnGY1",
    "spotify_uri": "spotify:episode:7fHLQB4Q8FbsSNYqgfnGY1",
    "embed_url": "https://open.spotify.com/embed/episode/7fHLQB4Q8FbsSNYqgfnGY1"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Balak - Ability to Decipher Hashem's Will",
    "episode_description": "Journey through the intriguing story of Bilaam and King Balak, and unravel the mystery of why Bilaam is considered wicked despite seemingly following Hashem's instructions. Delve into the crucial difference between Avraham Avinu and Bilaam, and learn the vital skill of objectively interpreting Hashem's will without clouding it with personal desires. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 8.6,
    "spotify_web_url": "https://open.spotify.com/episode/6yOotG0LCv1lGcLVTr2oft",
    "spotify_uri": "spotify:episode:6yOotG0LCv1lGcLVTr2oft",
    "embed_url": "https://open.spotify.com/embed/episode/6yOotG0LCv1lGcLVTr2oft"
  },
  {
    "episode_name": "Parshas Balak - Anger your secret weapon",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 18.06,
    "spotify_web_url": "https://open.spotify.com/episode/2l2VHATB8PXiwEGL6oT2hF",
    "spotify_uri": "spotify:episode:2l2VHATB8PXiwEGL6oT2hF",
    "embed_url": "https://open.spotify.com/embed/episode/2l2VHATB8PXiwEGL6oT2hF"
  },
  {
    "episode_name": "Parshas Balak - Objectively realizing Hashem's Will",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.33,
    "spotify_web_url": "https://open.spotify.com/episode/6JZeqXX1swYGCmEyJdxlDv",
    "spotify_uri": "spotify:episode:6JZeqXX1swYGCmEyJdxlDv",
    "embed_url": "https://open.spotify.com/embed/episode/6JZeqXX1swYGCmEyJdxlDv"
  },
  {
    "episode_name": "Parshas Balak - Using the Opportunities We Have",
    "episode_description": "Explore the power of intention and action in this fascinating analysis of Bilaam's attempt to curse the Jewish people. Uncover the deep significance of bris milah and how Hashem views our efforts to fulfill mitzvot, even when circumstances prevent us. Learn how to maximize your spiritual potential by seizing every opportunity for growth.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 12.35,
    "spotify_web_url": "https://open.spotify.com/episode/0MAzS64jc9Gyx9bjxlaa0F",
    "spotify_uri": "spotify:episode:0MAzS64jc9Gyx9bjxlaa0F",
    "embed_url": "https://open.spotify.com/embed/episode/0MAzS64jc9Gyx9bjxlaa0F"
  },
  {
    "episode_name": "Parshas Balak- Honey for the Soul",
    "episode_description": "Why did Hashem grant prophetic powers to a wicked person? Rashi explains it was to prevent other nations from excusing their misconduct. Yet, they could still argue, \"With a prophet like Moshe Rabbeinu, we would have been better.\" What's the key to true greatness? Explore Bilaam's story and Parshas Balak's depths. This episode contrasts mere knowledge with transformative Torah wisdom, examining the divergent paths of Moshe Rabbeinu and Bilaam.",
    "release_date": "18-07-24",
    "duration_minutes": 11.64,
    "spotify_web_url": "https://open.spotify.com/episode/7MW56SPiEEIyuU2EkADD6t",
    "spotify_uri": "spotify:episode:7MW56SPiEEIyuU2EkADD6t",
    "embed_url": "https://open.spotify.com/embed/episode/7MW56SPiEEIyuU2EkADD6t"
  },
  {
    "episode_name": "Parshas Balak Part of a bigger plan",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 15.4,
    "spotify_web_url": "https://open.spotify.com/episode/3DcYsPIG3U4QmIMRnxVVaB",
    "spotify_uri": "spotify:episode:3DcYsPIG3U4QmIMRnxVVaB",
    "embed_url": "https://open.spotify.com/embed/episode/3DcYsPIG3U4QmIMRnxVVaB"
  },
  {
    "episode_name": "Parshas Balak: More than meets the eye",
    "episode_description": "In this week's parsha, we learn about the amazing gift of Hashem who gave us two eyes to see the world. What is the message behind this? How come Balak was blind to the malach, while his donkey could see it? We discover how important it is to have a comprehensive view, a view that only the other person can offer, a view that we often miss. As we enter the “3 weeks” period, let us learn how to appreciate other people and how things are not always what they seem. We also hear the story of how a simple remark by the lender “I wonder when I’ll get that money back” almost ruined a family. You can listen to this week's podcast on www.prismoftorah.com.",
    "release_date": "29-06-23",
    "duration_minutes": 16.73,
    "spotify_web_url": "https://open.spotify.com/episode/46iTikXA2avc4ed1fATqUj",
    "spotify_uri": "spotify:episode:46iTikXA2avc4ed1fATqUj",
    "embed_url": "https://open.spotify.com/embed/episode/46iTikXA2avc4ed1fATqUj"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "10: Parshas Balak and Pinchos- Anger your secret weapon",
    "episode_description": "Parshas- Balak and Pinchos: Anger: your secret weapon Reb Asaf Aharon Prisman on the Parsha, the prisman of Torah Visit our website prismanoftorah.com In these two weeks, we see anger from Hashem, Balak, Bilam, Pinchos and the Jewish nation Reb Asaf takes us on a journey to understand the rights and the wrongs of anger. Understanding why sending women to seduce Klal Yisroel was the next best idea after cursing them. All this and much more this week with a story to prove the point. In the next two weeks, this podcast will be replaced by the new ‘prism of Torah’ podcast and our brand-new website prismoftorah.com with hundreds of archived Devrei Torah. Check out our new look and our new website in the coming weeks. Thanks to Yonah Veffer for his recording equipment. This podcast is produced by Eli Podcast productions. Also לע\"נ לעה בת יונה",
    "release_date": "13-07-22",
    "duration_minutes": 18.06,
    "spotify_web_url": "https://open.spotify.com/episode/308XCz7HkWFpHkPfi1iiYu",
    "spotify_uri": "spotify:episode:308XCz7HkWFpHkPfi1iiYu",
    "embed_url": "https://open.spotify.com/embed/episode/308XCz7HkWFpHkPfi1iiYu"
  },
  {
    "episode_name": "11: Parshas Pinchos- There is more than meets the eye",
    "episode_description": "The all-new Prism of Torah podcast, with Reb Asasf Aharon Prisman Parshas Pinchos-There is more than meets the eye Download: https://bit.ly/3cyYx2Q In this week's Parsha we talk about the sin of Tzelfchod, and what that has to do with thorns. Is thinking on Shabbos forbidden? How to view life’s challenged and the ultimate question of theodicy. Check out our new website www.prismoftorah.com with a huge archive to find all the old devrei Torah. We also have a new trailer, view it here: https://youtu.be/XxR-PKHpmnU listen here: https://spoti.fi/3PIYjEw לע\"נ יצחק אייזק בן משה",
    "release_date": "20-07-22",
    "duration_minutes": 19.14,
    "spotify_web_url": "https://open.spotify.com/episode/5Q2O3GeXACgiua5No96NLn",
    "spotify_uri": "spotify:episode:5Q2O3GeXACgiua5No96NLn",
    "embed_url": "https://open.spotify.com/embed/episode/5Q2O3GeXACgiua5No96NLn"
  },
  {
    "episode_name": "Parshas Pinchas - Finding your path to Hashem",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 8.79,
    "spotify_web_url": "https://open.spotify.com/episode/18urhCtcphRHJbEs7me4JD",
    "spotify_uri": "spotify:episode:18urhCtcphRHJbEs7me4JD",
    "embed_url": "https://open.spotify.com/embed/episode/18urhCtcphRHJbEs7me4JD"
  },
  {
    "episode_name": "Parshas Pinchas - Partnering with Hashem",
    "episode_description": "Dive into the profound lesson of Pinchas's courageous act and discover how we can become partners with Hashem in His divine work. Explore the concept of doing mitzvot that seem to be Hashem's job and the immense rewards that follow. From tzedakah to Torah study, uncover how everyday actions can elevate us to spiritual heights. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 15.09,
    "spotify_web_url": "https://open.spotify.com/episode/3tnyslwz3sp8un7vZDTEgv",
    "spotify_uri": "spotify:episode:3tnyslwz3sp8un7vZDTEgv",
    "embed_url": "https://open.spotify.com/embed/episode/3tnyslwz3sp8un7vZDTEgv"
  },
  {
    "episode_name": "Parshas Pinchos - Unlocking Infinite Rewards",
    "episode_description": "לע\"נ חיים בן שלום - Reb Chaim Klein What makes Pinchas's act so extraordinary that it earned him an eternal covenant of peace? How does our relationship with Hashem transform how we view Mitzvos and Aveiros? In this week's Prism of Torah, Reb Asaf Aharon Prisman Unravels the profound connection between divine service and a child's eager assistance. Discover how performing Hashem's \"job\" can lead to unimaginable rewards and why unity among Klal Yisrael is so crucial to our spiritual well-being. Delve into a fascinating debate between Rabbi Akiva and Turnus Rufus that challenges our understanding of tzedakah and divine will. Plus, hear a touching modern-day story that exemplifies true Chesed and self-sacrifice. Prepare to gain fresh insights into Parshas Pinchas that will reshape your perspective on what it truly means to be a faithful servant of Hashem. Listen now and elevate your spiritual journey!  Check out our new website and preorder the new book now! Always on www.prismoftorah.org",
    "release_date": "25-07-24",
    "duration_minutes": 13.85,
    "spotify_web_url": "https://open.spotify.com/episode/04QqZdMiZUBBMx07iCGJ9r",
    "spotify_uri": "spotify:episode:04QqZdMiZUBBMx07iCGJ9r",
    "embed_url": "https://open.spotify.com/embed/episode/04QqZdMiZUBBMx07iCGJ9r"
  },
  {
    "episode_name": "Parshas Pinchos- Kiddush Hashem",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 17.34,
    "spotify_web_url": "https://open.spotify.com/episode/4cPeic4rkKaIYEBcc624Gf",
    "spotify_uri": "spotify:episode:4cPeic4rkKaIYEBcc624Gf",
    "embed_url": "https://open.spotify.com/embed/episode/4cPeic4rkKaIYEBcc624Gf"
  },
  {
    "episode_name": "Parshas Pinchos: Swimming Against (Your) Current",
    "episode_description": "Parshas Pinchos: Swimming Against (Your) Current In this episode we journey deep into the heroic acts of Pinchas. We grapple with challenging questions- How did Pinchas halt a deadly plague and what is the significance of his lineage? What does suppressing our natural instincts for the sake of a greater reward mean in today's context? We explore the influence of Western culture and the distortion of today's values, and how going against our nature to do what Hashem wants us to do is the ultimate test of our faith. Finally, we share a heart-stirring story highlighting the power of selflessness and sacrifice. Tune in to hear riveting tales of sacrifice",
    "release_date": "06-07-23",
    "duration_minutes": 17.93,
    "spotify_web_url": "https://open.spotify.com/episode/2Hb8WhtRchcQpB33G1pyOo",
    "spotify_uri": "spotify:episode:2Hb8WhtRchcQpB33G1pyOo",
    "embed_url": "https://open.spotify.com/embed/episode/2Hb8WhtRchcQpB33G1pyOo"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Matos - In the Eyes of Hashem and Man",
    "episode_description": "Dive into the intriguing tale of the tribes of Gad and Reuven, and uncover a profound lesson about perception and responsibility. Why did Moshe Rabbeinu initially resist their request? What can we learn from their strategy and Moshe's response? Join Reb Asaf Aaron Prisman as he unravels the deeper meaning behind this parsha, exploring the delicate balance between good intentions and public perception. Discover how our actions ripple through our communities and why being \"clean in the eyes of Hashem and man\" is crucial for personal growth and societal harmony. Plus, a heartwarming story that will challenge your assumptions and remind you of the power of judging favorably. This episode is a must-listen for anyone seeking to navigate the complex interplay of personal integrity and communal responsibility in today's world. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "01-07-24",
    "duration_minutes": 14.49,
    "spotify_web_url": "https://open.spotify.com/episode/5kYckPLXyg8rBJz8ohuMdY",
    "spotify_uri": "spotify:episode:5kYckPLXyg8rBJz8ohuMdY",
    "embed_url": "https://open.spotify.com/embed/episode/5kYckPLXyg8rBJz8ohuMdY"
  },
  {
    "episode_name": "Parshas Matos - Spiritual cleansing",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.98,
    "spotify_web_url": "https://open.spotify.com/episode/0n5SU3Dz9XBN5mYr8MRwKx",
    "spotify_uri": "spotify:episode:0n5SU3Dz9XBN5mYr8MRwKx",
    "embed_url": "https://open.spotify.com/embed/episode/0n5SU3Dz9XBN5mYr8MRwKx"
  },
  {
    "episode_name": "Parshas Matos & Masei - Gan Eden: Are You on the Guestlist?",
    "episode_description": "This week is sponsored by the Weitzner Family,  In loving memory of Esther bas Pesachye In this week's parsha, Mattos, HaKadosh Baruch Hu commands Moshe Rabbeinu to take vengeance against the Midyanim. But why does Moshe then delegate this task to others if he feels it is so vital to do so urgently? What profound lesson can we learn from this seemingly perplexing decision? Reb Asaf Aharon Prisman delves into the depths of this parsha, uncovering a powerful message about the impact of our actions on our neshamos. How can cultivating gratitude in this world affect our eternal future in Olam Haba? And what surprising connection exists between a simple banana and the key to unlocking true simcha in our avodas Hashem? Join us as we explore these captivating questions and discover how becoming \"Gan Eden compatible\" is not just a lofty goal, but a practical path we can embark on today. Tune in to unravel the mystery of how our middos in this world shape our eternal destiny. Always on www.prismoftorah.org",
    "release_date": "01-08-24",
    "duration_minutes": 15.88,
    "spotify_web_url": "https://open.spotify.com/episode/5nVaeQoFsqSZvc3tnW5Asc",
    "spotify_uri": "spotify:episode:5nVaeQoFsqSZvc3tnW5Asc",
    "embed_url": "https://open.spotify.com/embed/episode/5nVaeQoFsqSZvc3tnW5Asc"
  },
  {
    "episode_name": "12: Parshas Masei- Life is like a downward escalator",
    "episode_description": "Parshas Masei- Life is like a downward escalator Reb Asaf Aharon Prisman on the Parsha, the prism of Torah. Visit our website prismoftorah.com This week we discuss moving to the equator from the north pole, a story about a young boy that became…Why the Torah goes in to so much detail about where the Jews went… and more… Download link: https://bit.ly/3cBKlG4 Or on our website, prismoftorah.com This week has been kindly sponsored in memory of זאב ישראל בן אברהם. Produced by Eli Podcast Productions",
    "release_date": "28-07-22",
    "duration_minutes": 23.73,
    "spotify_web_url": "https://open.spotify.com/episode/0LnVU6a3dvZyypH5dliKnc",
    "spotify_uri": "spotify:episode:0LnVU6a3dvZyypH5dliKnc",
    "embed_url": "https://open.spotify.com/embed/episode/0LnVU6a3dvZyypH5dliKnc"
  },
  {
    "episode_name": "Matos-Masei: Be aware: you are being watched",
    "episode_description": "Have you ever wondered about the true power of your actions? Let's explore the fascinating way the tribes requested Moshe Rabeinu about living on the other side of the Jordan River. Referencing the wisdom of Rav Zev Leff Shlita, we'll discuss their peculiar approach and the risk of misunderstanding it carries. This conversation sheds light on the idea of \"vehiyusaim nekiyeim\" - being clean and being seen favorably in the eyes of others.  Moving forward, let's examine the profound impact our actions can have on others. We'll explore this concept through the lens of the famous Midrash that emphasizes the ripple effect of our deeds. Furthermore, we'll discuss the intriguing concepts of Lashon Hora and Don l'kaf Zechus, explaining how they can cause a transfer of mitzvahs and aveiros that you may not have been aware of. To conclude this enlightening conversation, we'll share a stirring story about how someone's prayer at the Kosel prompted a generous donation from another individual. This discussion reaffirms the need to be conscious of our actions and their potential to influence others.",
    "release_date": "13-07-23",
    "duration_minutes": 16.48,
    "spotify_web_url": "https://open.spotify.com/episode/1Yw5dxEB1dSWkJ7vpIMR8k",
    "spotify_uri": "spotify:episode:1Yw5dxEB1dSWkJ7vpIMR8k",
    "embed_url": "https://open.spotify.com/embed/episode/1Yw5dxEB1dSWkJ7vpIMR8k"
  },
  {
    "episode_name": "Parshas Masei - Pure motivation",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 12.48,
    "spotify_web_url": "https://open.spotify.com/episode/11BR7BnfmBhhliBipiYtjL",
    "spotify_uri": "spotify:episode:11BR7BnfmBhhliBipiYtjL",
    "embed_url": "https://open.spotify.com/embed/episode/11BR7BnfmBhhliBipiYtjL"
  }
]