[
  {
    "episode_name": "Bereishis Through Clouded Vision to Clarity",
    "episode_description": "Bereishis: Through Clouded Vision to Clarity  What major transformations occurred when Odom and Chava ate from the fruit? What does it mean they were suddenly naked? How does the sin of eating from the Etz Hadas relate to the presence of Haman? What does it mean to have a \"cloudy\" vision of Hashem's will in your life? How can we navigate life's optical illusions to remember Hashem's control, especially during challenging times?  We'll also be discussing the current situation in Israel, acknowledging the deep sadness it brings. While we won't delve into the raw emotional side, we will explore the practical steps we can take spiritually to support and uplift the situation.  Get ready to be amazed, enlightened, and inspired as we journey through the depths of Parashas Bereishis. Don't miss out on this eye-opening episode, and share it with friends and family who might be craving a dose of spiritual enlightenment. Let's all find that path toward a clearer vision of Hashem's will in our lives.",
    "release_date": "12-10-23",
    "duration_minutes": 17.33,
    "spotify_web_url": "https://open.spotify.com/episode/66XI8Ty3e1BfPjvYlYssH3",
    "spotify_uri": "spotify:episode:66XI8Ty3e1BfPjvYlYssH3",
    "embed_url": "https://open.spotify.com/embed/episode/66XI8Ty3e1BfPjvYlYssH3"
  },
  {
    "episode_name": "Parshas Bereishis - Steaks, Wine & Spirituality",
    "episode_description": "Why was Adam given everything on a silver platter? What did his sin change? We explore profound questions on the deeper reasons behind Adam's punishments, the purpose of physicality versus spirituality, and how we can achieve eternal life. Delve into the mystical meanings behind Adam's downfall and the fascinating secrets it reveals about the nature of this world. Discover how we can learn from Adam's mistakes to realign physicality to serve spirituality, unlock blessings, and merit eternal life even in a post-sin world.Visit our website www.prismoftorah.org Keywords:  Adam and Eve, sin of Eden, physicality and spirituality, purpose of creation, eternal life Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 14.99,
    "spotify_web_url": "https://open.spotify.com/episode/2d2118IATcV1zyYp8b8KJG",
    "spotify_uri": "spotify:episode:2d2118IATcV1zyYp8b8KJG",
    "embed_url": "https://open.spotify.com/embed/episode/2d2118IATcV1zyYp8b8KJG"
  },
  {
    "episode_name": "Parshas Bereishis- Shabbos and Tefilla, The Winning Combo",
    "episode_description": "Do you rush in and out of Shabbos? What is the secret spiritual power behind prayer? Join Rabbi Asaf Prisman as he shares incredible stories and wisdom of the Chafetz Chaim to transform how you connect to these pillars, unlock blessings, and reach new spiritual heights. Keywords:Shabbos, prayer, blessings, Chafetz Chaim, spiritualitywww.Prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 21.54,
    "spotify_web_url": "https://open.spotify.com/episode/7Iecam0Ctr7SeOFPsNechR",
    "spotify_uri": "spotify:episode:7Iecam0Ctr7SeOFPsNechR",
    "embed_url": "https://open.spotify.com/embed/episode/7Iecam0Ctr7SeOFPsNechR"
  },
  {
    "episode_name": "Parshas Bereishis- The Optical Illusion World",
    "episode_description": "Hashem created an optical illusion world? How can reality be an illusion? Join Rabbi Asaf Aharon Prisman as he probes the deeper meaning behind the creation story in Bereishis. Learn how each day of creation built another layer of separation between Hashem's direct involvement and the physical world. Discover how nature's cycles seem self-sustaining yet require Hashem's constant creative force. What is the purpose behind this divine sleight of hand? Tune in as Rabbi Prisman unravels the mystery and shows how Shabbos, Shemittah, and our capacity for wisdom reveal the Man Behind the Curtain. This mind-bending journey begins by questioning the obvious and ends by transforming your relationship with Hashem.keywords: Bereishis, creation, nature, illusion, reality, Hashem, Shabbos, Shemittahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 14.61,
    "spotify_web_url": "https://open.spotify.com/episode/5GPPJhhjItFrI8QGL47fGA",
    "spotify_uri": "spotify:episode:5GPPJhhjItFrI8QGL47fGA",
    "embed_url": "https://open.spotify.com/embed/episode/5GPPJhhjItFrI8QGL47fGA"
  },
  {
    "episode_name": "Parshas Bresheis: Win, Win when doing Ratzon Hashem",
    "episode_description": "Hashem's ways are inscrutable. Why did Hevel, who brought the finest offering, lose everything, while Cain retained a legacy? On the surface, it seems unjust. But by peering deeper into the Torah's infinite wisdom, we unravel profound truths about doing the Retzon Hashem. Join Reb Asaf Aharon as he analyzes a fascinating Chasam Sofer on the Cain and Hevel episode. Discover how all pathways lead to the ultimate good when we walk with Hashem, though the road may wind through darkness. Let us rejoice in Hashem's justice and strengthen our resolve to cling to His will.Keywords:- Cain and Hevel, Offerings, Retzon Hashem, Chasam Sofer, Divine providence, Divine justice Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "29-01-24",
    "duration_minutes": 13.84,
    "spotify_web_url": "https://open.spotify.com/episode/3UCXBdGkfQTX4YGYAgQkDN",
    "spotify_uri": "spotify:episode:3UCXBdGkfQTX4YGYAgQkDN",
    "embed_url": "https://open.spotify.com/embed/episode/3UCXBdGkfQTX4YGYAgQkDN"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "25: Parshas Noach- Your real competition",
    "episode_description": "Noach is described as perfect and a Tzaddik. What is the difference between the two? Why do we care about comparing him to other generations? Should we be looking at Noach compared to his potential or compared to those around him? The Ben Ish Chai steps in to provide us with an understanding of how we can find our value. The key: the difference between self-esteem and self-worth. With three ideas on what we should do with our lives. Download: https://bit.ly/3gQ1qhT Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts.",
    "release_date": "27-10-22",
    "duration_minutes": 15.94,
    "spotify_web_url": "https://open.spotify.com/episode/4vrAEtc9rwrzSzq3K4LqIg",
    "spotify_uri": "spotify:episode:4vrAEtc9rwrzSzq3K4LqIg",
    "embed_url": "https://open.spotify.com/embed/episode/4vrAEtc9rwrzSzq3K4LqIg"
  },
  {
    "episode_name": "Noah's Ark of Love & Unity",
    "episode_description": "Why did Noah have to use his own food in the ark? A seemingly redundant phrase in this week's Torah portion holds the key. As we prepare to enter the ark amidst our current storms, understanding this episode can uplift and transform our relationships. What was Noah's secret and how can it empower us today? Let us explore the mystical ideas behind Noah's ark of love and unity. Discover how giving selflessly and seeing our reflection in others can unlock blessings and fulfillment. Join us on this soul-nourishing journey into the prismatic depths of the Torah's timeless wisdom. Keywords:Noah's ark, love, unity, relationships, selflessness, giving, reflection, soul, blessings, fulfillment, wisdomwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "18-10-23",
    "duration_minutes": 20.06,
    "spotify_web_url": "https://open.spotify.com/episode/5mV4IUq9ZFFfOWK1dcFiom",
    "spotify_uri": "spotify:episode:5mV4IUq9ZFFfOWK1dcFiom",
    "embed_url": "https://open.spotify.com/embed/episode/5mV4IUq9ZFFfOWK1dcFiom"
  },
  {
    "episode_name": "Parshas Noach - Chessed, our lifeline",
    "episode_description": "Why was stealing the ultimate sin that sealed the generation's fate in Noah's time? What was the special merit that Noah needed while in the ark to allow existence to continue? Join us as we explore the eternal power of lovingkindness and how it serves as a lifeline between this world and the Divine. Through the story of Noah we'll discover how small acts of kindness ripple into spiritual tsunamis, healing brokenness and sustaining all of creation. keywords: Noah, ark, flood, lovingkindness, chesed, spirituality, Jewish philosophy, Torahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 18.03,
    "spotify_web_url": "https://open.spotify.com/episode/2k0YoqroN4J2BPVyaYEcS4",
    "spotify_uri": "spotify:episode:2k0YoqroN4J2BPVyaYEcS4",
    "embed_url": "https://open.spotify.com/embed/episode/2k0YoqroN4J2BPVyaYEcS4"
  },
  {
    "episode_name": "Parshas Noach - Impact of Society",
    "episode_description": "What does it truly mean to be a tzaddik (righteous person)? If Noach was considered the greatest tzaddik of his generation, how could he not be considered \"anything\" when compared to Avraham Avinu's generation? Let's explore the deeper debate over Noach's righteousness. Through analyzing the Torah's words, we'll gain insight into how our environment shapes us, the immense reward for persevering in times of difficulty, and the eternal worth of living a Torah life. Discover how Noach's journey provides us chizuk to withstand our own nisyonos (spiritual challenges).  Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "29-01-24",
    "duration_minutes": 17.04,
    "spotify_web_url": "https://open.spotify.com/episode/07ownq4DX6quMLdxRinLDb",
    "spotify_uri": "spotify:episode:07ownq4DX6quMLdxRinLDb",
    "embed_url": "https://open.spotify.com/embed/episode/07ownq4DX6quMLdxRinLDb"
  },
  {
    "episode_name": "Parshas Noach - Our relationship with objects",
    "episode_description": "What gives inanimate objects their power? How did Moses become the greatest leader of the Jewish people? What was so special about Samuel's coat? Join Reb Asaf as he unravels the mystery behind our relationship with objects. Delving into little-known stories from the Midrash and Gemara, this episode explores how our actions can imbue physical things with spiritual energy. By pondering such elusive concepts, we unlock the keys to empowering not only objects, but people as well. relationship with objects, inanimate objects, spiritual energy, spiritual power, Moses, Samuel, self-sacrifice  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 12.92,
    "spotify_web_url": "https://open.spotify.com/episode/5AA5LTA6yjxayZZ4qUEqcP",
    "spotify_uri": "spotify:episode:5AA5LTA6yjxayZZ4qUEqcP",
    "embed_url": "https://open.spotify.com/embed/episode/5AA5LTA6yjxayZZ4qUEqcP"
  },
  {
    "episode_name": "Parshas Noach - Staying Connected",
    "episode_description": "Why does the Torah seemingly describe the Mabul in passive terms, without explicitly mentioning Hashem's direct involvement? And what makes the nachash's punishment of having readily available food actually a severe consequence rather than a blessing? In this episode, we uncover profound insights about Hashem's relationship with His creation and what it truly means to be \"disconnected.\" The answer that connects these two seemingly unrelated questions will reveal eye-opening perspectives on how Hashem built the very DNA of the world to respond to our actions. We conclude with two powerful stories. This episode sheds new light on facing life's challenges.  www.prismoftorah.org",
    "release_date": "31-10-24",
    "duration_minutes": 14.71,
    "spotify_web_url": "https://open.spotify.com/episode/022AbRe1NSm2qUglXQ7DQq",
    "spotify_uri": "spotify:episode:022AbRe1NSm2qUglXQ7DQq",
    "embed_url": "https://open.spotify.com/embed/episode/022AbRe1NSm2qUglXQ7DQq"
  },
  {
    "episode_name": "Parshas Noach: Emulating Hashem’s Middos (story)",
    "episode_description": "What would you do if you found yourself lost and alone in unfamiliar territory? How could acts of kindness save you in your darkest hour? Join us as we explore profound questions through a suspenseful real-life story. Journey along winding roads full of mystery as we discover how cultivating noble middot can reap rewards both in this world and the next. Prepare for surprises that will challenge your assumptions, touch your heart, and illuminate a Torah path to truth.Keywords: middot, character traits, lost, Arab village, Ramadan, kindness, storieswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "29-01-24",
    "duration_minutes": 7.03,
    "spotify_web_url": "https://open.spotify.com/episode/7uSB95TpOVD2gHgReoPx1a",
    "spotify_uri": "spotify:episode:7uSB95TpOVD2gHgReoPx1a",
    "embed_url": "https://open.spotify.com/embed/episode/7uSB95TpOVD2gHgReoPx1a"
  },
  {
    "episode_name": "Parshas Noach: The Path to Perfection in Middos",
    "episode_description": "The path to perfection in character - is it through wisdom or righteous deeds? As the floodwaters rose, what was Noah's true failing? We question whether proper conduct precedes the acquisition of Torah, or if it is Torah that uplifts our traits. What did the Sages mean when they said \"derech eretz kadma l'Torah\"--the way of the world comes before the Torah? Join us as we delve into the ancient debate surrounding Noah's responsibility for the flood, and extract lessons about the cultivation of an upright soul. With insight from Rashi and the masters of Musar, we'll find clarity amidst the rising tides of confusion.  Suggested keywords:Noah, flood, character traits, midot, derech eretz, musar, self-improvement Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "29-01-24",
    "duration_minutes": 13.24,
    "spotify_web_url": "https://open.spotify.com/episode/72Sl1s6pUawLZQDZsB1Dkk",
    "spotify_uri": "spotify:episode:72Sl1s6pUawLZQDZsB1Dkk",
    "embed_url": "https://open.spotify.com/embed/episode/72Sl1s6pUawLZQDZsB1Dkk"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Lech Lecha - Which World Are You Living In?",
    "episode_description": "Lech Lecha- Which World Are You Living In? What profound message lies behind Hashem's seemingly reverse-ordered command to Avraham to leave his land before his birthplace and father's house? Why does the Torah describe Lot's capture with such unusual grammar - interrupting his identity as \"Avram's nephew\" with mention of his possessions? Through a fascinating interpretation from the Nesivos Shalom and a compelling story about a Yerushalayim Rosh Yeshiva facing a life-changing decision, this week's Parshas Lech Lecha explores the deeper meaning of truly leaving behind the influences that shape our worldview. Discover how three powerful forces can subtly pull us away from living in true reality. Join us for a transformative perspective on breaking free from illusion and finding your authentic spiritual direction in a world of distractions.",
    "release_date": "07-11-24",
    "duration_minutes": 12.89,
    "spotify_web_url": "https://open.spotify.com/episode/0a41jAXszdmvVth4tcJaeD",
    "spotify_uri": "spotify:episode:0a41jAXszdmvVth4tcJaeD",
    "embed_url": "https://open.spotify.com/embed/episode/0a41jAXszdmvVth4tcJaeD"
  },
  {
    "episode_name": "Lech Lecha: A True Eved Hashem",
    "episode_description": "What trials did Avraham face that proved his unwavering faith? Why does the Gemara say Chizkiyahu deserved such a harsh punishment? What spiritual level can one reach on Purim? Join us as we explore the true meaning of being an Eved Hashem through Avraham's tests, Chizkiyahu's sin, and the revelry of Purim. Discover how refrain from rational calculations and follow Hashem's will with pure, childlike faith.  Avraham, tests of faith, Purim, Chizkiyahu, punishment, Eved Hashem, Lech Lecha, Gemarawww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "29-01-24",
    "duration_minutes": 14.46,
    "spotify_web_url": "https://open.spotify.com/episode/0Y6e1KJBjbS2BBTBwOTY2t",
    "spotify_uri": "spotify:episode:0Y6e1KJBjbS2BBTBwOTY2t",
    "embed_url": "https://open.spotify.com/embed/episode/0Y6e1KJBjbS2BBTBwOTY2t"
  },
  {
    "episode_name": "Lech Lecha: Selfless Devotion",
    "episode_description": "Would you like to explore the life of one of the most influential figures in history? Are you interested in uncovering the insightful lessons from Avraham's remarkable story? Why did he not worry about others accusing him of obtaining wealth through Sdom, yet he exhibited caution with the possessions acquired from Egypt? What distinguished qualities did he possess that made him stand apart from other righteous individuals such as Shem, Ever, and Chanoch? Why did he decline any possessions from Sdom following his triumph over the kings? In this episode, we invite you on an engaging journey through Avraham's life and mission, where you will discover: The unique devotion & spiritual self-sacrifice that he portrayed which made a world of difference.",
    "release_date": "26-10-23",
    "duration_minutes": 16.66,
    "spotify_web_url": "https://open.spotify.com/episode/660FwOWwBzbhdi6pUt7J9w",
    "spotify_uri": "spotify:episode:660FwOWwBzbhdi6pUt7J9w",
    "embed_url": "https://open.spotify.com/embed/episode/660FwOWwBzbhdi6pUt7J9w"
  },
  {
    "episode_name": "Parshas Lech Lecha - Be the best Yid",
    "episode_description": "What trials did Avraham have to endure? Why was Lot's journey so different if they seemingly had the same intentions? How can one truly grow spiritually? In this week's episode, we probe fundamental questions that shape our path. Join us as we unravel the deeper meaning behind Lech Lecha and discover how parallel spiritual growth depends on first uprooting barriers. Let the eternal light of Torah illuminate the way. Keywords: Lech Lecha, Avraham, Lot, spiritual growth, good traits, bad traits, journey, trialswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "06-11-22",
    "duration_minutes": 10.84,
    "spotify_web_url": "https://open.spotify.com/episode/3IKtjzp0vUIo1eBICSpiyb",
    "spotify_uri": "spotify:episode:3IKtjzp0vUIo1eBICSpiyb",
    "embed_url": "https://open.spotify.com/embed/episode/3IKtjzp0vUIo1eBICSpiyb"
  },
  {
    "episode_name": "Parshas Lech Lecha - Growing through life's challenges",
    "episode_description": "What trials await Avraham on his monumental journey? How did Lot fall so far after walking in the shadow of his uncle? Join Reb Asaf as he unravels the deeper meaning behind Lech Lecha. Discover how life's challenges lift the righteous and why Avraham's hospitality stands apart. Listen as we differentiate true kindness from mere emotion and unveil how one driver realized the power inherent in his Jewish soul.  Tune in to uncover how our forefather set out to emulate the attributes of Hashem through self-sacrifice. Hashem elevates those who rise to meet hardship with faith. Lech Lecha - progress lies not in the arrival but in persevering through the passage.  Keywords: Lech Lecha, Avraham, Lot, challenges, growth mindset, acts of lovingkindness, chesed, self-sacrifice, emulating Hashemwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 15.44,
    "spotify_web_url": "https://open.spotify.com/episode/7L2421kz8xriAQcREEpbLM",
    "spotify_uri": "spotify:episode:7L2421kz8xriAQcREEpbLM",
    "embed_url": "https://open.spotify.com/embed/episode/7L2421kz8xriAQcREEpbLM"
  },
  {
    "episode_name": "Parshas Lech Lecha- Living in Confusion",
    "episode_description": "What was so unique about Avraham's actions that marked the beginning of the era of Torah? On the surface, he seems to have done what previous tzaddikim did - rebuke idol worshippers. But the confusion runs deeper. This week, journey into the blurred lines between mitzvah and averah. Where truths are warped, and even sins dressed as virtues. As we explore the eternal struggle between clarity and confusion, discover how Avraham Avinu brought the light of Torah into the darkness. Get ready for a thought-provoking discussion that will leave you questioning everything you thought you knew. Keywords:Avraham Avinu, idol worship, sin/averah, mitzvah, confusion/lack of clarity, era of Torah beginnings  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-02-24",
    "duration_minutes": 14.45,
    "spotify_web_url": "https://open.spotify.com/episode/738e5liiwWmFRGZrqpMMKA",
    "spotify_uri": "spotify:episode:738e5liiwWmFRGZrqpMMKA",
    "embed_url": "https://open.spotify.com/embed/episode/738e5liiwWmFRGZrqpMMKA"
  },
  {
    "episode_name": "26: Parshas Lech Lecha- Beyond Nature",
    "episode_description": "26: Parshas Lech Lecha- Beyond Nature Surviving being thrown in the fire, being victorious over the mightiest kings and other supernatural events, the Medrash tells us Avraham survived. Is moving a real test for Avrohom, seeing that Hashem told him this directly?  Understanding real test Avrohom was being faced with. How can we merit to live a life beyond the limitations of nature? What is the message for us? A spellbinding story of a well-planned trip going unexpectedly several times and how it ends…. Story starts at: 15:40 Download: https://bit.ly/3zEKfX7 Apple podcast: https://bit.ly/3RqLgIq  Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc  Or wherever you get your podcasts.",
    "release_date": "03-11-22",
    "duration_minutes": 23.35,
    "spotify_web_url": "https://open.spotify.com/episode/6FSXr4c2nvmQX1WCVdJrjH",
    "spotify_uri": "spotify:episode:6FSXr4c2nvmQX1WCVdJrjH",
    "embed_url": "https://open.spotify.com/embed/episode/6FSXr4c2nvmQX1WCVdJrjH"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "27: Parshas Vayera seize the moment",
    "episode_description": "This week with Reb Asaf Aharon Prisman Avraham, known for his generosity /Chessed and kindness, gets tested with an act of Gvura (Thus overcoming his MIdda of Chessed which was his essence). Almost all Siddurim have Akeidat Yitzchak in the davening with a Yehi Ratzon at the end requesting Hashem to actually do the opposite and ensure His Mida of Chessed overcomes His MIda of Gvura. What is exactly this request of ours to Hashem? What do we learn from this? How can this affect our lives? What is the vital lesson we can learn from this? How can we know what we should be working on in our daily lives?  A great story about a Rebbe that knew all of the above and used this crucial information to impact his Talmid. this and more... Download: https://bit.ly/3fOD481 Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts.",
    "release_date": "10-11-22",
    "duration_minutes": 17.6,
    "spotify_web_url": "https://open.spotify.com/episode/5HoTUqJfZWBnkZ9sYkfqBf",
    "spotify_uri": "spotify:episode:5HoTUqJfZWBnkZ9sYkfqBf",
    "embed_url": "https://open.spotify.com/embed/episode/5HoTUqJfZWBnkZ9sYkfqBf"
  },
  {
    "episode_name": "Parshas Vayera - Is Your Chesed Really Kind?",
    "episode_description": "How can giving less sometimes mean giving more? What's the hidden wisdom behind Avraham Avinu's seemingly stingy water portion to his guests? This week's episode uncovers a fascinating paradox in Parshas Vayera that challenges our understanding of true chesed. Through the lens of Avraham's careful hospitality and Sarah's miraculous nursing, we discover why timing and balance are crucial in acts of kindness. From ancient water carriers to modern-day pools near yeshivas, this episode reveals how genuine Chesed transforms not just the recipient but the giver as well. Join us for an eye-opening exploration of how to perform chesed that uplifts everyone involved - without undermining anyone else.  Always on www.prismoftorah.org",
    "release_date": "14-11-24",
    "duration_minutes": 15.2,
    "spotify_web_url": "https://open.spotify.com/episode/3fYUrzKgOjNWQ8Os9X0tip",
    "spotify_uri": "spotify:episode:3fYUrzKgOjNWQ8Os9X0tip",
    "embed_url": "https://open.spotify.com/embed/episode/3fYUrzKgOjNWQ8Os9X0tip"
  },
  {
    "episode_name": "Parshas Vayera - Not to Judge",
    "episode_description": "Not to Judge Hashem destroyed Sodom for their evil, yet why did Avraham plead for mercy? If Avraham excelled in hospitality, shouldn't he judge them harshly? Discover how in this episode we unravel the puzzle of righteousness and judgment. Join Reb Asaf as he mines wisdom from Parshat Vayera, revealing how we can curb criticism and understand people's inner struggles. Learn the key to peaceful relationships from our forefather's example. Suggested keywords:Parshat Vayera, Avraham, Sodom, judgment, criticism, understanding otherswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 11.13,
    "spotify_web_url": "https://open.spotify.com/episode/2JKIO0NhjcPGZiDbNDUs3I",
    "spotify_uri": "spotify:episode:2JKIO0NhjcPGZiDbNDUs3I",
    "embed_url": "https://open.spotify.com/embed/episode/2JKIO0NhjcPGZiDbNDUs3I"
  },
  {
    "episode_name": "Parshas Vayera - The Potential Impact of a Mitzvah",
    "episode_description": "What compelled our forefather Avraham to yearn for guests when he was in agonizing pain? Why wasn’t he relieved that no travelers needed his help that day? Discover the deeper purpose and extraordinary impact of Avraham's kindness. Join us as we mine the depths of this week's parsha and unravel the mystery behind Avraham's hospitality.  Keywords:Avraham, vayera, parsha, mitzvah, guests, hospitality, kindness, impact, chesedwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 14.38,
    "spotify_web_url": "https://open.spotify.com/episode/4LNHABusj2w4rTloXEpxT7",
    "spotify_uri": "spotify:episode:4LNHABusj2w4rTloXEpxT7",
    "embed_url": "https://open.spotify.com/embed/episode/4LNHABusj2w4rTloXEpxT7"
  },
  {
    "episode_name": "Parshas Vayera - The ultimate test in life",
    "episode_description": "The ultimate test of faith - to sacrifice your own son? Could you do it? Discover why Hashem's call to Avraham provides a profound insight into the meaning of God-fearing. Listen as our host, Reb Asaf Aharon Prisman, unravels this question, revealing how Avraham's willingness to go against his inherent nature demonstrates an unflinching commitment to divine will. Culled from the story of Akeidat Yitzchak, this profound lesson challenges us to move beyond our comfort zones in serving Hashem. What is the secret link between our inner will and receiving heavenly blessings? Tune in to discover.keywords: Akeidat Yitzchak, Vayera, Abraham's test, faith, self-sacrifice, divine will, going against human nature, blessingswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 9.98,
    "spotify_web_url": "https://open.spotify.com/episode/3lCur3SflZryGZMoseJF6T",
    "spotify_uri": "spotify:episode:3lCur3SflZryGZMoseJF6T",
    "embed_url": "https://open.spotify.com/embed/episode/3lCur3SflZryGZMoseJF6T"
  },
  {
    "episode_name": "Parshas Vayera - There is nothing like a Mothers intuition",
    "episode_description": "What lurks in one's heart? Can inner intentions transcend into outer realities? In this week's Parsha Vayera, Sarah Imenu's clarity of vision perceives what Avraham cannot - the danger of Yishmael's ways. Through her foresight, she acts to protect her son Yitzchak. Generations later, a mother's intuition similarly guides her son back from the brink, after friends lead him astray. Join Rabbi Asaf Aaron Prisman as he delves into the power of a Jewish mother’s intuition, its roots in the Parsha, and its continuing impact through the generations. Discover how we can nurture our own inner sight to choose blessing over danger, for ourselves and our families.Keywords: Vayera, Sarah Imenu, Yishmael, Yitzchak, mother’s intuition, heart, spiritual vision, parenting, families  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 14.72,
    "spotify_web_url": "https://open.spotify.com/episode/4gnwmHMvGVufUql4D8Yn5p",
    "spotify_uri": "spotify:episode:4gnwmHMvGVufUql4D8Yn5p",
    "embed_url": "https://open.spotify.com/embed/episode/4gnwmHMvGVufUql4D8Yn5p"
  },
  {
    "episode_name": "Parshas Vayera- Iron Dome for Ayin Hara",
    "episode_description": "In this podcast, we will explore the concept of Ayin Hara (Evil Eye) and its impact on our lives. We will discuss how to shield ourselves from its dangerous potential severe impact. We will also delve into the story of Sara Imeinu, who possessed the level of prophecy, and how she did not believe Hashem that she was going to have another baby. We will also explore how Sara suggested to Avraham that “she did not laugh,” even though she indeed laughed once she heard she was going to have a baby. Finally, we will examine the dialogue between Sara and Hashem (via Avrohom). Join us as we answer all these questions and connect the concept that we portray to historical events and current events in the past week.",
    "release_date": "02-11-23",
    "duration_minutes": 18.31,
    "spotify_web_url": "https://open.spotify.com/episode/2jRqXxFvInG0M8PTjp2MYM",
    "spotify_uri": "spotify:episode:2jRqXxFvInG0M8PTjp2MYM",
    "embed_url": "https://open.spotify.com/embed/episode/2jRqXxFvInG0M8PTjp2MYM"
  },
  {
    "episode_name": "Vayera - Feasting on Food for Thought",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-10-23",
    "duration_minutes": 9.78,
    "spotify_web_url": "https://open.spotify.com/episode/4CdUW0iNfFdtxPa71PV0PV",
    "spotify_uri": "spotify:episode:4CdUW0iNfFdtxPa71PV0PV",
    "embed_url": "https://open.spotify.com/embed/episode/4CdUW0iNfFdtxPa71PV0PV"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Chayee Soroh - Importance of Acquiring a Friend",
    "episode_description": "What cursed ancestor still lurks within Eliezer's soul? How did Avraham see selfishness where Eliezer did not? Can traces of ancient curses resurface generations later? Journey alongside our host into the mysteries of inheritance as he tackles profound questions about Eliezer's complex spiritual journey. Learn how working on oneself and seeking objective counsel can help overcome deeply rooted flaws. Let this podcast episode on Parshat Chayei Sarah take you on a suspenseful ride full of startling twists and eye-opening self-discovery. Keywords: Eliezer, servant, Avraham, curse, selfishness, personal growth, self-improvement, parsha, Torahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 11.21,
    "spotify_web_url": "https://open.spotify.com/episode/7bdCu2jOhKwQUKL2WoMP9H",
    "spotify_uri": "spotify:episode:7bdCu2jOhKwQUKL2WoMP9H",
    "embed_url": "https://open.spotify.com/embed/episode/7bdCu2jOhKwQUKL2WoMP9H"
  },
  {
    "episode_name": "Parshas Chayee Soroh - True Farmer Story",
    "episode_description": "In the Torah's promised land, a lone farmer dared to fulfill an ancient covenant. As his crops withered, skeptics abounded. Yet through an act of faith, bounty miraculously bloomed. This is the story of Chayei Sara’s true son of the soil. A parable of providence awaiting those who honor the Almighty’s word. When we nurture our soul, Hashem nurtures our soil. keywords: shemitah, farming, israel, jewish farmer, faith, miracles, divine providencewww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 10.48,
    "spotify_web_url": "https://open.spotify.com/episode/3Y9ZSWSiZNLCVLNTWnwYjC",
    "spotify_uri": "spotify:episode:3Y9ZSWSiZNLCVLNTWnwYjC",
    "embed_url": "https://open.spotify.com/embed/episode/3Y9ZSWSiZNLCVLNTWnwYjC"
  },
  {
    "episode_name": "Parshas Chayee Soroh - Trusting the Journey",
    "episode_description": "Life's journey often follows an unexpected path, much like a bus bound for Rehovot that gets rerouted to Jerusalem. In this poignant episode, Reb Asaf unveils the deeper meaning behind a Pesach travel mishap. Why did the bus fail to arrive for over 90 minutes? Was the delay truly accidental or part of a greater plan? By analyzing Chazal's teachings on bitachon and connecting the strands of a candid bus driver confession, Asaf extracts powerful insights on trusting Hashem through life's twists and turns. If you've ever struggled to understand challenging circumstances, this podcast will profoundly challenge your perspective. Let Reb Asaf be your guide on the road ahead. Keywords:Bitachon, faith, trust, journey, Chazal, Pesach stories, life lessons  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 7.03,
    "spotify_web_url": "https://open.spotify.com/episode/1riYxtjfSzIlESM05a12C8",
    "spotify_uri": "spotify:episode:1riYxtjfSzIlESM05a12C8",
    "embed_url": "https://open.spotify.com/embed/episode/1riYxtjfSzIlESM05a12C8"
  },
  {
    "episode_name": "Parshas Chayee Soroh- Living Life B'emunah",
    "episode_description": "In this week's parsha, Chayei Sarah, we ponder the verse stating Sarah's age. Why the repetition of years? Rashi teaches that at 100, her sins were negligible, and at 20, her beauty shone as if she were 7. Perplexing! We explore contradictions about Sarah - her renowned beauty, yet extreme righteousness. How to reconcile? The key is Sarah's sublime mindset throughout life's peaks and pits. We cull an eternal lesson on living with steadfast faith. Immerse in the stirring story revealing Sarah's crowning quality. Keywords: Chayei Sarah, parsha, Rashi, Sarah Imeinu, beauty, spirituality, nevuah, emunah, bitachonwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-02-24",
    "duration_minutes": 8.87,
    "spotify_web_url": "https://open.spotify.com/episode/3FoM1fAbRMTV1OCjsjcx8P",
    "spotify_uri": "spotify:episode:3FoM1fAbRMTV1OCjsjcx8P",
    "embed_url": "https://open.spotify.com/embed/episode/3FoM1fAbRMTV1OCjsjcx8P"
  },
  {
    "episode_name": "Parshas Chayei Sarah - Walking The Talk",
    "episode_description": "The Righteous say little and do much, while the Wicked say much and do little\" - but why does how much we talk define our righteousness? Shouldn't actions alone matter? In this eye-opening episode, we uncover a revolutionary understanding of human nature through the lens of Avraham Avinu's behavior in contrast to Ephron's. Through Reb Yerucham, the Mir Mashgiach's profound insight, we discover how our neshamah's natural desire for chesed can actually be diminished by merely talking about our intentions. Through a powerful contemporary story of a young boy named Shmulik and his remarkable notebook of Chesed, we explore the psychological concept of \"moral licensing\" and its spiritual implications. Could your words be inadvertently satisfying your soul's thirst for doing good before you even act? Join us for an illuminating journey that will transform how you think about every act of kindness.",
    "release_date": "21-11-24",
    "duration_minutes": 10.32,
    "spotify_web_url": "https://open.spotify.com/episode/7BUCQofVjNhvWUN8TqMFcT",
    "spotify_uri": "spotify:episode:7BUCQofVjNhvWUN8TqMFcT",
    "embed_url": "https://open.spotify.com/embed/episode/7BUCQofVjNhvWUN8TqMFcT"
  },
  {
    "episode_name": "Parshas Chayei Sarah- Life is not black or white",
    "episode_description": "What drove Lavan's actions - righteousness or wickedness? As we judge others, do we see the world in simplistic black and white? Join us as we explore the nuances in Parshat Chayei Sarah. Hashem sees the good amidst the bad. Should we not see the glimmers of good in even the most challenging people? Let us open our eyes to find the sparks of kedusha that await us. Keywords:Lavan, righteousness, wickedness, judging others, black and white thinking, nuance, Parshat Chayei Sarah, finding goodwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 6.54,
    "spotify_web_url": "https://open.spotify.com/episode/4EWr4nJhLbFttd0vT5MWCe",
    "spotify_uri": "spotify:episode:4EWr4nJhLbFttd0vT5MWCe",
    "embed_url": "https://open.spotify.com/embed/episode/4EWr4nJhLbFttd0vT5MWCe"
  },
  {
    "episode_name": "Parshas Chayei Sarah- Thirst to do good",
    "episode_description": "What drives the righteous to boundless generosity while the wicked seem to always fall short? On this week's Parsha Chayei Sarah, delve into an eternal conundrum - do we speak goodness into being or let actions do the talking? Traverse this philosophical maze guided by timeless wisdom to uncover the root of human nature. As the thirst for righteousness lies within us all, could quenching it be the key that unlocks our highest potential? Keywords: parsha, chayei sarah, avraham, ephron, righteous, wicked, speaking, actions, human nature, thirst, quench, potentialwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 7.25,
    "spotify_web_url": "https://open.spotify.com/episode/1CTsTpfXIYqwGfVZApNOEg",
    "spotify_uri": "spotify:episode:1CTsTpfXIYqwGfVZApNOEg",
    "embed_url": "https://open.spotify.com/embed/episode/1CTsTpfXIYqwGfVZApNOEg"
  },
  {
    "episode_name": "Parshas Chayei Sarah: From Pain into Gain",
    "episode_description": "Have you ever pondered the correlation between the innocence of a child and the concept of beauty? Or contemplated the true meaning of leading a fulfilling life? Join us in this week's podcast as we delve into the profound wisdom embodied in Sarah's extraordinary journey - a tale far from the ordinary! Why does Rashi propose that Sarah's beauty at the age of 20 resembled that of a 7-year-old? And what significance lies in the statement, \"They were all equally good\"? In addition, why does the Torah extensively detail Sarah Imenu's years, unlike other female figures? Uncover the profound lessons that can be gleaned from Sarah's unwavering strength during challenging moments, and discover how her example can inspire resilience within ourselves.",
    "release_date": "09-11-23",
    "duration_minutes": 13.66,
    "spotify_web_url": "https://open.spotify.com/episode/3AgZzDOCZxgbN4YYfbKPo7",
    "spotify_uri": "spotify:episode:3AgZzDOCZxgbN4YYfbKPo7",
    "embed_url": "https://open.spotify.com/embed/episode/3AgZzDOCZxgbN4YYfbKPo7"
  },
  {
    "episode_name": "28: Parshas Chayei Sarah - I ❤️Chessed",
    "episode_description": "28: Parshas Chayei Sarah - I ❤️Chessed Eliezer prays for a seemingly irrational sign from Hashem to help him find the right girl for Yitzchok. Why? What was he checking for? What did Avraham stand for in chessed that needed to continue? Through a cute story, we will try to find the answer. What is the clear demarcation between a baal chessed as opposed to a person being taken advantage of? Let's love chessed and do it right! Download: http://bit.ly/3GjFCFN Apple podcast: https://bit.ly/3RqLgIq  Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc  Or wherever you get your podcasts.",
    "release_date": "17-11-22",
    "duration_minutes": 15.41,
    "spotify_web_url": "https://open.spotify.com/episode/38rQfrBUmlEPgwJmgUJprV",
    "spotify_uri": "spotify:episode:38rQfrBUmlEPgwJmgUJprV",
    "embed_url": "https://open.spotify.com/embed/episode/38rQfrBUmlEPgwJmgUJprV"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Toldos - Antidote to Rote",
    "episode_description": "Whose prayers hold greater power and impact - the righteous child of a wicked parent or the righteous child of a righteous parent? At first glance, it may appear that the former would possess a stronger influence. Yet, in this week's parsha, it is Yitzchak's supplication that is resoundingly answered, rather than Rivka's. This revelation sparks intrigue: what hidden advantage did Yitzchak possess? Delve into our latest podcast episode where we embark on a profound exploration of prayer and the perpetual challenges of life. We unravel captivating insights that defy conventional wisdom. How did Yitzchak's unorthodox approach shatter existing patterns, and what profound wisdom can it impart upon our own spiritual journeys? Join us on this captivating journey as we navigate the perils and pitfalls that lie in our way. How can we shield ourselves from merely going through the motions in our sacred bond with Hashem? What invaluable teachings can we glean from Yitzchak's journey that are acutely relevant to the critical juncture we find ourselves in today?",
    "release_date": "16-11-23",
    "duration_minutes": 13.68,
    "spotify_web_url": "https://open.spotify.com/episode/1RwwbLbqjhkV4qeRjGGFsg",
    "spotify_uri": "spotify:episode:1RwwbLbqjhkV4qeRjGGFsg",
    "embed_url": "https://open.spotify.com/embed/episode/1RwwbLbqjhkV4qeRjGGFsg"
  },
  {
    "episode_name": "Parshas Toldos - Break Free From Autopilot",
    "episode_description": "Ever wonder why going through the motions feels spiritually empty, even when you're doing everything right? This week, we tackle a paradox that might shake up your perspective: Sometimes, growing up with a silver spoon of spirituality presents the greatest challenge to authentic Avodas Hashem. Through an eye-opening analysis of Yitzchak's Tefillos, we uncover why maintaining genuine enthusiasm can be harder than starting fresh. Join us as we explore the hidden struggle of the tzaddik's child - the art of transforming inherited wisdom into personal truth. Whether you're feeling stuck in spiritual routine or searching for your unique path, this episode confronts the unspoken challenge of keeping your Yiddishkeit real and raw in a world of comfortable conformity.",
    "release_date": "28-11-24",
    "duration_minutes": 15.4,
    "spotify_web_url": "https://open.spotify.com/episode/6sAN0EbjLfiTxnHMasq1me",
    "spotify_uri": "spotify:episode:6sAN0EbjLfiTxnHMasq1me",
    "embed_url": "https://open.spotify.com/embed/episode/6sAN0EbjLfiTxnHMasq1me"
  },
  {
    "episode_name": "Parshas Toldos - Continues Giving",
    "episode_description": "Hashem's blessings begin with \"And.\" But what comes before the \"and?\" Is Hashem's beneficence unending? Does the eternal flow from Above demand an eternal return from below? Join Rebb Asaf Aharon Prisman as he plumbs the depths of Parshat Toldot to uncover insights on cultivating an unbroken connection to the Divine. Learn how we can make our avodat Hashem a seamless conduit of gratitude, awareness, and growth. Keywords:Parshat Toldot, Torah insights, spiritual growth, Jewish philosophy, avodat Hashemwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 9.76,
    "spotify_web_url": "https://open.spotify.com/episode/12yw5Ujd0G7NVFP35q9wp4",
    "spotify_uri": "spotify:episode:12yw5Ujd0G7NVFP35q9wp4",
    "embed_url": "https://open.spotify.com/embed/episode/12yw5Ujd0G7NVFP35q9wp4"
  },
  {
    "episode_name": "Parshas Toldos - Freedom of Choice vs Sold Game",
    "episode_description": "In this week's parsha, we grapple with a fundamental question: do we truly have free will? As the struggle between Yaakov and Esav begins in the womb, we wonder - was Esav destined to be wicked? Or did he choose his path? Join us as we unravel the mysteries of fate, nature, and choice. Delving into Rashi and the Midrashim, we discover Hashem's intricate system. Though we are born with certain tendencies, ultimately our righteousness depends on us alone. Hashem judges each person as an individual with unique circumstances. By understanding our personal traits, we can maximize our potential for growth. So come discover your place in Hashem's plan!keywords:parsha, toldos, yaakov, esav, free will, fate, nature vs nurture, personal growth, righteousness www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "10-02-24",
    "duration_minutes": 13.99,
    "spotify_web_url": "https://open.spotify.com/episode/0y06jVpXQWLMdpQigNsk8K",
    "spotify_uri": "spotify:episode:0y06jVpXQWLMdpQigNsk8K",
    "embed_url": "https://open.spotify.com/embed/episode/0y06jVpXQWLMdpQigNsk8K"
  },
  {
    "episode_name": "Parshas Toldos - Is There Really Free Will?",
    "episode_description": "Does free will truly exist? This week's Parsha raises perplexing questions that seem to challenge a fundamental tenet of Judaism. Why does the Torah state that Yaakov and Esav struggled in the womb, exhibiting opposite tendencies even before birth? Did they have a choice? Join us as we delve into the intriguing mysteries surrounding the tension between destiny and personal agency. With penetrating insight, we will attempt to unravel the paradoxes, reconcile seeming contradictions, and emerge with a deeper understanding of the human condition. keywords:free will, destiny, personal agency, Yaakov, Esav, Torah contradictions, human naturewww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "10-02-24",
    "duration_minutes": 14.43,
    "spotify_web_url": "https://open.spotify.com/episode/1UdVFA3iI409tQyozBcufh",
    "spotify_uri": "spotify:episode:1UdVFA3iI409tQyozBcufh",
    "embed_url": "https://open.spotify.com/embed/episode/1UdVFA3iI409tQyozBcufh"
  },
  {
    "episode_name": "Parshas Toldos - Optimizing the Cards",
    "episode_description": "This is part of the archive system, visit our website www.prismoftorah.com or listen to our current shows for more information.Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 12.82,
    "spotify_web_url": "https://open.spotify.com/episode/5PW3NuELv7LOZvdXGlP8Da",
    "spotify_uri": "spotify:episode:5PW3NuELv7LOZvdXGlP8Da",
    "embed_url": "https://open.spotify.com/embed/episode/5PW3NuELv7LOZvdXGlP8Da"
  },
  {
    "episode_name": "Parshas Toldos - The Brachos",
    "episode_description": "The BrachosThe age-old question: Why do the righteous suffer? This week we explore the mystifying story of Yaakov and Esav’s struggle in the womb. What were they truly fighting over – the physical or spiritual realms? Did Yitzchak favor wicked Esav over righteous Yaakov? Join us as we unravel Esav's warped logic that nearly landed him both worlds. Delve deep into the hidden meanings behind the brachos. Discover how one misstep can cost you eternity. keywords: Yaakov, Esav, brachos, spiritual growth, righteousnesswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "10-02-24",
    "duration_minutes": 8.42,
    "spotify_web_url": "https://open.spotify.com/episode/24puvp0gwlOpi6Zed5Y1um",
    "spotify_uri": "spotify:episode:24puvp0gwlOpi6Zed5Y1um",
    "embed_url": "https://open.spotify.com/embed/episode/24puvp0gwlOpi6Zed5Y1um"
  },
  {
    "episode_name": "29: Parshas Toldos- Who’s fooling who?",
    "episode_description": "Reb Asaf Aharon Prisman on the Parsha Common… really? Yitzchok, forefather of the Jewish nation, who Hashem spoke to, did not know the evils of his son, Esav? He thought Esav was the good one? In the reality, who is tricking who? What was the game he was really playing? Based on an amazing idea from the Zichron Meir, we can entirely change our perspective when we deal with people, especially those closest to us. Also, a beautiful story of a Yeshiva Bachur kicked out of Raden and his memories of the Chofetz Chaim. Don’t forget to subscribe and share with all those you know and love. Download: https://t2m.co/phTtW15y NOT A PAID ADVERT The concept of this Dvar Torah has been laid out in a book on Chinuch called Raising a Loving Family By Rabbi Shimon Russel. The book just came out and is already a bestseller. Apple podcast: https://bit.ly/3RqLgIq  Google Podcast: https://bit.ly/3AZuoTL  Spotify: https://bit.ly/3CIMoDc  Or wherever you get your podcasts.",
    "release_date": "24-11-22",
    "duration_minutes": 13.33,
    "spotify_web_url": "https://open.spotify.com/episode/1o4ojk4slcEijaiD5u5HOt",
    "spotify_uri": "spotify:episode:1o4ojk4slcEijaiD5u5HOt",
    "embed_url": "https://open.spotify.com/embed/episode/1o4ojk4slcEijaiD5u5HOt"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "30! Parshas Vayeitzei: nothing is for sure",
    "episode_description": "30! Parshas Vayeitzei: nothing is for sure Using a great parable to Segway into the questions, why does Yaacov add certain words to his Teffilah? What can we learn from it? Using the answer, we can understand the ideal way of life, the reason we are alive. All here this week! We just got our statistics from Spotify. Thank you for all your continued support. Even just listening and recommending this to friends is an enormous help! Thank you from Eli Podcast Productions! The links for this week are each doubled: : Download: http://bit.ly/3OOX87g https://www.dropbox.com/s/ok1ow4349m642xe/30%21%20Parshas%20Vayeitzei-%20nothing%20is%20for%20sure%20%282%29.mp3?dl=1 Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts.",
    "release_date": "01-12-22",
    "duration_minutes": 17.83,
    "spotify_web_url": "https://open.spotify.com/episode/3yLtYjq35DerM85Y8Fye0M",
    "spotify_uri": "spotify:episode:3yLtYjq35DerM85Y8Fye0M",
    "embed_url": "https://open.spotify.com/embed/episode/3yLtYjq35DerM85Y8Fye0M"
  },
  {
    "episode_name": "Parshas Vayeitze - When All Doors Close, Heaven Opens",
    "episode_description": "When do our deepest prayers finally break through? What happens when we realize that even our closest supporters - our spouse, our teachers, even great tzaddikim - can't help us anymore? In this exploration of Parshas Vayetze, we uncover a stunning insight about why Hashem sometimes seems to close every door except one. Through the profound stories of Rachel Imeinu, Chana, and a remarkable shidduch that started with a letter carried by the wind, we discover why our moments of greatest isolation might actually be divine orchestration. This episode reveals how our most painful experiences of feeling utterly alone can transform into the exact catalyst needed for our prayers to reach unprecedented heights. Join us for an eye-opening journey into understanding why sometimes having nowhere else to turn becomes our greatest blessing.",
    "release_date": "05-12-24",
    "duration_minutes": 14.36,
    "spotify_web_url": "https://open.spotify.com/episode/7fgjmd7d9O2blbOtwdooaw",
    "spotify_uri": "spotify:episode:7fgjmd7d9O2blbOtwdooaw",
    "embed_url": "https://open.spotify.com/embed/episode/7fgjmd7d9O2blbOtwdooaw"
  },
  {
    "episode_name": "Parshas Vayeitzei - A blessing in disguise",
    "episode_description": "In this week's Parsha, we unravel the mysteries behind Leah and Rachel's complex relationship. Why was Leah so upset when she had already been saved by Rachel's selfless act? We also tackle the deeper meaning behind the Chanukah miracle and its connection to Yosef Hatzadik. Join us as we journey beyond the superficial to reveal how seeming misfortunes often disguise hidden blessings. Hashem transforms painful challenges into catalysts for growth when we summon the courage to press on. Through captivating stories and sharp analysis, discover how to view troubles as opportunities knocking and unveil the unbelievable kindness embedded in this world's optical illusions. Keywords: Leah and Rachel, Chanukah miracle, Yosef Hatzadik, optical illusions, hidden blessingswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 16.93,
    "spotify_web_url": "https://open.spotify.com/episode/7ma4eEPCZbbCDgwEAXYE8u",
    "spotify_uri": "spotify:episode:7ma4eEPCZbbCDgwEAXYE8u",
    "embed_url": "https://open.spotify.com/embed/episode/7ma4eEPCZbbCDgwEAXYE8u"
  },
  {
    "episode_name": "Parshas Vayeitzei - Act of Rochel (Dvar Torah)",
    "episode_description": "What is the true meaning of kindness? How far would we go to avoid embarrassing someone? This week's Torah portion reveals Rachel's unbelievable sacrifice to protect her sister Leah's dignity. Yet Leah later lashes out against Rachel ruthlessly. How could this be? Tune in as we unpack the mysteries behind Rachel's altruism, the tragic misunderstanding between the sisters, and how we can apply these lessons to avoiding humiliation and nurturing true kindness. As we dive deeper into the eternal teachings, we'll discover ourselves and relationships transformed.Keywords:Torah, Vayetzei, Rachel, Leah, kindness, embarrassment, relationships, growth Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 8.57,
    "spotify_web_url": "https://open.spotify.com/episode/2Q2TQt9VhNVlbwhWFKAHlq",
    "spotify_uri": "spotify:episode:2Q2TQt9VhNVlbwhWFKAHlq",
    "embed_url": "https://open.spotify.com/embed/episode/2Q2TQt9VhNVlbwhWFKAHlq"
  },
  {
    "episode_name": "Parshas Vayeitzei - Being honest with oneself",
    "episode_description": "What was Yaakov's great mistake? Why did he get punished for 22 long years? What insight explains this conundrum that can transform our own relationship with mitzvos? Let us decode the timeless messages embedded in Parshas Vayeitzei through a piercing analysis that will leave you spellbound. Delve into the eternal wisdom of our sages with Rabbi Asaf Aharon Prisman who illuminates a profound concept - do the right thing even when you have no time. Let truths from Torah stir your soul and enrich your life starting now... Keywords: Parshas Vayeitzei, Yaakov, 22 years, punishment, mitzvos, kibud av v'eim, time management, torah wisdom  www,prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 15.37,
    "spotify_web_url": "https://open.spotify.com/episode/3ucr7EBnYNl8wgt007iZ4d",
    "spotify_uri": "spotify:episode:3ucr7EBnYNl8wgt007iZ4d",
    "embed_url": "https://open.spotify.com/embed/episode/3ucr7EBnYNl8wgt007iZ4d"
  },
  {
    "episode_name": "Parshas Vayeitzei - How to Earn Miracles Above Nature",
    "episode_description": "How to Earn Miracles Above Nature What hidden truths lie behind our world of illusion? Journey into the mystical realms as we unravel the deepest secrets. Discover how falling opens the path to rising higher. Explore the paradoxes that shape reality. Hashem's miracles shine beyond the constraints of nature for those who dare to reach further. Like flickering flames that illuminate the darkness, new understandings await. Join us and expand your horizons as we trace the eternal light to its source, guided by timeless teachings that illuminate the way forward. The keys to life's riddles await those who seek.Keywords:Parsha, Vayetze, miracles, nature, Hanukkah, Yosef, self-improvement  Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 11.38,
    "spotify_web_url": "https://open.spotify.com/episode/31dtcTZdWjjoy0QNOj8UuH",
    "spotify_uri": "spotify:episode:31dtcTZdWjjoy0QNOj8UuH",
    "embed_url": "https://open.spotify.com/embed/episode/31dtcTZdWjjoy0QNOj8UuH"
  },
  {
    "episode_name": "Parshas Vayeitzei - Maximize the impact of davening",
    "episode_description": "Maximize The Impact of Your Davening Why did Yaakov speak so harshly to Rachel? Her agony over being childless seems to deserve compassion, not blame. Or does it? What if Yaakov had deeper motives? By posing thoughtful questions, we unravel the mystery behind this puzzling interaction. Discover how desperation can be the key to answered prayers. Listen as we explode the illusion that anyone but Hashem is in control. Let us rethink the role of suffering in reaching greater closeness to Hakadosh Baruch Hu.  Keywords:Yaakov, Rachel, childlessness, harsh words, compassion, spiritual growth, personal responsibility, prayer, divine providence www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 14.9,
    "spotify_web_url": "https://open.spotify.com/episode/6tFpefJe8kyKfRCVgUtDbm",
    "spotify_uri": "spotify:episode:6tFpefJe8kyKfRCVgUtDbm",
    "embed_url": "https://open.spotify.com/embed/episode/6tFpefJe8kyKfRCVgUtDbm"
  },
  {
    "episode_name": "Parshas Vayeitzei - Prayer from the depths of your heart",
    "episode_description": "Why did Yaakov get angry at Rachel? She was in distress, longing for a child. Shouldn't he have comforted her? Or did Yaakov know that Rachel needed to cry out to Hashem alone? Join us as we delve into the depths of tefillah, exploring how hardship can lead us to genuine prayer. When we realize no one can save us but Hashem, that is when we truly call out. Discover how crisis fueled the tefillot of Chana and the Jews in Egypt. Could Rachel and Esther have orchestrated similar desperate situations to evoke heartfelt prayer?Keywords:  Tefillah, Emunah, Bitachon, Personal Growth, Spirituality,www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 14.09,
    "spotify_web_url": "https://open.spotify.com/episode/7Cbn335EZGdhxi8yMWCz2z",
    "spotify_uri": "spotify:episode:7Cbn335EZGdhxi8yMWCz2z",
    "embed_url": "https://open.spotify.com/embed/episode/7Cbn335EZGdhxi8yMWCz2z"
  },
  {
    "episode_name": "Parshas Vayeitzei - When Silence Speaks Volumes",
    "episode_description": "What drove a simple cleaning lady to falsely accuse an innocent scholar? Why did the victim stay silent instead of clearing his name? This tale of intrigue and scandal in the halls of a prestigious yeshiva will leave you pondering profound questions. What is the true meaning of causing a desecration of God's name? How far would you go to protect your reputation? Let the twists and turns of this ethical dilemma about jealousy, repentance and honor guide you towards deeper wisdom. KeyWords:Yeshiva, scandal, false accusation, reputation, honor, repentance, jealousy, wisdomwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 7.16,
    "spotify_web_url": "https://open.spotify.com/episode/5d5T1KpCOP5sDvS2oCbCPE",
    "spotify_uri": "spotify:episode:5d5T1KpCOP5sDvS2oCbCPE",
    "embed_url": "https://open.spotify.com/embed/episode/5d5T1KpCOP5sDvS2oCbCPE"
  },
  {
    "episode_name": "Parshas Vayeitzei: Sacrifice and Reward",
    "episode_description": "Yaakov’s marriage starts off with trickery, embarrassment, and confusion. Why does Hashem allow such a holy union to begin this way? In this week’s parsha, Rachel makes the noble choice to prevent her sister's (Leah) shame by giving over the simanim—and sacrificing marrying Yaakov. Yet later, Leah lashes out at Rachel for stealing Yaakov and now wanting her son’s dudaim. What audacity! After all, it is only thanks to Rachel that she was able to marry Yaakov (As chazal tell us she was destined to marry Eisav and hence she was constantly crying)? What is behind Leah’s harsh words? How are we to understand Leah and Rochel’s complex relationship?  What crucial lesson about the right motivations for doing chesed can we learn from this family drama? And how did one sage make a courageous choice for kiddush Hashem rather than clearing his name? Tune in as we dive into the prism of Torah and discover answers to these questions and more. Always on www.prismoftorah.com",
    "release_date": "23-11-23",
    "duration_minutes": 17.65,
    "spotify_web_url": "https://open.spotify.com/episode/4NXfeMMnrmk20NMMNXta10",
    "spotify_uri": "spotify:episode:4NXfeMMnrmk20NMMNXta10",
    "embed_url": "https://open.spotify.com/embed/episode/4NXfeMMnrmk20NMMNXta10"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Vayishlach - Be aware your actions have an impact",
    "episode_description": "What lurks in the shadows when we take justified revenge? Do our actions plant seeds of cruelty even when serving justice? This week, dive deep into the Torah's eternal wisdom on the unseen impact of retaliation. Join Reb Asaf Aharon Prisman as he unpacks the subtle dangers of vengeance through the lens of Yaakov's fear before confronting Esav. Discover how one act of defense can unleash ripples of violence. And learn powerful lessons on chinuch, conscience and the true path to spiritual growth. Let this podcast open your eyes to the light - and darkness - that lives within us all.  Keywords: Yaakov, Esav, vengeance, retaliation, conscience, spiritual growth, violence, Parshat Vayishlachwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 14.77,
    "spotify_web_url": "https://open.spotify.com/episode/33P3y6imWaRDFyrdn9xVaS",
    "spotify_uri": "spotify:episode:33P3y6imWaRDFyrdn9xVaS",
    "embed_url": "https://open.spotify.com/embed/episode/33P3y6imWaRDFyrdn9xVaS"
  },
  {
    "episode_name": "Parshas Vayishlach - The Power of Prayer",
    "episode_description": "What is the true power of prayer? How can our prayers impact others and change their destiny? Journey with us as we explore the stirring story of Yaakov's fervent prayers before his fateful reunion with Esav. Discover how the Baal Shem Tov unlocks the secrets behind the Torah's emphasis on Yaakov's specificity in prayer. Learn simple but profoundly moving lessons that will transform the way you connect to Hashem through tefillah. Keywords:Tefillah, prayer, Yaakov, Esav, Baal Shem Tov  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 18.47,
    "spotify_web_url": "https://open.spotify.com/episode/0IefGfY2jlSxqy0j59dBWB",
    "spotify_uri": "spotify:episode:0IefGfY2jlSxqy0j59dBWB",
    "embed_url": "https://open.spotify.com/embed/episode/0IefGfY2jlSxqy0j59dBWB"
  },
  {
    "episode_name": "Parshas Vayishlach - Wrestling With Shadows",
    "episode_description": "Why did Yaakov demand to know the angel's name, and what deeper meaning lies in its refusal to answer? What lessons does the injury to the Gid Hanasheh teach us about our spiritual struggles? This week's parsha offers profound insights into identifying and confronting our true adversaries. Through examining Yaakov's nighttime battle, we uncover both the identity of our real enemy and the nature of our struggle. A powerful narrative illustrates how excessive strictness can sometimes work against us. Together, we'll explore practical approaches to identifying and overcoming genuine spiritual challenges.",
    "release_date": "12-12-24",
    "duration_minutes": 18.67,
    "spotify_web_url": "https://open.spotify.com/episode/6Pz3KScscvmArIcUEfhPR2",
    "spotify_uri": "spotify:episode:6Pz3KScscvmArIcUEfhPR2",
    "embed_url": "https://open.spotify.com/embed/episode/6Pz3KScscvmArIcUEfhPR2"
  },
  {
    "episode_name": "Parshas Vayishlach- Double Trouble from Esav",
    "episode_description": "What was behind Yaakov's prayer to be saved from \"the hand of my brother, the hand of Esav\"? Why the duplication? Was Yaakov more worried about physical or spiritual threats? How can one keep mitzvot yet still be negatively influenced? Join Reb Asaf Aharon as he analyzes Yaakov's encounter with Esav and uncovers two dangerous threats. Discover how the story connects to Chanukah and Purim. Thought-provoking perspectives that will leave you wanting more. Keywords: Yaakov, Esav, Vayishlach, Torah, parsha, analysis, threats, physical, spiritual, influence, mitzvot, connection, Chanukah, Purim Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 11.28,
    "spotify_web_url": "https://open.spotify.com/episode/6kw7jlj3ajNLIqFeorLidr",
    "spotify_uri": "spotify:episode:6kw7jlj3ajNLIqFeorLidr",
    "embed_url": "https://open.spotify.com/embed/episode/6kw7jlj3ajNLIqFeorLidr"
  },
  {
    "episode_name": "Parshas Vayishlach- Holy Help From Above",
    "episode_description": "What happens when we feel we've exhausted all options and prayer seems to be our last resort? Does God still want to hear our pleas even if we've distanced ourselves from faith? As Reb Asaf Aharon recounts a stirring narrative of crisis and redemption, fundamental questions arise that force us to reexamine our relationship with the Divine. By probing the simple yet unshakeable faith of one man crying out in his darkest hour, this episode explores the true power and purpose of heartfelt prayer. Join us as we reflect on how connecting to Hashem can be a lifeline even for those furthest away.  keywords: prayer, faith, crisis, redemption, relationship with Godwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 7.4,
    "spotify_web_url": "https://open.spotify.com/episode/32lXUe13bAJnSA6ClQxLPX",
    "spotify_uri": "spotify:episode:32lXUe13bAJnSA6ClQxLPX",
    "embed_url": "https://open.spotify.com/embed/episode/32lXUe13bAJnSA6ClQxLPX"
  },
  {
    "episode_name": "Parshas Vayishlach: The War from Two Fronts",
    "episode_description": "As Yaakov prepares to meet Esav, he sends messengers with a cryptic message: “I have lived with Lavan.” What does this mean? Why does Yaakov say he fears Esav will attack one camp but spare the other? And why does he tell Esav that despite living with Lavan, he kept all the Mitzvos - would Esav care? This week, we gain insight into the two-front battle we must continuously be ready to fight. How can we ensure we have the right intentions when performing Mitzvos? How did living in Lavan’s house strengthen Yaakov’s commitment to Hashem’s path? And what is the deeper message behind the seemingly redundant plea \"Save me from my brother, from Esav\"?   Join us on this episode of the Prism of Torah as we explore how Yaakov’s dramatic confrontation with Esav teaches an incredibly relevant message for our own battles in life. The story reveals the true battle we all face and will give us the Siyata Dishmaya to face our enemies, external and internal, as Yaakov Avinu did so long ago.",
    "release_date": "30-11-23",
    "duration_minutes": 13.31,
    "spotify_web_url": "https://open.spotify.com/episode/56I0a7CU5GxIyHHNVWxa0I",
    "spotify_uri": "spotify:episode:56I0a7CU5GxIyHHNVWxa0I",
    "embed_url": "https://open.spotify.com/embed/episode/56I0a7CU5GxIyHHNVWxa0I"
  },
  {
    "episode_name": "31: Parshas Vayishlach- The fight of life",
    "episode_description": "The Prism of Torah, with Reb Asaf Aharon Prisman The incredible fight between Yaacov and who? The angel of Esaau, the angel of death, the angel Michael? Who was he really? What was the point of this war? What does this have to do with a teenager who changed his life around after this incredible encounter… all here this week through the prism of Torah.  Our website is: www.prismoftorah.com. The podcast is available on spoitfy, apple podcast, Google podcast or wherever good podcasts are found.",
    "release_date": "08-12-22",
    "duration_minutes": 19.41,
    "spotify_web_url": "https://open.spotify.com/episode/52qr8LkLPHlFqWm7FA598Z",
    "spotify_uri": "spotify:episode:52qr8LkLPHlFqWm7FA598Z",
    "embed_url": "https://open.spotify.com/embed/episode/52qr8LkLPHlFqWm7FA598Z"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "32: Parshas Vayeishev- What are you jealous of?",
    "episode_description": "32: Parshas Vayeishev- What are you jealous of? The dreams of Yosef caused many hard feelings with his brothers, yet only by the second dream, they were jealous. What was the difference? Why jealous? What lesson can we take from here in order for us to grow and live the right way? What does this have to do with Chanukkah? All this & more.. Download: http://bit.ly/3BCHBC2 Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts.",
    "release_date": "15-12-22",
    "duration_minutes": 19.77,
    "spotify_web_url": "https://open.spotify.com/episode/0R2Tr46TnvRWPZPI6CQtXA",
    "spotify_uri": "spotify:episode:0R2Tr46TnvRWPZPI6CQtXA",
    "embed_url": "https://open.spotify.com/embed/episode/0R2Tr46TnvRWPZPI6CQtXA"
  },
  {
    "episode_name": "Parshas Vayshev - Yosef's Dreams & Effects",
    "episode_description": "What lurks in Yosef's prophetic dreams? This week's Parsha stirs age-old questions. How could vivid dreams predict one's future eminence? Why did the first dream evoke hatred while the next jealousy in his brothers? Join Reb Asaf this week as he unpacks the deeper meaning behind Yosef’s dreams and his brothers’ reactions. Discover how material wealth and spiritual growth shape relationships through the timeless lens of Torah truth.  Keywords:  Yosef, dreams, prophecy, Parshat Vayeshev, Torah portion, foresight, wealth, spirituality, jealousy, hatred, relationships  Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "11-02-24",
    "duration_minutes": 14.07,
    "spotify_web_url": "https://open.spotify.com/episode/7HLOG6jh7oRavpaaeP0MTD",
    "spotify_uri": "spotify:episode:7HLOG6jh7oRavpaaeP0MTD",
    "embed_url": "https://open.spotify.com/embed/episode/7HLOG6jh7oRavpaaeP0MTD"
  },
  {
    "episode_name": "Parshas Vayeishev - Recipe for Success",
    "episode_description": "This week's episode is sponsored by the Weitzner family in memory of Leah Yetta bas Shmuel Zanvel  Why does the Torah detail Yosef's seemingly mundane search for his brothers? And why specifically was it the angel Gavriel who found him wandering? This week's parsha reveals a profound insight about maintaining clarity in life's most challenging moments. Through the Kotzker Rebbe's unique analysis and a modern metaphor of laser beams, we discover how to stay focused despite life's turbulence. We'll explore this through the inspiring story of a man who found spiritual strength through near-total paralysis. Learn how to transform life's wandering moments into purposeful direction. Mazel Tov to Reb Asaf Aharon Prisman and his family on the engagement of his son Yishai!",
    "release_date": "19-12-24",
    "duration_minutes": 12.2,
    "spotify_web_url": "https://open.spotify.com/episode/0PtbXyhqpyED1OFshvjM4p",
    "spotify_uri": "spotify:episode:0PtbXyhqpyED1OFshvjM4p",
    "embed_url": "https://open.spotify.com/embed/episode/0PtbXyhqpyED1OFshvjM4p"
  },
  {
    "episode_name": "Parshas Vayeishev: Humble Pride",
    "episode_description": "Parshas Vayeishev: Humble Pride  Yosef's Temptation Scene The KEY To Thwarting Greeks' CUNNING Plot of Superficiality Over Spirituality What was Yosef hinting at when he refused the advances of Potiphar's wife, stating \"There is no one greater than me here\"? How did this relate to maintaining humility yet self-worth? We explore the balance between arrogance and humility, uncovering how even negative traits can serve a higher purpose. Is there such a thing as \"unhealthy humility\" or is that an oxymoron? Surprisingly, yes - misplaced humility can be spiritually dangerous. How did this reality save lives during an earthquake in Tzfat centuries ago? Via drush, we connect the above scene of Yosef to the famous scene of Moshe Rabbeinu and the Burning Bush. These passages contain more parallel messages than meet the eye - timely teachings for Chanukah on attaining clarity amidst chaos. As the war continues, what mindset should we nurture this Chanukah and beyond?",
    "release_date": "06-12-23",
    "duration_minutes": 14.13,
    "spotify_web_url": "https://open.spotify.com/episode/3f16MHkbLLlvr6tECgniyL",
    "spotify_uri": "spotify:episode:3f16MHkbLLlvr6tECgniyL",
    "embed_url": "https://open.spotify.com/embed/episode/3f16MHkbLLlvr6tECgniyL"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "023 Parshas Miketz & Chanukah - Uprooting the Greek in U",
    "episode_description": "This is part of the archive system, visit our website www.prismoftorah.com or listen to our current shows for more information.Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 8.79,
    "spotify_web_url": "https://open.spotify.com/episode/5kQH9KMrsGnyxvsZ61rOYj",
    "spotify_uri": "spotify:episode:5kQH9KMrsGnyxvsZ61rOYj",
    "embed_url": "https://open.spotify.com/embed/episode/5kQH9KMrsGnyxvsZ61rOYj"
  },
  {
    "episode_name": "33- Parshas Miketz- Dreams come true",
    "episode_description": "Parshas Miketz- Dreams come true The skinny cows eat the fat cows, Yosef, interprets the dreams and suggest a איש נבון וחכם minister to oversee the storage during the years of abundance. Why does this need to be a clever person? Would it not be better to find someone that is responsible and organized? Channukah, we also celebrate the war. What is it about the war that we are celebrating? What does this have to do with the dreams of פרעה? All this and much more www.prismoftorah.com As usual, please spread the word and the links- Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDc Or wherever you get your podcasts.",
    "release_date": "22-12-22",
    "duration_minutes": 14.43,
    "spotify_web_url": "https://open.spotify.com/episode/2hT71FEsjHcT0flX1BHy14",
    "spotify_uri": "spotify:episode:2hT71FEsjHcT0flX1BHy14",
    "embed_url": "https://open.spotify.com/embed/episode/2hT71FEsjHcT0flX1BHy14"
  },
  {
    "episode_name": "Parshas Miketz - Redundancy, never",
    "episode_description": "What secrets lie hidden in Pharaoh's dreams? This week on the Prism of Torah podcast, dive deep into the symbolism and redundancy - or lack thereof - in the mysterious dreams that perplex and propel the narrative in Parshat Miketz. Join Rabbi Asaf Aaron as he poses some probing questions about Yosef's uncanny ability to interpret these visions. How does he know the dreams signified imminent abundance and famine for Egypt? And how does he derive guidance from the dreams about who should oversee the storing of grain? By examining nuances between the two dreams, Rabbi Prisman unveils insights into divine messages and Yosef's wisdom. If you seek to understand how the intricacies of these dreams foretell the future, look no further. Keywords:  Parshat Miketz, Pharaoh's dreams, dream interpretation, Yosef in Egypt, symbolism in dreams, redundancies in Torahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 12.28,
    "spotify_web_url": "https://open.spotify.com/episode/6BM7aizbd8XvvBfgjZRIx7",
    "spotify_uri": "spotify:episode:6BM7aizbd8XvvBfgjZRIx7",
    "embed_url": "https://open.spotify.com/embed/episode/6BM7aizbd8XvvBfgjZRIx7"
  },
  {
    "episode_name": "Parshas Miketz -The Gift of Letting Go",
    "episode_description": "Why would Yosef thank Hashem for helping him forget his father's household? And why name his firstborn Menashe to commemorate forgetting, while his second son Ephraim celebrates success? In this week's Parshas Miketz, we uncover a revolutionary understanding from Rav Pinchas Shapiro of Koretz that transforms our perspective on forgiveness, memory, and spiritual growth. Discover how the ripple effects of our emotional struggles impact not just ourselves, but generations to come, and learn why true forgiveness might be more urgent than we realize. Through Yosef's powerful example, we'll explore how letting go of pain isn't just about personal peace – it's about creating vessels for Hashem's infinite bracha. Join us for an eye-opening journey that will change the way you think about forgiveness and its role in building genuine shalom.",
    "release_date": "26-12-24",
    "duration_minutes": 10.87,
    "spotify_web_url": "https://open.spotify.com/episode/5fufLAZLXK7NhqmEVHznmj",
    "spotify_uri": "spotify:episode:5fufLAZLXK7NhqmEVHznmj",
    "embed_url": "https://open.spotify.com/embed/episode/5fufLAZLXK7NhqmEVHznmj"
  },
  {
    "episode_name": "Parshas Miketz: Nightmare on Pharaoh Street",
    "episode_description": "In this week's parsha, secrets are revealed. Why was Pharaoh so distressed by his dreams of skinny cows devouring fat ones that he abruptly awakened and urgently called in experts to interpret them? What caused the collapse of his entire philosophy that morning? Do dreams reflect deeper truths? The flames of the Chanukkah candles seem to defy the laws of nature. Do they contain deeper lessons? Are there cracks in our perception of reality? But what do the perplexing patterns in this week's parsha hint at? How can the weak overcome the mighty? Did the few truly defeat the many? Join us as we explore intriguing ideas from our sages that are still relevant today. How do our choices shape outcomes? What brings about miracles? If you seek to understand how this world truly works, this podcast will enlighten and inspire you.",
    "release_date": "14-12-23",
    "duration_minutes": 12.75,
    "spotify_web_url": "https://open.spotify.com/episode/1ikXNuvL0cftZZQKbpi5Mz",
    "spotify_uri": "spotify:episode:1ikXNuvL0cftZZQKbpi5Mz",
    "embed_url": "https://open.spotify.com/embed/episode/1ikXNuvL0cftZZQKbpi5Mz"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Vayigash - Being in Control of Ourselves",
    "episode_description": "Why did Yosef restrain himself from revealing his identity to his brothers? What emotions raged within as he tested their character? Join Reb Asaf in unpacking the profound self-control and calculated wisdom behind Yosef's cryptic machinations. Delve into the symbolic meaning behind the brothers' tribulations in Egypt. Discover what we can learn from Yosef's restraint amidst intense longing. Let the intricacies of this Torah tale instill perspective on controlling our impulses during life's most heated moments.  Keywords:  Yosef, brothers, self-control, emotions, restraint, impulses, wisdom www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "12-02-24",
    "duration_minutes": 13.48,
    "spotify_web_url": "https://open.spotify.com/episode/7JTglicZGK8LTzDnJ98FOm",
    "spotify_uri": "spotify:episode:7JTglicZGK8LTzDnJ98FOm",
    "embed_url": "https://open.spotify.com/embed/episode/7JTglicZGK8LTzDnJ98FOm"
  },
  {
    "episode_name": "Parshas Vayigash - Breaking Free From External Chains",
    "episode_description": "What makes someone truly royal in Hashem's eyes? When Yehuda confronted the Egyptian viceroy, the other brothers stood back, saying \"Let them fight - they are both kings.\" But how could they view Yehuda as a king when he had fallen from his previous status? This fascinating episode uncovers a profound understanding of true leadership that transforms our view of self-mastery and spiritual nobility. Through powerful stories of recent Gedolim who demonstrated extraordinary control over physical and emotional challenges, we discover how each of us can access this inner sovereignty. Prepare to gain life-changing insights about achieving genuine greatness in Hashem's eyes.",
    "release_date": "02-01-25",
    "duration_minutes": 10.52,
    "spotify_web_url": "https://open.spotify.com/episode/5ZABM7uXl7PAwyfiibKZpa",
    "spotify_uri": "spotify:episode:5ZABM7uXl7PAwyfiibKZpa",
    "embed_url": "https://open.spotify.com/embed/episode/5ZABM7uXl7PAwyfiibKZpa"
  },
  {
    "episode_name": "Parshas Vayigash - Cognitive Dissonance",
    "episode_description": "Hashem’s grand design unfolds in mysterious ways. Why couldn’t Yosef’s own brothers recognize him as their long lost sibling? The glaring hints were there - the dreams, the seating order, the kosher food. Yet they remained oblivious, until Yosef revealed himself in an emotional climax. What was Yosef's motivation behind the cryptic clues? Did he secretly wish for them to uncover his identity? Journey into the mind of Yosef as we unpack the psychological blindspots that clouded the vision of Yaakov’s sons. Discover how seeking the truth requires seeing beyond our biased perspectives.Keywords: Yosef, brothers, recognize, identity, clues, motivation, psychological blindspots, biased perspectives, truth www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "12-02-24",
    "duration_minutes": 15.83,
    "spotify_web_url": "https://open.spotify.com/episode/6erg5NlrMr2U8bYs2F0pkG",
    "spotify_uri": "spotify:episode:6erg5NlrMr2U8bYs2F0pkG",
    "embed_url": "https://open.spotify.com/embed/episode/6erg5NlrMr2U8bYs2F0pkG"
  },
  {
    "episode_name": "Parshas Vayigash - Judgment Day and Rebuke",
    "episode_description": "What harsh truths lie beneath Yosef's poignant question to his brothers? Asaf digs deep in this week's Torah portion, surfacing profound insights on the art of rebuke. By analyzing a perplexing Midrash and biblical episodes, this podcast reveals timeless lessons in morality, self-awareness, and spiritual growth. Prepare to reconsider long-held assumptions as Asaf decodes enigmatic verses with sophistication and nuance befitting our greatest sages. Keywords:  Vayigash, Yosef, brothers, rebuke, tochacha, judgement day, growth, spirituality, morality Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "12-02-24",
    "duration_minutes": 18.84,
    "spotify_web_url": "https://open.spotify.com/episode/0P4oyR5PnnpkifLa0mjwfU",
    "spotify_uri": "spotify:episode:0P4oyR5PnnpkifLa0mjwfU",
    "embed_url": "https://open.spotify.com/embed/episode/0P4oyR5PnnpkifLa0mjwfU"
  },
  {
    "episode_name": "Parshas Vayigash - Yosef's plan",
    "episode_description": "What was the method behind Yosef's madness? Why torture his brothers so? At first glance, his actions seem perplexing. But was there an underlying strategy? A crafted sequence of events to achieve something greater? What was Yosef after? Revenge for his brothers selling him? Or something much more profound? In this episode, delve into the layers behind Yosef's decisions. Discover the true purpose fueling his every move.  keywords: Yosef, brothers, slavery, Benjamin, repentance, atonement  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 11.18,
    "spotify_web_url": "https://open.spotify.com/episode/7nsK2ujFPRMM0L0tB3ZW0v",
    "spotify_uri": "spotify:episode:7nsK2ujFPRMM0L0tB3ZW0v",
    "embed_url": "https://open.spotify.com/embed/episode/7nsK2ujFPRMM0L0tB3ZW0v"
  },
  {
    "episode_name": "Parshas Vayigash- having complete self control",
    "episode_description": "Why Did Yosef Wait So Long to Reveal Himself? Seemingly Obvious Questions Leave Us Baffled. Was It Simply a Test for His Brothers? Or Was There a Deeper Reason That Required Great Patience and Self-Control? Delve into the Thought-Provoking Mysteries Behind Yosef's Moment of Truth. Discover the Powerful Lessons on Impulse Control We Can Apply to Our Lives.  Keywords: Yosef, brothers, self-control, emotions, impulse, restraint, reveal, atonement, sin  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 15.6,
    "spotify_web_url": "https://open.spotify.com/episode/6qs6XGhQ5TX3v70RRZHUAY",
    "spotify_uri": "spotify:episode:6qs6XGhQ5TX3v70RRZHUAY",
    "embed_url": "https://open.spotify.com/embed/episode/6qs6XGhQ5TX3v70RRZHUAY"
  },
  {
    "episode_name": "Parshas Vayigash: Link To Life",
    "episode_description": "Why did Yosef refer to \"my father\" when asking his brothers if Yaakov was still alive? Shouldn't he have said \"our father\"? What was Yosef hinting at when reiterating that his brothers had sold him into slavery in Egypt? How could Yaakov not believe that Yosef was still alive and ruler of Egypt when told by his most trusted sons, the Shevti Kah?   In this week's parsha, as Yosef reveals himself to his brothers, we uncover the secret behind his perseverance in Egypt. Through coded language and symbolic gifts, discover how Yosef stayed righteous despite the turmoil. Learn the incredible power of remaining connected and walking others out with support.   Hear an unbelievable story of a mother's selfless act that unintentionally inspired her estranged son's return to Judaism years later.  Join us this week as we explore how true connection leads to spiritual fulfillment and success.",
    "release_date": "21-12-23",
    "duration_minutes": 16.76,
    "spotify_web_url": "https://open.spotify.com/episode/5swR6iax9tvYWQ0sYAXe8k",
    "spotify_uri": "spotify:episode:5swR6iax9tvYWQ0sYAXe8k",
    "embed_url": "https://open.spotify.com/embed/episode/5swR6iax9tvYWQ0sYAXe8k"
  },
  {
    "episode_name": "34 Parshas Vayigash: You can join the Royal family",
    "episode_description": "Parshas Vayigash: You can join the Royal family Yehuda squares up to Yosef. The brothers look on. “Let the kings fight it out,” they say. Why do they call Yosef and Yehuda kings? Explore how Yehuda’s and Yosef’s journey led them to be called kings. Why do some people avoid eating liver? What does ‘eating out your heart’ have any connection to this week's Parsha? Reb Asaf Aharon Prisman this week answers these questions with two powerful stories of how Gedolim reacted, when faced with… Download: https://bit.ly/3VvlNzr Listen: https://bit.ly/3I8SijL Netfree link: https://send.magicode.me/send-file/file/b7b84f7b11331e1eb1b805aaf4ed524466893609/view Let’s help spread Torah pass on the links to this podcast to you friends and family. Apple podcast: https://bit.ly/3RqLgIq Google Podcast: https://bit.ly/3AZuoTL Spotify: https://bit.ly/3CIMoDcand our own website www.prismoftorah.com",
    "release_date": "29-12-22",
    "duration_minutes": 16.57,
    "spotify_web_url": "https://open.spotify.com/episode/1fC7p7d6IrxcPuhesvggLZ",
    "spotify_uri": "spotify:episode:1fC7p7d6IrxcPuhesvggLZ",
    "embed_url": "https://open.spotify.com/embed/episode/1fC7p7d6IrxcPuhesvggLZ"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "35: Parshas Vayechi- Why do Chessed?",
    "episode_description": "Parshas Vayechi: Why do Chessed? Yosef is requested to do true chessed (חסד ואמת) for Yaakov and bury him with his forefathers and not in Egypt. What is the definition of true chessed? Is there a type of chessed that is not Emes? Is chessed and emes the same or opposites? What do we see as good? How do we view our acts of Chessed? … What this has to do with Adam and Chava and the Eitz Haddaas. Also, a story of Rav Shteinman who had to make this point very clear to a Shayla he was asked (this video can be watched here: http://bit.ly/3vGsvIu) If you press the download, it will just download the file of the Dvar Torah to your computer. Press play as usual. Download: https://bit.ly/3Z6eT6N Listen: https://bit.ly/3Zej9RK NetFree: https://send.magicode.me/send-file/file/cd2b4076e470cd22edc870468b2a27f1bc1f32a2/view Please pass on the link to your friends and family. The Dvar Torah is also live on www.prismoftorah.com.",
    "release_date": "05-01-23",
    "duration_minutes": 17.76,
    "spotify_web_url": "https://open.spotify.com/episode/02JmBO0f6Gy2hOJyoJ9M59",
    "spotify_uri": "spotify:episode:02JmBO0f6Gy2hOJyoJ9M59",
    "embed_url": "https://open.spotify.com/embed/episode/02JmBO0f6Gy2hOJyoJ9M59"
  },
  {
    "episode_name": "Parshas Vaychei - Efraim & Menashe",
    "episode_description": "What was so special about Ephraim and Menashe that we bestow the bracha upon our sons to emulate them? Why not bless them to be like the Avos instead? Delve into the intrigue as we explore the greatness these brothers achieved beyond their potential. Discover how their ability to transcend a spiritually bereft environment and maintain harmony sheds wisdom upon raising our own children. Keywords: Yaakov, Ephraim, Menashe, blessing, sons, potential, environment, harmonywww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 11.18,
    "spotify_web_url": "https://open.spotify.com/episode/7gWvfqzN3EoZbiA1ApzbYq",
    "spotify_uri": "spotify:episode:7gWvfqzN3EoZbiA1ApzbYq",
    "embed_url": "https://open.spotify.com/embed/episode/7gWvfqzN3EoZbiA1ApzbYq"
  },
  {
    "episode_name": "Parshas Vaychei - working on the negative",
    "episode_description": "Why was Reuven's punishment so severe? What inner trait led to his downfall? Join Reb Asaf Aharon Prisman as he analyzes Yaakov's final blessings and highlights the Torah's emphasis on correcting negative character traits. Delve into the mystery behind Reuven and Shimon/Levi's harsh consequences. Discover how teshuva alone cannot undo the damage of unchecked impulses and rage. Hashem wants our hearts - let's give Him our best in this week's fascinating episode.  Keywords: Reuven, punishment, blessings, Yaakov, teshuva, negative traits, character development, spiritual growthwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 18.04,
    "spotify_web_url": "https://open.spotify.com/episode/5isSyuVJHpC0J6XEOcJqqG",
    "spotify_uri": "spotify:episode:5isSyuVJHpC0J6XEOcJqqG",
    "embed_url": "https://open.spotify.com/embed/episode/5isSyuVJHpC0J6XEOcJqqG"
  },
  {
    "episode_name": "Parshas Vayechi -  Beating the enemy",
    "episode_description": "What does it mean to keep one's word? In this week's Torah portion, Yaakov makes Yosef swear to fulfill his last wish. Yet Paro implies one can easily violate an oath. How did Yosef respond? Discover the ripple effects of truth and lies.  Join Reb Asaf as he analyzes a stirring dialogue between Yosef and Paro. Learn how keeping commitments shapes our inner world. Why does the Torah say to distance ourselves from falsehood? Uncover how a shoelace saved a life and paved the path back to Hashem. keywords: oath, truth, lie, Paro, Yosef, Yaakov, Vayechi, Torahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-11-22",
    "duration_minutes": 10.61,
    "spotify_web_url": "https://open.spotify.com/episode/5weZATCwzh0U7PQDpPa2EO",
    "spotify_uri": "spotify:episode:5weZATCwzh0U7PQDpPa2EO",
    "embed_url": "https://open.spotify.com/embed/episode/5weZATCwzh0U7PQDpPa2EO"
  },
  {
    "episode_name": "Parshas Vayechi - The Sword That Cuts, The Bow That Binds",
    "episode_description": "When Yaakov mentions his sword and bow, what deeper message lies beneath these ancient weapons of war? In this week's Parshas Vayechi, we uncover a fascinating perspective on spiritual combat that turns conventional battlefield wisdom upside down. Through a remarkable insight from the Gemara, we'll discover why the sequence of these weapons holds the key to understanding our daily spiritual battles. Whether confronting personal challenges or seeking growth in avodas Hashem, this episode reveals timeless strategies for spiritual victory. Join us as we explore how Yaakov's final words to Yosef illuminate the true nature of our inner struggles.",
    "release_date": "09-01-25",
    "duration_minutes": 10.84,
    "spotify_web_url": "https://open.spotify.com/episode/2AsG8e3hceMLGYBq5SRf4Y",
    "spotify_uri": "spotify:episode:2AsG8e3hceMLGYBq5SRf4Y",
    "embed_url": "https://open.spotify.com/embed/episode/2AsG8e3hceMLGYBq5SRf4Y"
  },
  {
    "episode_name": "Parshas Vayechi - Uprooting Negative Middos",
    "episode_description": "Why did Reuven lose the privileges of priesthood and kingship for a seemingly small sin? What inner traits led Shimon and Levi to massacre an entire city? Delve into the Torah's hidden lessons on uprooting negative character traits in this week's episode. As Reb Asaf probes Yaakov's final blessings and rebukes to his sons, fundamental concepts emerge about the true severity of sin and the power of repentance. By analyzing the subtle causality within Yaakov's words, we uncover how destructive middot remains an inner \"loaded gun\" even after outward teshuvah. Let this philosophical episode inspire self-reflection and plant seeds for lifelong growth beyond just actions. Keywords: Character traits, Personal growth, Teshuvah, Torah analysis  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "12-02-24",
    "duration_minutes": 11.31,
    "spotify_web_url": "https://open.spotify.com/episode/13pGYilqVuS9n3ahfeOKpc",
    "spotify_uri": "spotify:episode:13pGYilqVuS9n3ahfeOKpc",
    "embed_url": "https://open.spotify.com/embed/episode/13pGYilqVuS9n3ahfeOKpc"
  },
  {
    "episode_name": "Parshas Vayechi - Working on One's Middos",
    "episode_description": "A true story of shock that led to song. When a sponsorship check disappeared, was it gone for good? What prompted singing in a time of loss? Find out how one family responded to an unthinkable situation. Their choice brought inspiration. But was that the end? A mysterious twist revealed more than expected. What did their neighbor discover that changed everything? Let this tale of tribulation and trust speak to your soul.  keywords:- Faith, Adversity, Reactions, Choices, Outcomeswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "12-02-24",
    "duration_minutes": 5.82,
    "spotify_web_url": "https://open.spotify.com/episode/0ROoGaBB8InsEmrVWYlqXh",
    "spotify_uri": "spotify:episode:0ROoGaBB8InsEmrVWYlqXh",
    "embed_url": "https://open.spotify.com/embed/episode/0ROoGaBB8InsEmrVWYlqXh"
  },
  {
    "episode_name": "Parshas Vayechi: Ordinary Moments, Extraordinary Purpose",
    "episode_description": "Have you ever considered the deeper significance behind the Torah’s unusual formatting in this week’s parsha? The 'closed' parsha? What revealing connection exists between the closure of the Parshas upon Yaakov’s death and the subsequent hardship for the Jewish people? Delving into Rashi’s Pshat unearths a striking insight into Yaakov Avinu’s exceptional influence in uplifting mundane existence into holiness during his lifetime, which is a 'game-changer' for how we conduct our lives. Don't miss this vital concept as we learn how it can result in boundless Bracha—for you and your family. Why couldn’t these protective Brachos withstand his passing? How can we tap into the power of injecting Kedusha in these days? By revealing this spiritual concept, which yields protection and abundance throughout generations, we uncover the key to connecting more profoundly, fortifying ourselves to thrive through every difficulty. Join us as we transform the ordinary moments of life into extraordinary nourishment for the neshoma.",
    "release_date": "28-12-23",
    "duration_minutes": 16.29,
    "spotify_web_url": "https://open.spotify.com/episode/1RialsTjtMr1MyxW6EXQEf",
    "spotify_uri": "spotify:episode:1RialsTjtMr1MyxW6EXQEf",
    "embed_url": "https://open.spotify.com/embed/episode/1RialsTjtMr1MyxW6EXQEf"
  }
]