[
  {
    "episode_name": "36 Parshas Shemos: No brain no gain",
    "episode_description": "Parshas Shemos: No brain no gain Hashem rewards the midwives with ‘houses’, yet not a house of Torah, why not? Is Torah not the most important thing in the world? Would that not have been a perfect reward for the self-sacrifice? How much are we focused on Torah & Yiras Shamayim as opposed to our own pleasures of this world? Is there something wrong with learning Gemora on the beach with a Piña colada? What is the fifth Chelek of the Shulchan Aruch? All this and more, be sure to subscribe to the podcast and send the links to your friends and family. www.prismoftorah.com",
    "release_date": "12-01-23",
    "duration_minutes": 16.8,
    "spotify_web_url": "https://open.spotify.com/episode/68sJQEDl8XjZvuwd0IfOs3",
    "spotify_uri": "spotify:episode:68sJQEDl8XjZvuwd0IfOs3",
    "embed_url": "https://open.spotify.com/embed/episode/68sJQEDl8XjZvuwd0IfOs3"
  },
  {
    "episode_name": "Parshas Shemos -  Little Things Count",
    "episode_description": "Why does the Torah refer to Yocheved and Miriam by the nicknames \"Shifra\" and \"Puah\"? What deeper meaning lies behind these Names chosen to immortalize the righteous midwives? Listen in as we probe the mystery behind Hashem rewarding these selfless women with \"houses\" of Kehuna, Leviya, and Malchus. Join us on this week's journey through Parshat Shemot to discover how even the smallest acts of kindness - going beyond the call of duty to care for and beautify each Jewish newborn - reflect one's true spiritual greatness. What powerful lessons can we learn from Yocheved and Miriam's sensitivity to not just save Jewish babies, but lovingly tend to each one's needs?Tune into this soul-stirring episode now to unpack timeless messages on the profound impact even little things make when done with care, compassion and fear of Hashem.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 9.15,
    "spotify_web_url": "https://open.spotify.com/episode/3lz1fKgpdmJiSei7RdMB3o",
    "spotify_uri": "spotify:episode:3lz1fKgpdmJiSei7RdMB3o",
    "embed_url": "https://open.spotify.com/embed/episode/3lz1fKgpdmJiSei7RdMB3o"
  },
  {
    "episode_name": "Parshas Shemos - Emunah & Bitachon",
    "episode_description": "We put our trust in leaders, plans, and strategies, expecting our relief lies therein. Yet when new tyrants arise and old plans fail, where do we place our hopes? What is the impetus to finally cry out in earnest prayer? As Bnei Yisrael discovers in this episode, it is only when all else fails that we truly turn to Hashem. But what does this teach us about emunah and bitachon? Keywords: emunah, bitachon, prayer, leaders, plans, strategies, hopes, trust www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "20-02-24",
    "duration_minutes": 11.89,
    "spotify_web_url": "https://open.spotify.com/episode/4koWgLeubjwe6OIWyhKASg",
    "spotify_uri": "spotify:episode:4koWgLeubjwe6OIWyhKASg",
    "embed_url": "https://open.spotify.com/embed/episode/4koWgLeubjwe6OIWyhKASg"
  },
  {
    "episode_name": "Parshas Shemos - Living Up Life",
    "episode_description": "Why did Pharoah decree such cruel labor for the Jewish slaves? What deeper understanding of \"work\" emerges from this episode? How can we infuse greater meaning and purpose into our own lives and actions? Tune into this fascinating discussion exploring profound lessons from the Jewish exodus story.Keywords: Pharoah, Jewish slaves, work, purpose, meaningwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "24-02-24",
    "duration_minutes": 14.44,
    "spotify_web_url": "https://open.spotify.com/episode/46HdTR2CUQpZuSmVO7i8ih",
    "spotify_uri": "spotify:episode:46HdTR2CUQpZuSmVO7i8ih",
    "embed_url": "https://open.spotify.com/embed/episode/46HdTR2CUQpZuSmVO7i8ih"
  },
  {
    "episode_name": "Parshas Shemos - Living With Meaning",
    "episode_description": "Why didn’t Pharaoh simply double the Jewish people’s workload when Moshe first approached him, instead of making them waste time gathering straw? What deeper strategy was behind Pharaoh’s cruel “avodat perach” designed to break Israel’s spirits? How are the 39 forbidden Shabbat labors connected to purposeless work? What DOES give everyday mundane activities higher meaning and purpose according to the Torah? How did Moshe Rabbeinu ultimately rectify his complaint that “ever since I approached Pharaoh, things have gotten worse”? Tune into this week’s parsha podcast to discover the answers and gain an enlightening perspective on living YOUR life with greater meaning.Keywords: Parshat Shemot, avodat Perach, purpose, meaning, shabbat  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 14.75,
    "spotify_web_url": "https://open.spotify.com/episode/2QCv5tUTQMxaYX1K6m4g1C",
    "spotify_uri": "spotify:episode:2QCv5tUTQMxaYX1K6m4g1C",
    "embed_url": "https://open.spotify.com/embed/episode/2QCv5tUTQMxaYX1K6m4g1C"
  },
  {
    "episode_name": "Parshas Shemos - When Did You Last Check Your Breaks",
    "episode_description": "What surprising merit enabled the Jewish people's exodus from Egypt? How did two perilous mitzvot demonstrate our readiness for redemption? What everyday ritual embodies maintaining self-control amidst life's journey? Discover Rav Galinsky’s eye-opening explanation tying together the Exodus, brit milah, korban Pesach, tefillin and more. Discerning Torah insights for fortifying mind, heart and soul against external pulls. Tune in to access eternal wisdom on aligning oneself fully with Hashem’s path. Keywords: Torah, parshat shemot, exodus from Egypt, redemptionwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 13.35,
    "spotify_web_url": "https://open.spotify.com/episode/2QxpvMgwJM1Vl9QTbLXw5X",
    "spotify_uri": "spotify:episode:2QxpvMgwJM1Vl9QTbLXw5X",
    "embed_url": "https://open.spotify.com/embed/episode/2QxpvMgwJM1Vl9QTbLXw5X"
  },
  {
    "episode_name": "Parshas Shemos - When Small Acts Speak Volumes",
    "episode_description": "Discover how the Torah reveals a profound insight through the seemingly simple names of the midwives, Shifra and Puah. What can these names teach us about true greatness? Through the lens of Rav Shimshon Pincus's powerful teaching, we explore how our smallest actions in times of crisis reveal our deepest character. From emergency rooms to wedding halls, learn how conscious attention to life's smallest details shapes our greatest moments. Join Reb Asaf Aharon Prisman for an eye-opening journey into what makes an act of kindness complete, and how we can elevate our daily interactions from ordinary to extraordinary.  Always on www.prismoftorah.org",
    "release_date": "16-01-25",
    "duration_minutes": 8.5,
    "spotify_web_url": "https://open.spotify.com/episode/1hjRUTah20SL1c7BCxvdtP",
    "spotify_uri": "spotify:episode:1hjRUTah20SL1c7BCxvdtP",
    "embed_url": "https://open.spotify.com/embed/episode/1hjRUTah20SL1c7BCxvdtP"
  },
  {
    "episode_name": "Parshas Shemos -The Secret to Success",
    "episode_description": "What drove Miriam’s unwavering hope during our darkest hour? How did her steadfast optimism impact the destiny of our people? Why does retaining faith amidst suffering unlock Divine salvation? Journey alongside Miriam as her conviction reshapes the trajectory of the Jewish future. Discover how visionary women chart the course of our intergenerational story. Explore the mystery of how profoundly our mindset influences heavenly outcomes.  Tune into this soul-stirring discussion to uncover how embracing the mindset of hope empowers our people to transcend even the most daunting challenges.Keywords: Miriam, hope, redemption, Jewish history, destinywww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 15.43,
    "spotify_web_url": "https://open.spotify.com/episode/5wuWtPIqpAdiJWCUQh5lyR",
    "spotify_uri": "spotify:episode:5wuWtPIqpAdiJWCUQh5lyR",
    "embed_url": "https://open.spotify.com/embed/episode/5wuWtPIqpAdiJWCUQh5lyR"
  },
  {
    "episode_name": "Parshas Shemos: The True Secret Weapon",
    "episode_description": "What prompted Hashem to respond to Am Yisrael's plea and expedite the Redemption after prolonged suffering in Egypt? This week, we delve into the link between Egypt's leadership change and redemption. What sparked this transformation? Why is this pertinent today? Chazal enlighten us that the future redemption will resemble the redemption from Mitzrayim, happening swiftly too.   These insights hold relevance during these times. What is key to ensuring our prayers are heard by Hashem? What is the significance of \"The gates of tears have not been locked\"? Have you experienced ineffective prayers? Discover answers to pressing queries and more. Let us uncover the secrets of heartfelt prayer. We conclude with an account demonstrating the potency of this hidden formula! Always on www.prismoftorah.org",
    "release_date": "04-01-24",
    "duration_minutes": 15.64,
    "spotify_web_url": "https://open.spotify.com/episode/2Vzj0XeGNik3tSMkjh2zKF",
    "spotify_uri": "spotify:episode:2Vzj0XeGNik3tSMkjh2zKF",
    "embed_url": "https://open.spotify.com/embed/episode/2Vzj0XeGNik3tSMkjh2zKF"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "37: Parshas Vaera: Don't Just Think Emuna, Live Bitachon",
    "episode_description": "Parshas Vaera: Don't Just Think Emuna, Live Bitachon www.prismoftorah.com This week, Moshe does not think the Jews will believe that Hashem is going to redeem them, but they do, the lions in the pharaoh’s palace against all odds accompany Moshe and Aaron, what can we learn from this? Why did the Jews suddenly have a \"change of heart\" and stop believing Moshe will save them? What is the difference between Emuna and Bitachon? When someone falls into Niagara Falls what is the first thing they think of (Assuming they make it alive) All this and more..., be sure to subscribe to the podcast and to send the links to your friends and family. All this and more, be sure to subscribe to the podcast and to send the links to your friends and family. Listen: https://bit.ly/POT_vaera Download: https://bit.ly/vaera_Prism_",
    "release_date": "19-01-23",
    "duration_minutes": 16.51,
    "spotify_web_url": "https://open.spotify.com/episode/3XXJr7wjyisQoLcTEib7ay",
    "spotify_uri": "spotify:episode:3XXJr7wjyisQoLcTEib7ay",
    "embed_url": "https://open.spotify.com/embed/episode/3XXJr7wjyisQoLcTEib7ay"
  },
  {
    "episode_name": "Parshas Vaera - Gaining by Giving",
    "episode_description": "What defines true greatness in Jewish leadership? When Moshe Rabbeinu was chosen to lead Klal Yisroel out of Mitzrayim, he possessed a unique quality that set him apart - but it wasn't his wisdom, his lineage, or even his humility. Through a fascinating analysis of why the Torah tells us twice that \"Moshe grew up,\" we uncover a profound insight about the real meaning of being a gadol. From the shepherding of our greatest leaders to the open hands of those we lay to rest, this episode reveals an extraordinary perspective on what it truly means to be a big person. Discover how the seeming paradox of self-preservation and loving others as yourself contains the key to unlocking your highest potential. Join us as we explore how the path to genuine spiritual wealth might be hidden in the very act of giving itself.",
    "release_date": "23-01-25",
    "duration_minutes": 13.07,
    "spotify_web_url": "https://open.spotify.com/episode/12k35WcpUxcO87EeG8LPSV",
    "spotify_uri": "spotify:episode:12k35WcpUxcO87EeG8LPSV",
    "embed_url": "https://open.spotify.com/embed/episode/12k35WcpUxcO87EeG8LPSV"
  },
  {
    "episode_name": "Parshas Vaera - Having The Right Perspective",
    "episode_description": "When is “bad” actually good? Why was Moshe criticized for defending Bnei Yisrael? What did the Avos endure without complaint? What key insight reshapes it all? Find out as we explore unseen angles on age-old quandaries around suffering and our relationship with Hashem. Tune in as we journey beyond surface interpretations to discover uplifting depths yielding renewed faith, acceptance, and purpose.Keywords: Suffering, Faith, Perspective, Growth, Redefining Goodwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "27-02-24",
    "duration_minutes": 9.55,
    "spotify_web_url": "https://open.spotify.com/episode/6dNwrWM5aQIA1vHv575zkp",
    "spotify_uri": "spotify:episode:6dNwrWM5aQIA1vHv575zkp",
    "embed_url": "https://open.spotify.com/embed/episode/6dNwrWM5aQIA1vHv575zkp"
  },
  {
    "episode_name": "Parshas Vaera - How Big of a Person R U",
    "episode_description": "What was it about Moshe Rabbeinu that made him worthy of leading the Jewish people out of Egypt? Why does the Torah say \"and Moshe grew up\" twice? How did the great sages of previous generations demonstrate an incredible sensitivity toward all people? What does it truly mean to \"love your fellow as yourself\"? In this week's parsha podcast, dive deep into the qualities that define true spiritual greatness. Explore how the highest Jewish leaders achieved complete empathy with every human being, feeling their pain as their own. Discover a radical redefinition of \"self\" that eliminates barriers between you and others. Tune in to unlock the secrets of boundless compassion, and learn how attaching yourself to the Torah is the path to get there. Keywords: parsha, leadership, empathy, compassion, spiritual growth Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 14.48,
    "spotify_web_url": "https://open.spotify.com/episode/4r3aMVZlRXlSU4PV9rCxfv",
    "spotify_uri": "spotify:episode:4r3aMVZlRXlSU4PV9rCxfv",
    "embed_url": "https://open.spotify.com/embed/episode/4r3aMVZlRXlSU4PV9rCxfv"
  },
  {
    "episode_name": "Parshas Vaera - The Essence of a Yid",
    "episode_description": "How could Hashem harden Paro's heart yet still hold him accountable? Why does suffering sometimes bring us closer to Hashem? What essential truth about the Jewish soul is revealed? Delving into the righteousness within, this episode explores monumental questions on free will, personal growth, and the eternal bond between Hashem and His people. Through penetrating Torah analysis, discover profound insights that illuminate our inner light while urging thoughtful self-reflection.Will you cling to bitterness or draw out sweetness from within? Listen now to transform understanding of our essence as creation's pinnacle.Keywords: Parshat Vaera, personal growth, free will, Jewish soulwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 13.04,
    "spotify_web_url": "https://open.spotify.com/episode/3raGupNiD6MCP8jj6OwZd4",
    "spotify_uri": "spotify:episode:3raGupNiD6MCP8jj6OwZd4",
    "embed_url": "https://open.spotify.com/embed/episode/3raGupNiD6MCP8jj6OwZd4"
  },
  {
    "episode_name": "Parshas Vaera - Your Will of Protection",
    "episode_description": "What is our innermost drive? How can understanding \"will number 10\" shield us? How did one man find happiness amidst unimaginable suffering? Reb Asaf delves into a mystical concept from Rav Boyer about the power of will and its surprising effects when aligned properly. Journey along as he seamlessly weaves connections to the parsha and leaves us with an incredible story of emunah from the Holocaust. DISCOVER the keys to protection through cultivating the right Ratzon. Keywords: Parsha, mystical concepts, emunah, Holocaust stories  www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "26-07-23",
    "duration_minutes": 12.82,
    "spotify_web_url": "https://open.spotify.com/episode/2Xls2sLCTkT8jtEBdczrPB",
    "spotify_uri": "spotify:episode:2Xls2sLCTkT8jtEBdczrPB",
    "embed_url": "https://open.spotify.com/embed/episode/2Xls2sLCTkT8jtEBdczrPB"
  },
  {
    "episode_name": "Parshas Vaera: Decoding the 10 Plagues",
    "episode_description": "Why did Hashem need 10 plagues—wouldn’t one catastrophic plague have sufficed? What is the deeper meaning behind the 3 distinct sets of plagues we see in the Hagadah? And why does the Torah spend so much time on the details of each plague?  This week's parsha raises profound questions about the nature of emunah, the path to personal growth, and Hashem’s relationship with humanity. By exploring insights on the makkos, this podcast reveals timeless lessons about strengthening your emunah amidst life's plagues and passions. You'll discover how the structure of the 10 plagues contains eternal truths about the journey from impurity to purity, mind to heart to action. A great Mashal & Story is given as well to emphasize the concept.",
    "release_date": "11-01-24",
    "duration_minutes": 20.62,
    "spotify_web_url": "https://open.spotify.com/episode/5d8mcniGJAvA5z9DCWzvhf",
    "spotify_uri": "spotify:episode:5d8mcniGJAvA5z9DCWzvhf",
    "embed_url": "https://open.spotify.com/embed/episode/5d8mcniGJAvA5z9DCWzvhf"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "38: Parshas Bo - Proud to be a Jew",
    "episode_description": "Parshas Bo: Proud To Be A Jew The common denominator between korban Pesach and bris Milah, why did they need to do both before leaving Egypt? What does being a Jew mean? Hashem created us different then he created non-Jews. What lesson can we learn from this? Plus: Story–Does Reb Shteinman like Pizza or burgers? Why did this 19-year-old storm in asking? What was the response? All this and more!",
    "release_date": "26-01-23",
    "duration_minutes": 20.58,
    "spotify_web_url": "https://open.spotify.com/episode/7jic8lBBWtCW2bUA9ak9zz",
    "spotify_uri": "spotify:episode:7jic8lBBWtCW2bUA9ak9zz",
    "embed_url": "https://open.spotify.com/embed/episode/7jic8lBBWtCW2bUA9ak9zz"
  },
  {
    "episode_name": "Parshas Bo - Our Responsibility as Hashem's Ambassadors",
    "episode_description": "What is the meaning behind saying \"approximately midnight\"? Why should we care what Egyptians think? How sensitive must we be to Chillul Hashem? Discover thought-provoking perspectives on representing Hashem, avoiding misperceptions, and living purely as His ambassadors. Explore timeless lessons from Parshat Bo for sanctifying Hashem's name in modern times. Keywords: Parshat Bo, Chillul Hashem, Kiddush Hashem, Egyptians, midnightwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 7.97,
    "spotify_web_url": "https://open.spotify.com/episode/2ePOFF0jNJ3RuKQH1v4iXs",
    "spotify_uri": "spotify:episode:2ePOFF0jNJ3RuKQH1v4iXs",
    "embed_url": "https://open.spotify.com/embed/episode/2ePOFF0jNJ3RuKQH1v4iXs"
  },
  {
    "episode_name": "Parshas Bo-  Respect and Being Respected",
    "episode_description": "Why did Hashem make B'nai Yisrael find favor in the eyes of the Egyptians before the exodus? What is the true purpose of the nations' respect for us? How can we become \"a light unto the nations\" in golus? In this week's parsha, key insights emerge on the vital role of Kiddush Hashem among gentiles and our mission as Goy Kadosh. Through a fascinating modern-day story, discover how acting loyally to Hashem can ripple outward to impact those around us. Tune into the full discussion as Rabbi Prisman unpacks secrets from Chazal and the Netziv on fulfilling our purpose in exile. Let an eternal Torah outlook revolutionize our relationship with the world.Keywords: Kiddush Hashem, Goy Kadosh, Goyim, Exile, Egyptianswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 13.7,
    "spotify_web_url": "https://open.spotify.com/episode/4UguAOBstFffSis8tzj6tM",
    "spotify_uri": "spotify:episode:4UguAOBstFffSis8tzj6tM",
    "embed_url": "https://open.spotify.com/embed/episode/4UguAOBstFffSis8tzj6tM"
  },
  {
    "episode_name": "Parshas Bo - The Exact Orchestra",
    "episode_description": "Why did Hashem orchestrate the exodus during the height of the astrological power of Egypt's mazal? What deeper meaning lies in the perplexing mix of fire and ice within the plague of hailstones? Why name the animal plague for its strange mixture rather than the animals themselves? This episode tackles the hidden reasons behind Hashem's precisely timed miracles in Egypt, unraveling secrets within the final three plagues. Discover how all these perplexities actually intertwine to dramatically manifest Hashem's oneness against the sorcery-steeped backdrop of ancient Egypt. What stunning story involving Pharaoh's own daughter concealed cosmic messages about Hashem's sole direction of every event? How did the Passover offering and Exodus further shatter the veneer of opposing forces in a true tour de force? The unfolding discussion fascinatingly weaves together all these mysteries to reveal a master framework centered on Hashem's concealed oneness operating behind even our greatest trials. Tune in now to have your entire perspective shifted regarding the Exodus story and its intricate hidden messages tailored for our times.Keywords: Passover, plagues, Egypt, miracles, onenesswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 11.05,
    "spotify_web_url": "https://open.spotify.com/episode/55HvHsCQOE9U79TA0ysOEV",
    "spotify_uri": "spotify:episode:55HvHsCQOE9U79TA0ysOEV",
    "embed_url": "https://open.spotify.com/embed/episode/55HvHsCQOE9U79TA0ysOEV"
  },
  {
    "episode_name": "Parshas Bo - To Do What is Really Right",
    "episode_description": "Intriguing questions arise as we prepare for the Exodus from Egypt. Why does Hashem command Bnei Yisrael to take the clothing of Mitzrayim when retaining our distinct dress was a key merit for redemption? Is there truly an issue with wearing their garb or only with the motivation behind doing so? Could acts be permissible by law yet still miss the spirit? As we strive to follow Halacha, must we also ensure meeting its ethos? Discover penetrating insights on this and more in our latest episode - delving into a fascinating kasha from Rav Zev on the perplexing directive to extract the raiment of our oppressors. Join us on this journey of discovery paralleling our ancestors’ own passage leaving Mitzrayim behind while retaining integrity. Keywords:Parshat Bo, Exodus, Egypt, clothing, halacha, spirit of the lawwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "02-03-24",
    "duration_minutes": 13.34,
    "spotify_web_url": "https://open.spotify.com/episode/4CUDrAmgC3nsiAQoK0FEyy",
    "spotify_uri": "spotify:episode:4CUDrAmgC3nsiAQoK0FEyy",
    "embed_url": "https://open.spotify.com/embed/episode/4CUDrAmgC3nsiAQoK0FEyy"
  },
  {
    "episode_name": "Parshas Bo - When Actions Speak Louder than Rules",
    "episode_description": "Parshas Bo When Actions Speak Louder than Rules How could Hashem ask the Jews to take Egyptian clothing when maintaining distinct Jewish dress was one of the key merits for redemption? What does this fascinating paradox teach us about the true meaning of Jewish identity? In this week's Parshas Bo, we uncover a profound insight that challenges our understanding of what it means to live an authentic Jewish life.  Join us for an eye-opening exploration of how the clothes we wear, the music we listen to, and the choices we make shape not just our external appearance, but the very essence of our connection to Hashem. This episode reveals concepts that will transform how you view the subtle interplay between halacha and the spirit of Yiddishkeit.",
    "release_date": "30-01-25",
    "duration_minutes": 7.09,
    "spotify_web_url": "https://open.spotify.com/episode/3oRV5HiUDst7h7QWbMRqwE",
    "spotify_uri": "spotify:episode:3oRV5HiUDst7h7QWbMRqwE",
    "embed_url": "https://open.spotify.com/embed/episode/3oRV5HiUDst7h7QWbMRqwE"
  },
  {
    "episode_name": "Parshas Bo: Be All That You Can Be",
    "episode_description": "What did Moshe and Aaron represent that made them true equals, despite Aaron being Moshe's student? Why place Aaron's name before Moshe's? This episode explores their deeper bond that unified opposites into a greater whole - like two legs enabling one to walk. We’ll unpack three compelling resolutions for Rashi's perplexing statement that they shared the same exalted rank, each teaching a pivotal lens for viewing Judaism. Discover anew how to appraise greatness, find meaning in supporting roles, and build bridges between contrasting paths that ultimately unite. Packed with metaphors and the Netziv’s mashul, let this podcast lead you to look beyond surface comparisons, embrace your distinctive purpose, and sanctify this world as one.",
    "release_date": "18-01-24",
    "duration_minutes": 18.47,
    "spotify_web_url": "https://open.spotify.com/episode/5ds4WVaJ4fQ5x4fMzv9Ykx",
    "spotify_uri": "spotify:episode:5ds4WVaJ4fQ5x4fMzv9Ykx",
    "embed_url": "https://open.spotify.com/embed/episode/5ds4WVaJ4fQ5x4fMzv9Ykx"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Beshalach - Faith Can Move Mountains",
    "episode_description": "Why did Hashem tell Moshe it was not the time to pray, when prayer is our greatest weapon, especially during a time of crisis? How could Bnei Yisrael reach spiritual heights so quickly after the extreme impurity they endured in Egypt? What secret causes prophecy to dwell upon us? This week we will explore the story of how the splitting of the sea occurred and how it led Bnei Yisrael to reach great heights of prophecy through their unwavering faith. We will learn about the incredible power of elevating physicality through action and the vital practical lesson we can all learn from this Parsha. A story reveals how bitachon can change one's fate.",
    "release_date": "25-01-24",
    "duration_minutes": 19.76,
    "spotify_web_url": "https://open.spotify.com/episode/2FFmnKY3BOVeSxStYrkx2g",
    "spotify_uri": "spotify:episode:2FFmnKY3BOVeSxStYrkx2g",
    "embed_url": "https://open.spotify.com/embed/episode/2FFmnKY3BOVeSxStYrkx2g"
  },
  {
    "episode_name": "Parshas Beshalach - Hakaras Hatov",
    "episode_description": "Why did the sea split for Bnei Yisrael? What vital lesson did Yisro derive from Kriyas Yam Suf and the war with Amalek that led him to convert? How did Rav Shteyman astound even the expert doctor that helped cure his pneumonia? Delve into the stirring insights on hakaras hatov revealed in Parshas Beshalach. Discover how expressing gratitude connects to fulfilling the mitzvah of kibud av v’eim. Tune into this soul-stirring discussion of seeing behind the natural to appreciate the constant miracles Hashem performs for us. Keywords: Hakaras hatov, kriyas yam suf, beshalach, yisro, rav shteyman www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-03-24",
    "duration_minutes": 14.87,
    "spotify_web_url": "https://open.spotify.com/episode/4HmM7hgC8Ix6UmgDh1J0yS",
    "spotify_uri": "spotify:episode:4HmM7hgC8Ix6UmgDh1J0yS",
    "embed_url": "https://open.spotify.com/embed/episode/4HmM7hgC8Ix6UmgDh1J0yS"
  },
  {
    "episode_name": "Parshas Beshalach - How Much Do We Really Believe?",
    "episode_description": "Faith under fire. Why repeat the miracle? Dry land, then water - what changed? Lost letters expose a divide. Did Nachshon’s brazen plunge shame the wavering? What truly troubles the Heavenly Court? Journey through the split sea once again...discover insights to strengthen faith and trust in Hashem. Keywords: emunah, bitachon, kriyat yam suf, red seawww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 13.93,
    "spotify_web_url": "https://open.spotify.com/episode/3JIG9jk7S44ty4DXcIKBcy",
    "spotify_uri": "spotify:episode:3JIG9jk7S44ty4DXcIKBcy",
    "embed_url": "https://open.spotify.com/embed/episode/3JIG9jk7S44ty4DXcIKBcy"
  },
  {
    "episode_name": "Parshas Beshalach - When Faith Fights Fear",
    "episode_description": "Why does the Torah describe the splitting of the sea twice, with subtle yet significant differences? What transforms someone's relationship with Hashem in their darkest moments? In this fascinating exploration of Parshas Beshalach, we uncover the profound connection between two groups at Yam Suf and their different levels of emunah. Through the brilliant lens of the Gaon of Vilna, discover how even the smallest variations in the Torah's text reveal timeless truths about faith and trust in Hashem. This eye-opening episode weaves together ancient wisdom with contemporary inspiration, showing us the transformative power of emunah through recent events that touched all of Klal Yisroel. Join us for an uplifting journey that illuminates how true faith can flourish even in the most challenging circumstances.   Always on www.prismoftorah.org",
    "release_date": "06-02-25",
    "duration_minutes": 14,
    "spotify_web_url": "https://open.spotify.com/episode/6cYHoPkR5UwYqyqWqxPHvC",
    "spotify_uri": "spotify:episode:6cYHoPkR5UwYqyqWqxPHvC",
    "embed_url": "https://open.spotify.com/embed/episode/6cYHoPkR5UwYqyqWqxPHvC"
  },
  {
    "episode_name": "Parshas Beshalach- Emuna & Bitachon (personal story)",
    "episode_description": "Why did Hashem tell Moshe to stop crying out and move forward? What crucial difference exists between emunah and bitachon? How can we elevate our belief from the realm of thought into action? What incredible opportunity did Reb Asaf receive this week relating to these concepts? Tune into this emotional and uplifting episode to discover a special story and gain insight into achieving true bitachon. Keywords:Emunah, bitachon, action, opportunity, storywww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 7.66,
    "spotify_web_url": "https://open.spotify.com/episode/6K4GBoWbCk2VyJDQcWDSbe",
    "spotify_uri": "spotify:episode:6K4GBoWbCk2VyJDQcWDSbe",
    "embed_url": "https://open.spotify.com/embed/episode/6K4GBoWbCk2VyJDQcWDSbe"
  },
  {
    "episode_name": "Parshas Beshalach- The Purpose of Prayer",
    "episode_description": "Thirsting for connection? Why does Hashem test us? What is the true purpose of prayer? Tune in as we explore the deeper meaning behind the lack of water after the Exodus. Discover how prayer fills our spiritual reservoirs. What mistake did Bnei Yisrael make when dying of thirst? How did Moshe understand Hashem's intent?Keywords: prayer, connection, test, thirst, meaning www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 14.94,
    "spotify_web_url": "https://open.spotify.com/episode/3uC87zexlWewQEAtztH8Xb",
    "spotify_uri": "spotify:episode:3uC87zexlWewQEAtztH8Xb",
    "embed_url": "https://open.spotify.com/embed/episode/3uC87zexlWewQEAtztH8Xb"
  },
  {
    "episode_name": "38-Parshas Beshalach: deflecting challenges",
    "episode_description": "The see saw Yosef and split. What does one have to do with the other? Do we daven to Hashem to give us challenges or do we avoid them? Should a Rabbi have to live part time away from his family? This week we explore how to deflect challenges. All this and more, be sure to subscribe to the podcast and to send the links to your friends and family.",
    "release_date": "02-02-23",
    "duration_minutes": 17.54,
    "spotify_web_url": "https://open.spotify.com/episode/4ana0lKhJyF1qdhnsaN9tE",
    "spotify_uri": "spotify:episode:4ana0lKhJyF1qdhnsaN9tE",
    "embed_url": "https://open.spotify.com/embed/episode/4ana0lKhJyF1qdhnsaN9tE"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "39 Parshas Yisro Taking the first step",
    "episode_description": "Parshas Yisro: Taking the first step www.prismoftorah.com Did the Jews want to hear the Torah from Hashem or Moshe? What was the original plan of Hashem? How is there any room for requesting from Hashem by davening doesn’t Hashem do the best for us? What is the point of Davening? How is this related to one of the greatest moments in Jewish history? Let’s relearn this parsha with a deeper understanding of what really happened!",
    "release_date": "09-02-23",
    "duration_minutes": 14.27,
    "spotify_web_url": "https://open.spotify.com/episode/0svNTpBNxulYYSKBWcWReh",
    "spotify_uri": "spotify:episode:0svNTpBNxulYYSKBWcWReh",
    "embed_url": "https://open.spotify.com/embed/episode/0svNTpBNxulYYSKBWcWReh"
  },
  {
    "episode_name": "Parshas Yisro - Act Now or Stay Behind Forever",
    "episode_description": "What compelled Yisro to join Klal Yisrael after hearing about both Kriyas Yam Suf and Milchemes Amalek? Why does this seemingly simple combination of events hold such profound significance? In this week's episode, we unlock a fascinating insight from the Zohar about the art of truly seeing and responding to life-changing moments. While countless nations witnessed the same miracles, only Yisro's response earned him an eternal place in Torah. Through contemporary examples and two powerful stories, we discover the secret of Yisro. Learn the secret of why some people experience profound growth while others let transformative moments slip away, and discover how to harness this wisdom in today's extraordinary times.",
    "release_date": "13-02-25",
    "duration_minutes": 11.48,
    "spotify_web_url": "https://open.spotify.com/episode/7Ig1ukJTWftoXBk85Pppnr",
    "spotify_uri": "spotify:episode:7Ig1ukJTWftoXBk85Pppnr",
    "embed_url": "https://open.spotify.com/embed/episode/7Ig1ukJTWftoXBk85Pppnr"
  },
  {
    "episode_name": "Parshas Yisro - Having The Right Perspective on Life",
    "episode_description": "How did Moshe Rabbeinu prioritize instilling the right hashkafa in his family while living in a spiritually foreign environment? What timeless wisdom does the order in which he named his sons reveal about living life with purpose? How can perceiving ourselves as \"foreigners\" in this world transform our mindset and actions? In this week's episode on Parshat Yitro, dive into the deeper meaning behind the names of Moshe's sons Gershom and Eliezer. Discover how Moshe Rabbeinu made safeguarding his family's spiritual outlook his first priority rather than showing gratitude to Hashem. Explore why the Chofetz Chaim compares our soul's journey in this world to a businessman on a focused mission abroad. What blessing did Rabbi Leib Chasman uniquely give a student that encapsulates our true life purpose? Tune into this eye-opening discussion of gaining an eternal perspective amidst life's routines and challenges. Keywords: Yitro, Moshe Rabbeinu, Gershom, Eliezer, Chofetz Chaim, Rabbi Leib Chasmanwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 8.93,
    "spotify_web_url": "https://open.spotify.com/episode/17KfYTHKfqfWD3FQxTALR2",
    "spotify_uri": "spotify:episode:17KfYTHKfqfWD3FQxTALR2",
    "embed_url": "https://open.spotify.com/embed/episode/17KfYTHKfqfWD3FQxTALR2"
  },
  {
    "episode_name": "Parshas Yisro - Listen, Internalize & Act or Else",
    "episode_description": "Why did Yisro come? What compelled him when others heard, yet did nothing? Why place his story before the giving of Torah? Discover how listening, internalizing and acting is key to growth. Discover how we must seize precious moments before they fade. Tune in to unlock timeless lessons from Parshas Yisro that call on us to truly hear, change, and come closer to Hashem.Keywords: Yisro, listening, acting, internalizing, growthwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-03-24",
    "duration_minutes": 12.8,
    "spotify_web_url": "https://open.spotify.com/episode/5bGiCIe0fAJ5WNTnuQBVuR",
    "spotify_uri": "spotify:episode:5bGiCIe0fAJ5WNTnuQBVuR",
    "embed_url": "https://open.spotify.com/embed/episode/5bGiCIe0fAJ5WNTnuQBVuR"
  },
  {
    "episode_name": "Parshas Yisro - The Importance of Achdus",
    "episode_description": "What was the deeper spiritual power behind the Jewish people encamping “as one” at Mount Sinai? How did later acceptance of Torah amidst the Purim story reflect an even higher level of unity? How can we tap into this unity in our times? Delve into the timeless relevance of Jewish peoplehood. DISCOVER how profound internal connection underpins thriving spiritual living and service of Hashem. Urge to tune into a Torah living dynamic as vibrant as it is ancient. Keywords: Jewish peoplehood, unity, spiritual connection, Torah livingwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-03-24",
    "duration_minutes": 18.87,
    "spotify_web_url": "https://open.spotify.com/episode/4BzJkaHpg7ECr2XuYb4kL4",
    "spotify_uri": "spotify:episode:4BzJkaHpg7ECr2XuYb4kL4",
    "embed_url": "https://open.spotify.com/embed/episode/4BzJkaHpg7ECr2XuYb4kL4"
  },
  {
    "episode_name": "Parshas Yisro- The Secret Recipe For Unity",
    "episode_description": "What is the secret recipe for unity among the Jewish people? How can we overcome divisions and arguments to come together as one? Join Rabbi Asaf Aaron Prisman as he delves into Parshas Yisro and uncovers the profound lessons hidden within the text. Discover how the giving of the Torah at Har Sinai transformed the Bnei Yisrael from a divided nation into a unified whole. Learn about the power of humility and caring for others in fostering harmony and connection. Rabbi Prisman shares inspiring stories that illustrate the importance of putting aside personal interests for the greater good. Tune in to this thought-provoking episode to gain valuable insights into creating a more united and harmonious Jewish community. Keywords: Jewish unity, Parshas Yisro, Torah at Har Sinai, Humility and harmony, Caring for otherswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 12.83,
    "spotify_web_url": "https://open.spotify.com/episode/3uu7XxkXy4WNAmcT4kj4dy",
    "spotify_uri": "spotify:episode:3uu7XxkXy4WNAmcT4kj4dy",
    "embed_url": "https://open.spotify.com/embed/episode/3uu7XxkXy4WNAmcT4kj4dy"
  },
  {
    "episode_name": "Parshas Yisro: Stress Free Journey of Life",
    "episode_description": "Why did the splitting of the sea alone not compel Yisro to convert? Is it not a miracle enough to open one's eyes? How could there still be disbelief after witnessing such an event? What happened next that finally impelled Yisro toward the truth? In this week's podcast, we delve into the eternal riddle of faith versus skepticism. We explore the unexpected combination of events that left even Yisro, a seasoned priest, utterly astonished. What was this mystical one-two punch? This podcast is packed with parables and stories that all have the same root vital message, a message that is probably the most vital of all messages. Join us on this thought-provoking journey as we seek to uncover life's deeper meaning and purpose amidst its stormy seas. Will we sink or will we swim toward spiritual awakening?   www.prismoftorah.org",
    "release_date": "01-02-24",
    "duration_minutes": 16.7,
    "spotify_web_url": "https://open.spotify.com/episode/0KRfF1wktTMLEBKGj4TaUY",
    "spotify_uri": "spotify:episode:0KRfF1wktTMLEBKGj4TaUY",
    "embed_url": "https://open.spotify.com/embed/episode/0KRfF1wktTMLEBKGj4TaUY"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "40: Parshas Mishpatim- Balancing Act",
    "episode_description": "www.prismoftorah.com “The ear must be pierced”. Why the ear? Why does the Torah instruct us to perform such an action only for the person that decided to be a slave as opposed to any other violation of the Torah? Both were heard on Har Sinai. Life is about getting the balance right. Join us on the journey using Rav Hutner’s concept about what is important in life. Also a true story… Listen: https://bit.ly/Mishpatim-Listen Download: https://bit.ly/Mishpatim-download Netfree download: https://send.magicode.me/send-file/file/834af10b042aa9ff31b7ac4135f96d945df9b750/view",
    "release_date": "16-02-23",
    "duration_minutes": 13.72,
    "spotify_web_url": "https://open.spotify.com/episode/4QqdWes93Hjrwwi1bySPWn",
    "spotify_uri": "spotify:episode:4QqdWes93Hjrwwi1bySPWn",
    "embed_url": "https://open.spotify.com/embed/episode/4QqdWes93Hjrwwi1bySPWn"
  },
  {
    "episode_name": "Parshas Mishpatim -  Continues Growth",
    "episode_description": "This week's Prism of Torah explores the powerful connection between Torah study and continuous growth! What does it truly mean to maximize your potential in serving Hashem? Did Bnei Yisrael's acceptance of the Torah at Sinai guarantee growth, or is there more to the story? Reb Asaf Aaron Prisman unpacks Parshat Mishpatim, revealing the surprising reason we received a crown for both \"Naaseh\" (We will do) and \"Nishma\" (We will learn). Join the episode and discover how connecting with Torah fuels our lifelong journey closer to Hashem!Keywords: Parshat Mishpatim, Torah Growth, Naaseh v'Nishmawww,prismoftorah,org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 14.3,
    "spotify_web_url": "https://open.spotify.com/episode/2GH6IFqCsWbOaAIBbgjbSs",
    "spotify_uri": "spotify:episode:2GH6IFqCsWbOaAIBbgjbSs",
    "embed_url": "https://open.spotify.com/embed/episode/2GH6IFqCsWbOaAIBbgjbSs"
  },
  {
    "episode_name": "Parshas Mishpatim - A Blessing in Disguise",
    "episode_description": "In this thought-provoking episode of the Prism of Torah Podcast, Rabbi Asaf Aaron Prisman delves into the profound insights hidden within Parashas Mishpatim. Why does the Torah switch from plural to singular when discussing serving Hashem and receiving blessings? What is the Ramban's perspective on serving Hashem with pure intentions? Rabbi Prisman explores the concept of life as an optical illusion designed by Hashem to test us individually. Discover the inspiring story of a humble cleaner who embodies the essence of serving Hashem with devotion. Tune in to unravel the mysteries and gain a fresh perspective on navigating life's challenges while staying connected to the Almighty.Keywords: Parashat Mishpatim, serving Hashem, Torah insights, life challenges, devotionwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 11.36,
    "spotify_web_url": "https://open.spotify.com/episode/74LCzNkaLhpRsGa9zcYydz",
    "spotify_uri": "spotify:episode:74LCzNkaLhpRsGa9zcYydz",
    "embed_url": "https://open.spotify.com/embed/episode/74LCzNkaLhpRsGa9zcYydz"
  },
  {
    "episode_name": "Parshas Mishpatim - Being Extra Sensitive",
    "episode_description": "In this thought-provoking episode of the Prism of Torah Podcast, Reb Asaf Aaron Prisman delves into Parshas Mishpatim, exploring the profound concept of being extra sensitive towards our fellow Jews. Why did Hashem separate the Ten Commandments into two distinct categories? What deeper message lies behind the Torah's seemingly literal \"eye for an eye\" principle? Reb Prisman shares powerful insights from his chavrusa, Reb Ashi Stengi, and raises intriguing questions about the Torah's approach to interpersonal relationships. Discover how the parsha's themes of sensitivity, awareness, and empathy can transform our connections with others. Tune in to uncover the life-changing wisdom hidden within Parshas Mishpatim!Keywords: Parshas Mishpatim, Ten Commandments, Eye for an eye,  Sensitivity towards fellow Jews, Torah's approach to interpersonal relationships Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 9.18,
    "spotify_web_url": "https://open.spotify.com/episode/3Tdps2XTc6XKqKM9DLOuIs",
    "spotify_uri": "spotify:episode:3Tdps2XTc6XKqKM9DLOuIs",
    "embed_url": "https://open.spotify.com/embed/episode/3Tdps2XTc6XKqKM9DLOuIs"
  },
  {
    "episode_name": "Parshas Mishpatim - Listen, Drink & Be Merry",
    "episode_description": "Why is the ear pierced for a slave who refuses freedom? Why is the ear chosen over the hand or foot? What makes Naaseh Vnishmah - 'hearing and listening' - so unique? Why is it crucial to accept the yoke of heaven by 'listening' to Hashem? In this week's parsha, we delve into a perplexing halacha regarding the ear of the eved ivri. By exploring its deeper significance, we uncover the secrets of the spiritual realms. The result is a formula for truly serving Hashem through cultivating faithful obedience. Join us on a thought-provoking journey into the essence of genuine Avodas Hashem. Additionally, a very interesting true story will be shared to illustrate the concept.   Always on www.prismoftorah.org    Keywords:  Parshat Mishpatim, eved ivri, pierced ear, Shema Yisrael, blind faith, slave/servant to Hashem, Purim drunkenness, observing Shemitah",
    "release_date": "08-02-24",
    "duration_minutes": 20.33,
    "spotify_web_url": "https://open.spotify.com/episode/3ln9jHTGbogwnl3ICKZ5xg",
    "spotify_uri": "spotify:episode:3ln9jHTGbogwnl3ICKZ5xg",
    "embed_url": "https://open.spotify.com/embed/episode/3ln9jHTGbogwnl3ICKZ5xg"
  },
  {
    "episode_name": "Parshas Mishpatim - The Heart of Hearing",
    "episode_description": "At Har Sinai, our ears heard every mitzvah - Shabbos, Kashrus, and the laws of proper speech. So why does only the Eved Ivri get his ear pierced for not listening? What makes this mitzvah so unique that it demands this powerful symbolic punishment? And what profound message lies in the fact that our ears are uniquely designed for receiving, unlike all our other senses? In this fascinating exploration of Parshas Mishpatim, we uncover the deep connection between listening and spiritual balance. Through a gripping story of a Manhattan accountant whose expertise becomes his greatest challenge, we discover how true wisdom often means knowing when to set aside our own understanding. Join us for an eye-opening journey into the art of spiritual listening, the power of genuine humility, and the delicate balance between human wisdom and Divine guidance. This episode reveals how recalibrating our spiritual ears might be the key to unlocking life's most profound transformations.",
    "release_date": "20-02-25",
    "duration_minutes": 14.29,
    "spotify_web_url": "https://open.spotify.com/episode/1Ss9SQ7teg5otjk9bzxv0r",
    "spotify_uri": "spotify:episode:1Ss9SQ7teg5otjk9bzxv0r",
    "embed_url": "https://open.spotify.com/embed/episode/1Ss9SQ7teg5otjk9bzxv0r"
  },
  {
    "episode_name": "Parshas Mishpatim - The Way To Do Chessed",
    "episode_description": "How can we maximize the impact of our mitzvos and chesed? We delve into the Torah's guidelines for lending money and uncover powerful insights. Why does Hashem focus on the details of how we give, not just the act itself? How do our intentions and efforts affect the quality of our mitzvos? Join us as we explore these thought-provoking questions and discover practical ways to infuse our spiritual actions with a full heart. Tune in now for an inspiring discussion that will elevate your avodas Hashem!Keywords: mitzvos, chesed, lending money, intentions, Hashemwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "05-03-24",
    "duration_minutes": 12.59,
    "spotify_web_url": "https://open.spotify.com/episode/6h64qEdogsINFbfvEQV18E",
    "spotify_uri": "spotify:episode:6h64qEdogsINFbfvEQV18E",
    "embed_url": "https://open.spotify.com/embed/episode/6h64qEdogsINFbfvEQV18E"
  },
  {
    "episode_name": "Parshas Mishpatim - What's Important in Life",
    "episode_description": "Ever wondered why the angels questioned giving the Torah to humanity? This week's episode of Prism of Torah dives into a fascinating new perspective from the Maggid Midrashna. We explore the concept of appreciating true value and how our actions speak louder than words. Rabbi Prisman unpacks the hidden message behind the angels' actions in Parashat Mishpatim, leaving us to ponder: Do we truly appreciate the gift of the Torah in our daily lives? How can we ensure our priorities align with its sacred wisdom? Join Rabbi Prisman for an insightful discussion that will challenge your perspective and inspire you to live a life guided by Torah values.Keywords: Parashat Mishpatim, Angels and Torah, Torah Values, Aligning Prioritieswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 11.36,
    "spotify_web_url": "https://open.spotify.com/episode/5aplsigk2y1uot6J4Yz6oW",
    "spotify_uri": "spotify:episode:5aplsigk2y1uot6J4Yz6oW",
    "embed_url": "https://open.spotify.com/embed/episode/5aplsigk2y1uot6J4Yz6oW"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "41: Parshas Teruma - Giving is Getting",
    "episode_description": "When giving for the Mishkan, the leaders seem to make a massive offer of filling in any deficit, they are punished, and one of the letters of their name is taken away. What is the punishment? How did it affect them? When we give Tzedoka who is really supporting whom? Two stories to show this idea how we never really know the truth of what is holding us up!",
    "release_date": "23-02-23",
    "duration_minutes": 13.58,
    "spotify_web_url": "https://open.spotify.com/episode/0j766pIi2JiFenshTNuDga",
    "spotify_uri": "spotify:episode:0j766pIi2JiFenshTNuDga",
    "embed_url": "https://open.spotify.com/embed/episode/0j766pIi2JiFenshTNuDga"
  },
  {
    "episode_name": "Parshas Terumah - Optical Illusion of Giving",
    "episode_description": "Deceived by giving? Is charity truly a one-way street? Rabbi Asaf Aaron Prisman unpacks the fascinating concept of Terumah and reveals the hidden reciprocity in our acts of generosity. Explore the deeper meaning behind the giving of the Nashem in the desert dwelling, and discover how the very word \"Nassim\" holds a powerful clue. What does it mean to be \"taking\" when we give to Hashem? Join this episode of Prism of Torah Podcast and uncover the optical illusion of giving!Keywords: Terumah, Charity, Giving, Nashem, Mishkanwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 11.85,
    "spotify_web_url": "https://open.spotify.com/episode/5MjVGlqGre0i60UFi14XHY",
    "spotify_uri": "spotify:episode:5MjVGlqGre0i60UFi14XHY",
    "embed_url": "https://open.spotify.com/embed/episode/5MjVGlqGre0i60UFi14XHY"
  },
  {
    "episode_name": "Parshas Terumah - Rejuvenate Your Yiddishkeit",
    "episode_description": "Parshas Terumah - Rejuvenate Your Yiddishkeit If the Kruvim symbolize our greatest Torah scholars, why were they fashioned with childlike faces instead of elderly, wise figures with flowing beards? And why does Midrash Rabbah compare Torah to both gold and silver when gold clearly holds superior value? This week, we uncover a profound paradox at the heart of authentic Torah learning that might transform your entire approach to Yiddishkeit. The Aron's design reveals a startling truth—that childlike wonder and openness, not just scholarly seriousness, forms the foundation of becoming a true Talmid Chacham. Through a personal encounter with Rav Chaim Kanievsky zt\"l, we witness how even the greatest minds maintain their excitement for learning at every level, embracing both the golden depths and silver accessibility of Torah. Join us to discover the delicate balance between intellectual growth and spiritual simplicity that can breathe new life into your daily avodas Hashem.",
    "release_date": "27-02-25",
    "duration_minutes": 16.37,
    "spotify_web_url": "https://open.spotify.com/episode/7ipkQYiivijq4mLzDahI1q",
    "spotify_uri": "spotify:episode:7ipkQYiivijq4mLzDahI1q",
    "embed_url": "https://open.spotify.com/embed/episode/7ipkQYiivijq4mLzDahI1q"
  },
  {
    "episode_name": "Parshas Terumah - Renovations for the Shechinah",
    "episode_description": "This week's Parsha dives deep into the construction of the Mishkan, but is it simply a dwelling place for Hashem? Rabbi Prisman explores the fascinating idea that the Mishkan is also intrinsically linked to the Torah. What does it mean to \"take\" Hashem into our midst? How can we create a space for both Hashem's presence and the study of Torah in our own lives? Join Rabbi Prisman as he unpacks the layers of meaning behind the commandment to build the Mishkan and reveals the profound connection between Torah, Hashem, and the Jewish people. Tune in to discover how this concept can impact your daily connection to Judaism!Keywords: Parshat Terumah, Mishkan, Torah study, Shechinahwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 13.62,
    "spotify_web_url": "https://open.spotify.com/episode/1DNuTpK7IG6MeFly6xzqSG",
    "spotify_uri": "spotify:episode:1DNuTpK7IG6MeFly6xzqSG",
    "embed_url": "https://open.spotify.com/embed/episode/1DNuTpK7IG6MeFly6xzqSG"
  },
  {
    "episode_name": "Parshas Terumah - Supporting the Supporter",
    "episode_description": "In this thought-provoking episode of Prism of Torah, Rabbi Asaf Aaron Prisman delves into Parshas Terumah and the deeper meaning behind giving to the Mishkan. Why does the Torah say \"take from me an offering\" instead of \"give an offering\"? What lesson can we learn from the Nesi'im's approach to contributing? Rabbi Prisman explores these questions and more, drawing upon insights from the Rambam, Chofetz Chaim, and a powerful story about Rabbi Eliezer Gordon. Discover how the act of giving is truly an opportunity to receive and become closer to Hashem. Tune in for the full discussion on this transformative perspective!Keywords: Parshas Terumah, giving vs. receiving, Nesi'im, supporting Torah, closeness to Hashemwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 12.41,
    "spotify_web_url": "https://open.spotify.com/episode/0sOCk3z4ovMYfkeW005utq",
    "spotify_uri": "spotify:episode:0sOCk3z4ovMYfkeW005utq",
    "embed_url": "https://open.spotify.com/embed/episode/0sOCk3z4ovMYfkeW005utq"
  },
  {
    "episode_name": "Parshas Terumah - True Mesiras Nefesh",
    "episode_description": "What was the sin of the golden calf really about? How did Aharon's actions, while mistaken, reveal his true character and love for Klal Yisrael? Join Rabbi Asaf Aaron Prisman in Parashas Terumah as he explores these fascinating questions. Delve into Midrashic insights about Aharon becoming the Kohen Gadol and how it connects to the chet ha'egel. Learn how Aharon was moser nefesh for the Jewish people, and how that quality is essential for leadership. Be inspired by a moving story about true friendship and mesiras nefesh. Tune in for a thought-provoking discussion that will change how you view the Mishkan, the role of the Kohen Gadol, and the importance of empathy and selflessness. Keywords: Parashas Terumah, Golden Calf, Aharon Kohen Gadol, Sin and Redemption, Jewish Leadershipwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 17.36,
    "spotify_web_url": "https://open.spotify.com/episode/60Ztupjcs2q71HiXLqHI5S",
    "spotify_uri": "spotify:episode:60Ztupjcs2q71HiXLqHI5S",
    "embed_url": "https://open.spotify.com/embed/episode/60Ztupjcs2q71HiXLqHI5S"
  },
  {
    "episode_name": "Parshas Terumah - What's Important in Hashem's Eyes",
    "episode_description": "What does Hashem truly value in our efforts? How do the materials donated for the Mishkan reveal a profound lesson about our spiritual journey? In this week's Parsha, Terumah, Rabbi Asaf Aaron Prisman delves into the intricacies of the Torah's description of the Mishkan's construction. From the order of the materials listed to the unique origin of the precious stones, each detail holds a key to understanding what Hashem cherishes most. Join us as we explore the deeper meaning behind these offerings and discover how we can apply this wisdom to our daily lives. Tune in to unravel the mystery and gain a fresh perspective on what it means to truly connect with the Divine.Keywords: Parsha Terumah, Mishkan donations, Effort in Judaism, Spiritual growth, Connecting with Hashem.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 7.77,
    "spotify_web_url": "https://open.spotify.com/episode/0Gzlle3LF6hozVaKQaOzgc",
    "spotify_uri": "spotify:episode:0Gzlle3LF6hozVaKQaOzgc",
    "embed_url": "https://open.spotify.com/embed/episode/0Gzlle3LF6hozVaKQaOzgc"
  },
  {
    "episode_name": "Parshas Terumah- Elevate & Activate",
    "episode_description": "Why is there such a strong emphasis on purity of intent when giving Teruma? Does Hashem truly require gold and silver for the Mishkan, or could it be constructed using simple bricks and stones? Is there a deeper meaning behind these valuable materials? How is love connected to holiness?  Join us as we delve into the mystical aspects of Parshas Teruma. Explore how to elevate physicality in all aspects of life and sanctify our homes as a dwelling place for the Shechina. Gain valuable insights on promoting passion through choice in Chinuch lessons. Uncover how giving Teruma correctly reflects our eternal Avodas Hashem. Always on www.prismoftorah.org",
    "release_date": "15-02-24",
    "duration_minutes": 12.66,
    "spotify_web_url": "https://open.spotify.com/episode/2lkWfDgSQUTVBMXajENmXH",
    "spotify_uri": "spotify:episode:2lkWfDgSQUTVBMXajENmXH",
    "embed_url": "https://open.spotify.com/embed/episode/2lkWfDgSQUTVBMXajENmXH"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Tetzaveh - The Best Way to Live Life",
    "episode_description": "What caused Moshe Rabbeinu's name to be removed from the Parsha? How does this relate to the two ways of serving Hashem? Discover the profound lessons hidden within the burning bush encounter and the story of the Ger Mevilna's esrog. Explore the depths of spiritual growth and the true meaning of selflessness through the lives of great leaders like Rav Steinman and Rabbanit Kanevski. Uncover the connection between suspecting others and one's own spiritual level, and learn how Moshe Rabbeinu's ultimate act of self-sacrifice teaches us about pure devotion to Hashem's will. Tune in to this thought-provoking episode to gain a deeper understanding of what it means to serve Hashem with pure intentions and how this can transform your life and impact those around you. Keywords: Moshe Rabbeinu, Serving Hashem, Ger Mevilna, Kohen Gadolwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 12.77,
    "spotify_web_url": "https://open.spotify.com/episode/6pOGLV6zkSrHyMzy6PnhUV",
    "spotify_uri": "spotify:episode:6pOGLV6zkSrHyMzy6PnhUV",
    "embed_url": "https://open.spotify.com/embed/episode/6pOGLV6zkSrHyMzy6PnhUV"
  },
  {
    "episode_name": "Parshas Tetzaveh - Which Lens Are You Using",
    "episode_description": "Why does the 'Meil Tchelet' (Turquoise coat) worn by the Kohen Gadol atone specifically for the sin of Lashon Hara? What deeper connection exists between the jingling bells at its hem and our everyday speech? Reb Asaf uncovers the hidden wisdom through this connection. Discover insights from Chazal about how the garments of the Kohanim carry profound messages for our modern lives. The symbolism of turquoise, the ocean's boundaries, and the surprising lesson of seeing the complete picture will transform how you view others and help you guard your speech. This isn't just about avoiding negative talk – it's about adopting a heavenly perspective that can bring true Shalom to your relationships and our world. Perhaps this can help you in one of life's most challenging but \"very rewarding\" mitzvos.",
    "release_date": "06-03-25",
    "duration_minutes": 14.1,
    "spotify_web_url": "https://open.spotify.com/episode/6MLrZXB1YfZFjI8ITIxeW6",
    "spotify_uri": "spotify:episode:6MLrZXB1YfZFjI8ITIxeW6",
    "embed_url": "https://open.spotify.com/embed/episode/6MLrZXB1YfZFjI8ITIxeW6"
  },
  {
    "episode_name": "Parshas Tetzaveh- Impact Your Destiny",
    "episode_description": "Sponsored by The Weitzner Family, in memory of Moshe Yechial Ben Meir  What is the underlying significance of the priestly garments? Why is the functionality of the \"Urim Vetumim\" (Prophecy) linked to Aaron rather than a prophet? How did he earn this level of Divine communication? This week, we delve into the mysteries surrounding the clothing of the Cohen. By closely examining the pessukim, we uncover valuable lessons on recognizing the hand of God and learn how the most profound Divine revelations are achieved. Clues emerge aligning Purim with the themes of Tetzaveh, shedding light on our journey toward true connection and understanding of Hashem's hidden presence. Join us as we uncover insights from the past that remain relevant to this day.  Always on www.prismoftorah.org",
    "release_date": "22-02-24",
    "duration_minutes": 17.85,
    "spotify_web_url": "https://open.spotify.com/episode/2rwA4UWaAeb9eq2FyZ5H4y",
    "spotify_uri": "spotify:episode:2rwA4UWaAeb9eq2FyZ5H4y",
    "embed_url": "https://open.spotify.com/embed/episode/2rwA4UWaAeb9eq2FyZ5H4y"
  },
  {
    "episode_name": "Parshas Tetzaveh- When Absence Speaks Volumes",
    "episode_description": "Why was Hashem upset with Moshe Rabbeinu, despite his care for Bnei Yisrael? What is the significance of Parshat Tetzaveh in this context? Explore the profound insights into serving Hashem with love and fear. Delve into the subtle nuances of Moshe Rabbeinu's actions and their consequences. Discover the transformative power of aligning our will with Hashem's. Join us as we unravel these mysteries and more in this thought-provoking episode of the Prism of Torah podcast. Tune in to gain a deeper understanding of our relationship with the Divine and the path to spiritual growth.Keywords: Parshas Tetzaveh, Moshe Rabbeinu, Serving Hashem with love and fear, Kohen Gadol, Aligning with Hashem's will www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "25-03-24",
    "duration_minutes": 13.37,
    "spotify_web_url": "https://open.spotify.com/episode/1vr4nEKsdp5xA2RvmOixHw",
    "spotify_uri": "spotify:episode:1vr4nEKsdp5xA2RvmOixHw",
    "embed_url": "https://open.spotify.com/embed/episode/1vr4nEKsdp5xA2RvmOixHw"
  },
  {
    "episode_name": "42: Parshas Tetzaveh Knock, knock- who's there",
    "episode_description": "Tetzaveh: Knock, knock- who's there? www.prismoftorah.com Kohen Gadol must wear bells or he may die! Why is this? What does this parsha have to do with us? Knock knock, wake up and listen. This week is also purim. Did Eshter have fear of going into the king? Lets tie this all together purim, kohen gadol and Noach all in one. Plus getting drunk on Purim? How much is drunk and why? All here this week.",
    "release_date": "02-03-23",
    "duration_minutes": 16.68,
    "spotify_web_url": "https://open.spotify.com/episode/2fD4WU18eZLJQSwuTBwIIG",
    "spotify_uri": "spotify:episode:2fD4WU18eZLJQSwuTBwIIG",
    "embed_url": "https://open.spotify.com/embed/episode/2fD4WU18eZLJQSwuTBwIIG"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "43: Parshas Ki Sisa- The half time show",
    "episode_description": "We see this week the power of half. What is the lesson the Torah is coming to teach us? How can we become more perfect human beings? How much Emunah is enough Emunah? All this can be learnt from the half-shekel coins and the support of the Mishkan. Enjoy this week with Reb Asaf Aharon Prisman Technical support questions: admin@prismoftorah.com  I would like to thank Reb Asaf Aharon, the team and all our listeners for the beautiful Mishloach Manos which was sent to me. - Eli from the technical side of things",
    "release_date": "09-03-23",
    "duration_minutes": 10.16,
    "spotify_web_url": "https://open.spotify.com/episode/7520P62JIfZ6iX1x6Kgabw",
    "spotify_uri": "spotify:episode:7520P62JIfZ6iX1x6Kgabw",
    "embed_url": "https://open.spotify.com/embed/episode/7520P62JIfZ6iX1x6Kgabw"
  },
  {
    "episode_name": "Ki Sisa - Fabric of Faith",
    "episode_description": "Why do bad things happen to good people? How can we trust that everything is for the best? In this thought-provoking episode of The Prism of Torah, Reb Asaf Aharon Prisman delves into the story of Rabbi Akiva's torture and the perplexing response from Hashem. Through a captivating parable about a Jewish tailor and a king, Reb Prisman sheds light on the profound concept of \"tov avoh\" and the importance of faith in the face of adversity. Join us as we unravel the fabric of faith and explore the intricate tapestry of Hashem's plan. Tune in to discover the timeless wisdom and practical insights that can transform your perspective on life's challenges. Keywords: Rabbi Akiva torture, Good & Bad, Jewish tailor parable, Trusting in Hashem's plan, Faith in adversity Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-05-24",
    "duration_minutes": 3.46,
    "spotify_web_url": "https://open.spotify.com/episode/6ScE55bRRk6aEMaMGlb35A",
    "spotify_uri": "spotify:episode:6ScE55bRRk6aEMaMGlb35A",
    "embed_url": "https://open.spotify.com/embed/episode/6ScE55bRRk6aEMaMGlb35A"
  },
  {
    "episode_name": "Ki Sisa - Our Reality Vs. The Absolute Truth",
    "episode_description": "How can we reconcile the suffering of the righteous with the prosperity of the wicked? Why does Hashem sometimes conceal His ways? Join us as we delve into the profound dialogue between Moshe Rabbeinu and Hashem in Parshas Ki Sisa. Uncover the deeper meaning behind the concept of blessing both the good and the bad. Explore the idea that everything Hashem does is for our ultimate benefit, even when we cannot understand it in the moment. Discover the distinction between our limited perception of reality and the absolute truth that only Hashem comprehends. In this thought-provoking episode, we will grapple with these timeless questions and gain a fresh perspective on faith, trust, and acceptance. Tune in to \"The Prism of Torah\" to enlighten your understanding and strengthen your connection with Hashem.Keywords: Ki Sisa parsha insights, Suffering of the righteous, Blessing the good and bad, Hashem's hidden ways, Faith and trust in Hashemwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-05-24",
    "duration_minutes": 13.22,
    "spotify_web_url": "https://open.spotify.com/episode/6ONPziQAWnaO9Rkc2FSvnd",
    "spotify_uri": "spotify:episode:6ONPziQAWnaO9Rkc2FSvnd",
    "embed_url": "https://open.spotify.com/embed/episode/6ONPziQAWnaO9Rkc2FSvnd"
  },
  {
    "episode_name": "Ki Sisa – Today, Tomorrow The Chicago Bulls and the Golden Calf",
    "episode_description": "How does the story of the Golden Calf relate to the Chicago Bulls dynasty? What crucial lesson can we learn from Aharon's response to the people's demand? In this thought-provoking episode, Rabbi Asaf Aaron Prisman delves into the deeper meaning behind the word \"tomorrow\" in the context of facing challenges and setbacks. Drawing from powerful examples in sports and the eternal wisdom of Torah, he explores the nature of faith, resilience, and the importance of getting back on track after stumbling. Join us as we uncover timeless insights from Parshas Ki Sisa that can help us navigate life's ups and downs and strengthen our connection with Hashem. Tune in now to discover how this ancient story can transform your perspective and inspire personal growth.Keywords: Ki Tisa, Golden Calf, Aharon's response, Chicago Bulls dynasty, Overcoming setbackswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 12.43,
    "spotify_web_url": "https://open.spotify.com/episode/5S3yeIRGx7yE3aLrdXNrAp",
    "spotify_uri": "spotify:episode:5S3yeIRGx7yE3aLrdXNrAp",
    "embed_url": "https://open.spotify.com/embed/episode/5S3yeIRGx7yE3aLrdXNrAp"
  },
  {
    "episode_name": "Ki Sisa - What Separates the Men & Boys",
    "episode_description": "Do you ever feel like Amalek has the upper hand in today's world? Why does the Torah emphasize the word \"tomorrow\"? Can we find strength in the face of adversity and temptation? Join Rabbi Asaf Aharon Prisman as he delves into the deeper meaning behind the golden calf incident and the battle against Amalek. Discover how the concept of \"tomorrow\" holds the key to overcoming life's challenges and staying true to Hashem's path. Explore the powerful lessons we can learn from the Chicago Bulls and the Russian army about resilience and perseverance. Don't miss this thought-provoking episode that will inspire you to rise above the Yetzer Hara and embrace the transformative power of teshuvah. Tune in now to uncover the profound insights waiting for you! Keywords: Amalek and the golden calf, Tomorrow in the Torah, Overcoming the Yetzer Hara, Teshuvah and resilience ,Faith in turbulent timeswww.prismoftorah.com Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-05-24",
    "duration_minutes": 10.79,
    "spotify_web_url": "https://open.spotify.com/episode/1fL2o6oQR0BUuawFJxmHwX",
    "spotify_uri": "spotify:episode:1fL2o6oQR0BUuawFJxmHwX",
    "embed_url": "https://open.spotify.com/embed/episode/1fL2o6oQR0BUuawFJxmHwX"
  },
  {
    "episode_name": "Parshas Ki Sisa - Always for the Best",
    "episode_description": "Why do the righteous suffer while the wicked prosper? How can we find joy in life's darkest moments? Join Rabbi Asaf Aaron Prisman as he delves into Parashat Ki Tisa and uncovers profound insights from the conversation between Moshe Rabbeinu and Hashem. Discover the hidden beauty in life's challenges and the power of trusting in Hashem's plan. Learn how to embrace the unknown and find peace in the face of adversity. Explore the concept of \"Gam Zu L'Tovah\" and the importance of accepting Hashem's will with a full heart. Don't miss this thought-provoking episode that will transform your perspective on life's trials and tribulations. Tune in now to \"The Prism of Torah\" podcast and unveil the wisdom that awaits you! Keywords: Parashat Ki Tisa, Gam Zu L'Tovah, Trusting in Hashem's plan, Finding joy in adversity, Accepting Hashem's willwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 15.29,
    "spotify_web_url": "https://open.spotify.com/episode/5wzmfL9Ic9C2p7VHTxcIIE",
    "spotify_uri": "spotify:episode:5wzmfL9Ic9C2p7VHTxcIIE",
    "embed_url": "https://open.spotify.com/embed/episode/5wzmfL9Ic9C2p7VHTxcIIE"
  },
  {
    "episode_name": "Parshas Ki Sisa - Honesty is the Best Policy",
    "episode_description": "What can we learn from the tragic sin of the Golden Calf? How does the intensity of our actions, both good and bad, affect our spiritual growth? Join Rabbi Asaf Aaron Prisman as he delves into Parshas Ki Tisa and uncovers powerful insights about honesty, sincerity, and our relationship with Hashem. Discover the deeper meaning behind Moses' reaction to the Bnei Yisroel’s transgression and explore the importance of being true to ourselves in our service of the Divine. How can we cultivate genuine enthusiasm for mitzvos, and what are the dangers of self-deception? Tune in to this thought-provoking episode of the Prism of Torah Podcast to gain a fresh perspective on these timeless lessons and more. Keywords: Parshat Ki Tisa, Golden Calf, Honesty in Judaism, Enthusiasm for Mitzvot, Spiritual Growthwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 11.33,
    "spotify_web_url": "https://open.spotify.com/episode/0Yt6ecvU4QSdfTCc05wGZ6",
    "spotify_uri": "spotify:episode:0Yt6ecvU4QSdfTCc05wGZ6",
    "embed_url": "https://open.spotify.com/embed/episode/0Yt6ecvU4QSdfTCc05wGZ6"
  },
  {
    "episode_name": "Parshas Ki Sisa - Snakes & Sinks",
    "episode_description": "What is the deeper meaning behind the Kohanim washing their hands and feet? Why were the Kiyor and Mizbeach made specifically from copper? What crucial lesson does it contain that applies to our spiritual lives today?  Delve into the secrets of the Mishkan’s outer courtyard and discover how the Kohanim’s purification process holds valuable guidance for fortifying our own faith. Learn powerful perspectives from the Neshivas Shalom and the Noam Elimelech on protecting our prayers from negative forces seeking to feed off our mitzvos. This episode explores how meticulous spiritual preparation can uplift our religious devotion to brand new heights of purity.  Don’t miss this eye-opening discussion.  Always on www.prismoftorah.org",
    "release_date": "29-02-24",
    "duration_minutes": 16.52,
    "spotify_web_url": "https://open.spotify.com/episode/4r9cNgnNVdxrZnzWzwpoTl",
    "spotify_uri": "spotify:episode:4r9cNgnNVdxrZnzWzwpoTl",
    "embed_url": "https://open.spotify.com/embed/episode/4r9cNgnNVdxrZnzWzwpoTl"
  },
  {
    "episode_name": "Parshas Ki Sisa- Being Wise in the Heart",
    "episode_description": "What does it truly mean to be wise in the heart? How can we unlock the wisdom that Hashem bestows upon us? In this profound episode of The Prism of Torah, Reb Asaf Aharon Prisman delves into the depths of Parshat Ki Tisa, exploring the intricacies of wisdom, emotion, and the human heart. Discover the powerful insights hidden within the Torah's words as we unravel the mystery of being \"chacham lev.\" Join us on a journey of self-discovery and spiritual growth, as we learn how to align our hearts with the wisdom of Hashem. Tune in to uncover the life-changing lessons that await in this thought-provoking discussion. Keywords: Parshat Ki Tisa, Wisdom in the heart,Chacham lev, Mishkan vessels, Torah wisdomwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 14.41,
    "spotify_web_url": "https://open.spotify.com/episode/5gACfRHFovQKKZ4fllWP4v",
    "spotify_uri": "spotify:episode:5gACfRHFovQKKZ4fllWP4v",
    "embed_url": "https://open.spotify.com/embed/episode/5gACfRHFovQKKZ4fllWP4v"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Vayakhel  -  Start Being a Wise Man",
    "episode_description": "What does it truly mean to be wise? Is intellect alone enough, or is there more to wisdom than knowledge? Join Rabbi Asaf Prisman as he delves into the intriguing concept of the \"Chacham Lev\" - the wise-hearted person. Discover the profound connection between the heart and true wisdom, and explore how we can bring the intellect Hashem has gifted us into the realm of action. Through thought-provoking insights and real-life examples, this episode of The Prism of Torah will challenge your understanding of wisdom and inspire you to internalize the Torah's teachings. Tune in to uncover the secrets of becoming a true Chacham Lev and living a life of purpose and spiritual growth.Keywords: Chacham Lev, Torah wisdom, Internalizing knowledge, Heart and intellect, Spiritual growthwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 15.67,
    "spotify_web_url": "https://open.spotify.com/episode/3Ni5mzb6V9N248lIQrCafc",
    "spotify_uri": "spotify:episode:3Ni5mzb6V9N248lIQrCafc",
    "embed_url": "https://open.spotify.com/embed/episode/3Ni5mzb6V9N248lIQrCafc"
  },
  {
    "episode_name": "Parshas Vayakhel  - All From Hashem",
    "episode_description": "Does everything in our lives truly come from Hashem? Why is the commandment of Shabbos mentioned before the Mishkan? These are just a couple of the thought-provoking questions raised in this week's episode of The Prism of Torah. Join Reb Asaf Aharon Prisman as he delves into the deeper meanings behind the passive language used in the Torah and uncovers the true source of our blessings. Discover the connection between our efforts and Hashem's will, and learn how to find happiness and security through faith. Tune in to unravel these intriguing insights and more in this enlightening discussion. Keywords: Parsha Vayakhel, Shabbos and Mishkan, Blessings from Hashem, Faith and happiness,- Chovos HaLevavoswww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "07-05-24",
    "duration_minutes": 11.43,
    "spotify_web_url": "https://open.spotify.com/episode/1I7cPwmSDajpr3BfidmLjl",
    "spotify_uri": "spotify:episode:1I7cPwmSDajpr3BfidmLjl",
    "embed_url": "https://open.spotify.com/embed/episode/1I7cPwmSDajpr3BfidmLjl"
  },
  {
    "episode_name": "Parshas Vayakhel  - The Truly Wealthy Person",
    "episode_description": "What is the connection between Shabbos and true wealth? Why does the Torah emphasize that work \"may be done\" in six days? How can internalizing a key concept about Shabbos transform our lives?In this thought-provoking episode, we delve into the profound wisdom hidden within the commandment of Shabbos. Uncover the secret to attaining genuine peace and harmony in our lives, as we explore the deeper meaning behind the Torah's carefully chosen words. Discover how our understanding of work and wealth can be revolutionized by grasping a fundamental truth about Hashem's role in our lives.Join us on a journey of discovery and inspiration, as we unravel the timeless insights of our sages and apply them to our modern lives. Tune in now to unlock the transformative power of Shabbos and redefine your perception of true wealth. Keywords: Shabbos and wealth, Bitachon in Hashem, Parsha Vayakhel, Mishkan donations, Chovos Halevavos Shaar Bitachonwww.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 13.11,
    "spotify_web_url": "https://open.spotify.com/episode/37wYFdbHanFqUtmHbhgPV4",
    "spotify_uri": "spotify:episode:37wYFdbHanFqUtmHbhgPV4",
    "embed_url": "https://open.spotify.com/embed/episode/37wYFdbHanFqUtmHbhgPV4"
  },
  {
    "episode_name": "Parshas Vayakhel - Golden Intentions",
    "episode_description": "Have you ever been asked to take something precious and give it away? This week's episode explores the deeper meaning behind the mitzvah of giving in Parshas Vayakhel. We learn how what we find most dear to ourselves can be the key to unlocking a stronger connection with Hashem. Discover how the giving of gold in the Mishkan wasn't just about the material, but about revealing the depths of our hearts. Tune in to unlock the secrets of true connection! Always on www.prismoftorah.org",
    "release_date": "07-03-24",
    "duration_minutes": 15.54,
    "spotify_web_url": "https://open.spotify.com/episode/0ztbcKqJaSSKJlsQmLCzQr",
    "spotify_uri": "spotify:episode:0ztbcKqJaSSKJlsQmLCzQr",
    "embed_url": "https://open.spotify.com/embed/episode/0ztbcKqJaSSKJlsQmLCzQr"
  },
  {
    "episode_name": "Parshas Vaykhel - Dream it, Do it With Hashem",
    "episode_description": "Have you ever wondered what enables ordinary people to achieve extraordinary things? How could the Bnei Yisroel, without specialized training or experience, create the intricate vessels for the Mishkan? What hidden force allows us to transcend our natural limitations when our hearts are fully engaged?In Parshas Vayakhel, we encounter a curious repetition. The Torah describes those who contributed to building the Mishkan as people \"whose hearts lifted them up\" and those \"whose spirits moved them.\" This seemingly redundant phrasing caught the attention of commentators like the Ramban and Or HaChaim, who discovered profound implications about human potential hidden within these words.Join Reb Prisman as he unpacks the fascinating concept of \"spiritual DNA\" - the mysterious capacity for heart-driven determination to unlock capabilities we never knew we possessed. Through analysis of traditional sources and a remarkable modern story about a family who transformed a simple business decision into a global empire, we'll explore how this ancient wisdom continues to shape our understanding of human achievement.Check out our website prismoftorah.org",
    "release_date": "20-03-25",
    "duration_minutes": 14.84,
    "spotify_web_url": "https://open.spotify.com/episode/0BbOd1wjOL2qDf6SVHabOz",
    "spotify_uri": "spotify:episode:0BbOd1wjOL2qDf6SVHabOz",
    "embed_url": "https://open.spotify.com/embed/episode/0BbOd1wjOL2qDf6SVHabOz"
  },
  {
    "episode_name": "44: Parshas Vayakhel / Pekudei – start being a wise man",
    "episode_description": "www.prismoftorah.com The items have been brought to assist the Mishkan construction. Hashem says a חכם לב should build the Mishkan. What does the heart have to do with anything? In fact why is the brain, the power of thinking never mentioned in the Torah? Surely it should be the most important part of the person? Knowledge is knowing a tomato is a fruit; Wisdom is not putting it in a fruit salad We have to learn from this lesson how this message should be taken into real-life situations. A story that shows us how some are able to do it after the money jumps out from under the bed- yes it’s a true story All this and more on the podcast with Reb Asaf Aharon Prisman Techincal support questions: admin@prismoftorah.com",
    "release_date": "16-03-23",
    "duration_minutes": 15.67,
    "spotify_web_url": "https://open.spotify.com/episode/5i514kGxmAIB2JSrxFfr12",
    "spotify_uri": "spotify:episode:5i514kGxmAIB2JSrxFfr12",
    "embed_url": "https://open.spotify.com/embed/episode/5i514kGxmAIB2JSrxFfr12"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "376: Parshas Pekudei - Mirror, Mirror on the Sink",
    "episode_description": "How can mirrors, so often symbols of vanity, transform into vessels of sanctity (Kedusha)? What profound lesson does the Kiyor teach us about the elevation of the mundane? In Parshas Pekudei, we explore these compelling questions and unravel the debate between Moshe Rabbeinu and Hashem over the purpose of physical pleasures in this world. Delve into the remarkable insights of Rav Shimshon Raphael Hirsch, uncovering how even the Yetzer Hara can be elevated into a tool for Avodas Hashem. This episode illustrates how we can infuse holiness into the very fabric of our daily lives. Tune in now for a profound journey into the heart of Kedusha and discover how to elevate the physical into the spiritual.",
    "release_date": "27-03-25",
    "duration_minutes": 10.31,
    "spotify_web_url": "https://open.spotify.com/episode/4qIsLo5aLQCVg19Bo6Eiwf",
    "spotify_uri": "spotify:episode:4qIsLo5aLQCVg19Bo6Eiwf",
    "embed_url": "https://open.spotify.com/embed/episode/4qIsLo5aLQCVg19Bo6Eiwf"
  },
  {
    "episode_name": "Parshas Pekudei - A true Oved Hashem",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "03-10-23",
    "duration_minutes": 12.99,
    "spotify_web_url": "https://open.spotify.com/episode/0JbwKgZsKMHHbv9nUwZPVN",
    "spotify_uri": "spotify:episode:0JbwKgZsKMHHbv9nUwZPVN",
    "embed_url": "https://open.spotify.com/embed/episode/0JbwKgZsKMHHbv9nUwZPVN"
  },
  {
    "episode_name": "Parshas Pekudei - Nothing Like a Clean Impression",
    "episode_description": "Have you ever wondered what it truly means to have a clean name in the eyes of Hashem and your fellow Jews? How far should you go to ensure your actions are not misinterpreted?  Join us as we delve into the fascinating Midrash about Moshe Rabbeinu and the building of the Mishkan. We'll explore the delicate balance between personal integrity and public perception, and uncover the profound lessons hidden within this story. From the psychology of money to the power of judging others favorably, this episode is filled with timeless wisdom for navigating the complexities of life with a sterling reputation.  Discover the key to living a life beyond reproach and earning the respect of both Heaven and Earth. Tune in now to unlock these transformative insights! Always on www.prismoftorah.org   Keywords:  Moshe Rabbeinu, Mishkan, Clean reputation, Judaism, Judging others favorably, Jewish wisdom,  money, Torah lessons, integrity",
    "release_date": "14-03-24",
    "duration_minutes": 18.22,
    "spotify_web_url": "https://open.spotify.com/episode/1igTPrZJwBIzlka263Bc9W",
    "spotify_uri": "spotify:episode:1igTPrZJwBIzlka263Bc9W",
    "embed_url": "https://open.spotify.com/embed/episode/1igTPrZJwBIzlka263Bc9W"
  }
]