[
  {
    "episode_name": "45: Parshas Vayikra: Life is like shopping at a supermarket",
    "episode_description": "www.prismoftorah.com In this week's podcast, we explore the meaning and purpose of some of the mitzvot that are not obligatory or have no fixed measure, such as some of the offerings in the Temple. The Steipler Gaon teaches us how these mitzvot can help us develop a closer relationship with Hashem. We compare it to shopping in a supermarket. We also discuss how this concept relates to Chanukah, and how we can observe the mitzvah of eating without breaking bones in a respectful and mindful way. Join us for an insightful and inspiring conversation on this week's podcast.",
    "release_date": "23-03-23",
    "duration_minutes": 15.22,
    "spotify_web_url": "https://open.spotify.com/episode/4MLJySs6WMEsQomX26EleH",
    "spotify_uri": "spotify:episode:4MLJySs6WMEsQomX26EleH",
    "embed_url": "https://open.spotify.com/embed/episode/4MLJySs6WMEsQomX26EleH"
  },
  {
    "episode_name": "377 Parshas Vayikra - Pressing the Right Buttons",
    "episode_description": "Ever wondered why the Torah begins discussing voluntary sacrifices before mandatory ones? Why sacrifice animals which symbolize extreme materialism—would it not make more sense to give Hashem something more spiritual? In this week's exploration of Parshas Vayikra, we uncover the mechanics behind korbanos and their deeper significance in our spiritual journey. Discover how every voluntary action creates a stronger bond with Hashem than obligatory deeds, and why this lesson is relevant even today when we unfortunately don't have the privilege of bringing korbanos. What can we do to make this world a better place? Join us as we reveal the spiritual buttons you're already pressing to bring the Shechina down to earth, and why the effects of your actions might be the most astonishing revelation awaiting you in Olam Haba.",
    "release_date": "03-04-25",
    "duration_minutes": 8.89,
    "spotify_web_url": "https://open.spotify.com/episode/44bQrZKBUFpv51sRzEXvVn",
    "spotify_uri": "spotify:episode:44bQrZKBUFpv51sRzEXvVn",
    "embed_url": "https://open.spotify.com/embed/episode/44bQrZKBUFpv51sRzEXvVn"
  },
  {
    "episode_name": "Parshas Vayikra - Getting into Pesach mode",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.91,
    "spotify_web_url": "https://open.spotify.com/episode/7k8ori1OuzE0MfqHjsoyGp",
    "spotify_uri": "spotify:episode:7k8ori1OuzE0MfqHjsoyGp",
    "embed_url": "https://open.spotify.com/embed/episode/7k8ori1OuzE0MfqHjsoyGp"
  },
  {
    "episode_name": "Parshas Vayikra- Creating an Atmosphere of Simcha",
    "episode_description": "What creates Simcha? Have you ever wondered why Purim is filled with such intense joy?  What is something even deeper that is at play? This episode explores the profound connection between disconnection and reconnection, separation and reunion. We delve into the idea of the \"split waters\" and how it unlocks a deeper understanding of Simcha on Purim.  Join us as we discover how reconnecting to Hashem, Torah, and our fellow Jews is the key to unlocking true and lasting joy. Keywords: Purim Simcha, Reconnection and Joy in Judaism, The Meaning of the Split Waters, Deepening Your Purim Experience,  Torah Perspective on Purim Joy Our podcast is now available on YouTube, making it even easier for you to access and share with others. Please subscribe to our channel and feel free to share the link with others Prism of Torah - YouTube Always on www.prismoftorah.org",
    "release_date": "21-03-24",
    "duration_minutes": 13.41,
    "spotify_web_url": "https://open.spotify.com/episode/249U8nYy61HZt5om0djsU2",
    "spotify_uri": "spotify:episode:249U8nYy61HZt5om0djsU2",
    "embed_url": "https://open.spotify.com/embed/episode/249U8nYy61HZt5om0djsU2"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Tzav - Unveiling the Secrets of Survival",
    "episode_description": "What if one powerful shift in perspective could transform your entire life? In this eye-opening episode of Prism of Torah, we uncover the profound yet often overlooked connection between danger, sin, and gratitude. Join us as we delve into the intricacies of Korban Todah, the sacrifice of thanksgiving, and explore its deeper message for our daily lives. Discover how recognizing Hashem's hand in every situation - from the mundane to the miraculous - can utterly revolutionize your outlook.  Through an unforgettable true story, you'll learn to see life's challenges in a whole new light. Ready to experience the transformative power of gratitude? Tune in now - your perspective may never be the same! Keywords: Korban Todah, Korban Chatos, Parshat Tzav, Divine Providence, Gratitude.  www.prismoftorah.org",
    "release_date": "28-03-24",
    "duration_minutes": 17.45,
    "spotify_web_url": "https://open.spotify.com/episode/3D3tYuHgWcoTymG11GUOjz",
    "spotify_uri": "spotify:episode:3D3tYuHgWcoTymG11GUOjz",
    "embed_url": "https://open.spotify.com/embed/episode/3D3tYuHgWcoTymG11GUOjz"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Shemini - Between pure & impure",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 12.4,
    "spotify_web_url": "https://open.spotify.com/episode/37qjAswMUBq822kppJP4Hh",
    "spotify_uri": "spotify:episode:37qjAswMUBq822kppJP4Hh",
    "embed_url": "https://open.spotify.com/embed/episode/37qjAswMUBq822kppJP4Hh"
  },
  {
    "episode_name": "Parshas Shemini - When Failure Fuels Faith",
    "episode_description": "Have you ever wondered about the hidden power of embarrassment in your spiritual journey? This week's episode uncovers the surprising role of \"busha\" in growth. Join us as we explore the contrasting paths of Moshe and Aharon, the deeper significance of the Mishkan, and the transformative potential of sincere remorse. Hear insights surrounding Nisan and the true purpose of creation, and discover how even our lowest moments can be catalysts for remarkable renewal. Tune in now to unlock the secrets of embarrassment and embark on a journey of self-discovery and growth in your Avodas Hashem. Always on www.prismoftorah.org",
    "release_date": "04-04-24",
    "duration_minutes": 16.22,
    "spotify_web_url": "https://open.spotify.com/episode/6BxAAMZBS6TrnP1oLeSNKJ",
    "spotify_uri": "spotify:episode:6BxAAMZBS6TrnP1oLeSNKJ",
    "embed_url": "https://open.spotify.com/embed/episode/6BxAAMZBS6TrnP1oLeSNKJ"
  },
  {
    "episode_name": "Parshas Shemini- Practice is perfect",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.03,
    "spotify_web_url": "https://open.spotify.com/episode/6n021a5Dx8vWmEwvLflv4j",
    "spotify_uri": "spotify:episode:6n021a5Dx8vWmEwvLflv4j",
    "embed_url": "https://open.spotify.com/embed/episode/6n021a5Dx8vWmEwvLflv4j"
  },
  {
    "episode_name": "380 Parshas Shemini - Stop Judging, Start Winning",
    "episode_description": "In Parashas Shemini, the Torah outlines the two signs that make an animal kosher: split hooves and chewing the cud. Intriguingly, when discussing four non-kosher animals, the Torah first mentions their one kosher attribute before explaining why they're forbidden. Why highlight a positive quality that becomes irrelevant once we learn they lack the second required sign? Even more puzzling, why mention the kosher attribute first instead of simply stating what disqualifies them? Join us as we uncover the hidden wisdom behind this seemingly inefficient structure—a fundamental concept that serves as a master key to understanding how Hashem wants us to perceive the world. Dive deep into a perspective that can transform your relationships and daily life, illustrated through a moving hospital story that brings these timeless lessons into sharp focus.",
    "release_date": "24-04-25",
    "duration_minutes": 10.02,
    "spotify_web_url": "https://open.spotify.com/episode/63lM69VkToAuQDbzRcVIeX",
    "spotify_uri": "spotify:episode:63lM69VkToAuQDbzRcVIeX",
    "embed_url": "https://open.spotify.com/embed/episode/63lM69VkToAuQDbzRcVIeX"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Tazria - How much of an 'אדם' are you",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 13.17,
    "spotify_web_url": "https://open.spotify.com/episode/2ntNipvImcuGgmXh7UDDVc",
    "spotify_uri": "spotify:episode:2ntNipvImcuGgmXh7UDDVc",
    "embed_url": "https://open.spotify.com/embed/episode/2ntNipvImcuGgmXh7UDDVc"
  },
  {
    "episode_name": "Parshas Tazria- Create a Shower of Abundance",
    "episode_description": "How do we have the power to create life or bring destruction? Why is it that the actual declaration of the Kohen is what renders one as impure? Join us as we explore the profound impact of speech through the lens of Parashas Tazria. What is the unique tool that Hashem gave us that, if we use it appropriately, we can create a shower of abundance for us, the Jewish people, and the whole world, and on the flip side, create, chas veshalom, the opposite effect?  Discover the deeper meaning behind the purification process of the metzorah and the symbolism of the two birds. Why is one bird left free and one slaughtered? Uncover the incredible potential of verbal energy and how it sustains the spiritual worlds above. In this thought-provoking episode, Reb Asaf Aharon Prisman delves into the intricacies of guarding our speech and elevating our souls. Tune in to unlock the secrets of harnessing the power of words for good and transforming your life through vocal holiness. Keywords: Parashat Tazria, Power of speech, Lashon hara, Purification process, Kohen's declaration     Always on www.prismoftorah.org",
    "release_date": "11-04-24",
    "duration_minutes": 16.4,
    "spotify_web_url": "https://open.spotify.com/episode/1OpjEH0Cy667bC7tJvNJmO",
    "spotify_uri": "spotify:episode:1OpjEH0Cy667bC7tJvNJmO",
    "embed_url": "https://open.spotify.com/embed/episode/1OpjEH0Cy667bC7tJvNJmO"
  },
  {
    "episode_name": "381 Tazriah/ Metzorah - When Silent Praise Wounds Deep",
    "episode_description": "Ever noticed how someone's silence after your accomplishment hurt more than outright criticism? Is withholding praise actually a form of lashon hara? In Parshas Tazria-Metzora, Reb Asaf Aharon Prisman reveals based on a Zohar why we need atonement not just for negative words, but for unspoken positive words. Discover why the Hebrew words for \"blemish\" (נגע) and \"pleasure\" (ענג) contain identical letters—just arranged differently. What hidden message comes out from this interesting fact? Learn how having the right perspective is an eternal life-changing concept. The grand finale is a true story from the Prismans' family experience this past Motzei Shabbos, which screams out this game-changing concept.",
    "release_date": "01-05-25",
    "duration_minutes": 10.73,
    "spotify_web_url": "https://open.spotify.com/episode/1ZjzMaIy3wpqSrHy8Mn2PO",
    "spotify_uri": "spotify:episode:1ZjzMaIy3wpqSrHy8Mn2PO",
    "embed_url": "https://open.spotify.com/embed/episode/1ZjzMaIy3wpqSrHy8Mn2PO"
  },
  {
    "episode_name": "47: Tazria / Metzorah The Master remedy for all cures",
    "episode_description": "This week on the podcast, we explore the parsha of Metzorah, which deals with the spiritual and physical implications of tzaraat, a skin disease that afflicted the Israelites in the desert. We ask ourselves: What are the root causes of our suffering and how can we overcome them? How can we apply the lessons of the Metzorah to our own lives and relationships? And what is the secret of the Baal Shem Tov's segula for choosing the right doctor? Join us for an insightful and inspiring discussion on this fascinating topic.  To listen to the podcast, visit www.prismoftorah.com or search for ‘prism of torah’ on any podcasting platform worldwide.",
    "release_date": "20-04-23",
    "duration_minutes": 14.56,
    "spotify_web_url": "https://open.spotify.com/episode/2DXuPFfyytx3u2zIIgjO24",
    "spotify_uri": "spotify:episode:2DXuPFfyytx3u2zIIgjO24",
    "embed_url": "https://open.spotify.com/embed/episode/2DXuPFfyytx3u2zIIgjO24"
  },
  {
    "episode_name": "Parshas Metzora-  Death and life in the hands of the tongue",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 13.28,
    "spotify_web_url": "https://open.spotify.com/episode/19eVFkDkA3Ef0rHQmtHTJ6",
    "spotify_uri": "spotify:episode:19eVFkDkA3Ef0rHQmtHTJ6",
    "embed_url": "https://open.spotify.com/embed/episode/19eVFkDkA3Ef0rHQmtHTJ6"
  },
  {
    "episode_name": "Parshas Metzorah - Lashon Hara Hurts Your Skin",
    "episode_description": "Teaser: In this thought-provoking episode of \"The Prism of Torah,\" Reb Asaf Aaron Prisman delves into the profound connection between lashon hara (speaking badly about others) and tzaraas (leprosy) in Parashat Metzora. Why does HaShem choose this specific punishment for those who engage in harmful speech? Discover the deeper significance behind this divine consequence and how it reflects the spiritual damage caused by negative talk. From the isolation of the metzora to the spotlight effect of tzaraas, Reb Prisman offers fascinating insights that will change your perspective on the power of words. Learn why even the Chofetz Chaim embraced his hearing difficulties as a spiritual safeguard. This episode is a must-listen for anyone seeking to elevate their speech and deepen their understanding of this crucial mitzvah. Tune in to uncover the hidden wisdom within the punishment of tzaraas and its relevance to our daily lives.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 9.9,
    "spotify_web_url": "https://open.spotify.com/episode/0YREHFAVRJMGR83p2yluWy",
    "spotify_uri": "spotify:episode:0YREHFAVRJMGR83p2yluWy",
    "embed_url": "https://open.spotify.com/embed/episode/0YREHFAVRJMGR83p2yluWy"
  },
  {
    "episode_name": "Parshas Metzorah How Belief Shapes Our Destiny",
    "episode_description": "Why is Pesach connected to Avraham Avinu? What is the true power of Emunah on Pesach?  How can our faith unlock divine protection and miracles in our lives? Join us as we explore the profound spiritual significance of the Seder night and its connection to the redemption from Egypt and, equally as important, the future redemption. Discover the three types of Emunah and how they relate to our faith journey. Learn practical insights on how to ignite your belief in Hashem and tap into the transformative potential of Pesach. We will share with you a fascinating concept brought down by the Alter of Kelm that will totally change your outlook on the Seder night. Tune in now to uncover the secrets of Emunah waiting for you this Pesach! Always on www.prismoftorah.org    🎧Listen here or ⬇️Download here or 🚫Netfree",
    "release_date": "18-04-24",
    "duration_minutes": 16.85,
    "spotify_web_url": "https://open.spotify.com/episode/3Y4Oyub47OkG8kf9dInUgE",
    "spotify_uri": "spotify:episode:3Y4Oyub47OkG8kf9dInUgE",
    "embed_url": "https://open.spotify.com/embed/episode/3Y4Oyub47OkG8kf9dInUgE"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Acharei Mos: Counting to Clarity",
    "episode_description": "This week is sponsored by the Weitzner Family,  In loving memory of their Father and Grandfather.🕯️Dovid Ben Dov🕯️ Are you prepared for the journey to Shavuos? How can we protect our holiness in a world filled with temptation? Join us as we explore the wisdom of Chazal and the Gedolei Yisrael in navigating the challenges of our generation. Discover the power of fences in safeguarding our connection to Hashem and learn how to channel our physical desires for kedushah. We'll delve into the stories of Mitzrayim and uncover the keys to living a life of clarity, purity, and purpose. Don't miss this transformative episode that will elevate your soul and empower your Emunah. Tune in now to unlock the secrets of a truly meaningful life!  Keywords: Shavuos preparation, Holiness and kedushah, Chazal and gedolei Yisrael, Overcoming temptation, Yirat Shamayim",
    "release_date": "02-05-24",
    "duration_minutes": 17.96,
    "spotify_web_url": "https://open.spotify.com/episode/3EakUcrDKBJD86hrnONVOE",
    "spotify_uri": "spotify:episode:3EakUcrDKBJD86hrnONVOE",
    "embed_url": "https://open.spotify.com/embed/episode/3EakUcrDKBJD86hrnONVOE"
  },
  {
    "episode_name": "382 Acharei Mos / Kedoshim - Your True Competition? Yourself",
    "episode_description": "Ever wonder why some people seem to have it easy while you struggle? The Yom Kippur Goral of two identical goats with wildly different fates holds the key. Hashem doesn't judge us all by the same standard—He judges us by what we do with the cards we're dealt. Listen to uncover the wisdom that will transform how you view success and struggle.",
    "release_date": "08-05-25",
    "duration_minutes": 12.32,
    "spotify_web_url": "https://open.spotify.com/episode/5hDN3lOxJFTnht5kxAoS1K",
    "spotify_uri": "spotify:episode:5hDN3lOxJFTnht5kxAoS1K",
    "embed_url": "https://open.spotify.com/embed/episode/5hDN3lOxJFTnht5kxAoS1K"
  },
  {
    "episode_name": "48: Acharei Mos-Kedoshim Break the Root(ine) of our downfall",
    "episode_description": "48: Acharei Mos-Kedoshim Break the Root(ine) of our downfall   In this episode, we will explore how to break free from the “auto pilot” mode that can make us lose our passion and enthusiasm for avodas Hashem, the service of G-d. This amazing concept can also help us keep our relationships fresh and satisfying. Avodas Hashem means serving G-d with the sole intention of fulfilling His Will, even when we don’t feel any pleasure or emotion. But how can we do that when we face the same routine and challenges every day? How can we avoid becoming bored or indifferent in our spiritual journey? We will share some practical and inspiring tips to help us renew our enthusiasm and joy in performing mitzvos and living a Torah life. To listen to the podcast, visit www.prismoftorah.com or search for ‘prism of torah’ on any podcasting platform worldwide.  Listen: https://bit.ly/ListenAMK  Download: https://bit.ly/downloadAMK  Netfree: https://send.magicode.me/send-file/file/77c1cc43d6a40fa21036e82784c06f4d67499c5c/view",
    "release_date": "27-04-23",
    "duration_minutes": 19.7,
    "spotify_web_url": "https://open.spotify.com/episode/3cxnCmV4q3wfI1h4OMEsGU",
    "spotify_uri": "spotify:episode:3cxnCmV4q3wfI1h4OMEsGU",
    "embed_url": "https://open.spotify.com/embed/episode/3cxnCmV4q3wfI1h4OMEsGU"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Kedoshim - Eat Your Way to Emunah",
    "episode_description": "Parshas Kedoshim - Eat Your Way to Emunah What is the hidden power behind eating kosher? How can the purity of our food affect our connection with Hashem? In this week's thought-provoking episode of The Prism of Torah, Reb Asaf Aharon Prisman delves into the spiritual dimensions of kosher eating and its profound impact on our lives. Discover the startling consequences of consuming impure foods and the miraculous blessings that await those who embrace a kosher lifestyle. Explore the intricate relationship between our dietary choices and our ability to transcend the laws of nature. Join us as we unravel the mystical insights behind the concept of \"tihyun li\"-‘they should be mine’ and its transformative potential. Don't miss this enlightening discussion that will forever change the way you view the food on your plate. Tune in now to unveil the secrets of kosher eating and unlock the keys to a life of divine connection and protection. Keywords: Kosher eating, Spiritual purity, Divine protection, Emunah (faith), Transcending nature",
    "release_date": "09-05-24",
    "duration_minutes": 13.04,
    "spotify_web_url": "https://open.spotify.com/episode/0bY8D7galEKxmhnJ4v7b4E",
    "spotify_uri": "spotify:episode:0bY8D7galEKxmhnJ4v7b4E",
    "embed_url": "https://open.spotify.com/embed/episode/0bY8D7galEKxmhnJ4v7b4E"
  },
  {
    "episode_name": "Parshas Kedoshim - How to be a holy Jew",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 16.32,
    "spotify_web_url": "https://open.spotify.com/episode/78WCQpQLcGEL2GxUOrYzc8",
    "spotify_uri": "spotify:episode:78WCQpQLcGEL2GxUOrYzc8",
    "embed_url": "https://open.spotify.com/embed/episode/78WCQpQLcGEL2GxUOrYzc8"
  },
  {
    "episode_name": "Parshas Kedoshim - Relationships with everyone",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 10.97,
    "spotify_web_url": "https://open.spotify.com/episode/4Kabq4ENtDyRSm0PmjmsWt",
    "spotify_uri": "spotify:episode:4Kabq4ENtDyRSm0PmjmsWt",
    "embed_url": "https://open.spotify.com/embed/episode/4Kabq4ENtDyRSm0PmjmsWt"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "383 Parshas Emor - The Freedom in Surrender",
    "episode_description": "Why do we call it Sefiras HaOmer—the Counting of the Omer—when the Omer was just a measure of volume? And why are we counting upward instead of downward, if our goal is Shavuos?Discover the hidden connection between the manna in the desert and the counting we do today. This eye-opening exploration reveals what’s truly in our control—and what rests in Hashem’s hands. Plus, hear the breathtaking story of a miraculous event that took place just weeks ago here in Israel.Unlock the essence of Yiddishkeit through a powerful perspective on emunah and bitachon. Listen now to transform how you understand Divine providence in your everyday life.",
    "release_date": "15-05-25",
    "duration_minutes": 13.07,
    "spotify_web_url": "https://open.spotify.com/episode/6DzFkb0R36ZQGRggMGifvV",
    "spotify_uri": "spotify:episode:6DzFkb0R36ZQGRggMGifvV",
    "embed_url": "https://open.spotify.com/embed/episode/6DzFkb0R36ZQGRggMGifvV"
  },
  {
    "episode_name": "49: Emor- Perfecting Imperfection",
    "episode_description": "49: Emor Perfecting Imperfection   This week on our podcast, we dive into the intriguing topic of why a kohen must be flawless. How can we try and emulate the attribute of Hashem to be perfect? What are the standards that we are measured by? Is the goal more important than the process? Do we have control over the outcome? How does this relate to our days of Sfiras Haomer and Lag Baomer. Join us for a unique perspective that yields practical advice from this weeks Parsha, we will explore these questions and share two amazing stories that illustrate the point.  To listen to the podcast, visit www.prismoftorah.com or search for ‘prism of torah’ on any podcasting platform worldwide.  Listen: https://bit.ly/Emor-listen  Download: https://bit.ly/Emor_download",
    "release_date": "04-05-23",
    "duration_minutes": 17.69,
    "spotify_web_url": "https://open.spotify.com/episode/2oIHMQxeicMxVueqSZVRWW",
    "spotify_uri": "spotify:episode:2oIHMQxeicMxVueqSZVRWW",
    "embed_url": "https://open.spotify.com/embed/episode/2oIHMQxeicMxVueqSZVRWW"
  },
  {
    "episode_name": "Parshas Emor - Maximizing enjoyment in this world",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 14.18,
    "spotify_web_url": "https://open.spotify.com/episode/17WiavgwwICP7jfwa4qmgn",
    "spotify_uri": "spotify:episode:17WiavgwwICP7jfwa4qmgn",
    "embed_url": "https://open.spotify.com/embed/episode/17WiavgwwICP7jfwa4qmgn"
  },
  {
    "episode_name": "Parshas Emor - Wheat, Miracles, and Meaning",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 13.1,
    "spotify_web_url": "https://open.spotify.com/episode/33wZjvUI7n4vttLgYxJ12k",
    "spotify_uri": "spotify:episode:33wZjvUI7n4vttLgYxJ12k",
    "embed_url": "https://open.spotify.com/embed/episode/33wZjvUI7n4vttLgYxJ12k"
  },
  {
    "episode_name": "Parshas Emor- Keeping Our Eyes on the Prize",
    "episode_description": "In this illuminating episode of \"The Prism of Torah,\" Reb Asaf Aaron Prisman unravels the profound significance behind the Omer offering and its connection to our modern-day counting of the Omer. Why is this sacrifice uniquely named after its volume? What's the hidden link between the Omer and the manna in the desert? Discover how this mitzvah serves as a powerful reminder of our true sustenance source, even in a world where we seem to earn our living through our own efforts. Reb Prisman delves into the deeper meaning of these 49 days leading to Shavuot, challenging us to refocus on our spiritual goals amidst life's busy demands. From ancient times to current events, learn how the lessons of the Omer remain strikingly relevant. This episode offers a fresh perspective on balancing material pursuits with spiritual growth, culminating in a call to action that resonates with today's challenges. Tune in for an eye-opening exploration of keeping our eyes on the true prize in life. Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 13.96,
    "spotify_web_url": "https://open.spotify.com/episode/6pI0tjcEzqExGdOsR1FtKl",
    "spotify_uri": "spotify:episode:6pI0tjcEzqExGdOsR1FtKl",
    "embed_url": "https://open.spotify.com/embed/episode/6pI0tjcEzqExGdOsR1FtKl"
  },
  {
    "episode_name": "Parshas Emor -The Grizzly Bear's Guide to Kedusha",
    "episode_description": "Discover the hidden connection between Shabbos and the Moadim that will transform your spiritual life! In this captivating episode, we explore: What is the true essence of Shabbos and Yom Tov? How can we tap into the unique spiritual energy of each Chag? Why is Shabbos mentioned as part of the Moadim, and why is it mentioned before all the other Moadim? What practical lessons can we take from this to apply in our daily lives to grow in Kedusha and positively impact others?  Join us as we unravel the deeper meaning behind the special Malachos of Yom Tov, the power of Aliyah L'regel, and an incredible story of faith in the face of danger. You'll gain a profound new understanding of these sacred times and how to make the most of them. Ready to elevate your Shabbos and Yom Tov experience? Listen now for the eye-opening insights that will change how you connect to Hashem! Always on www.prismoftorah.org    🎧Listen here or ⬇️Download here or 🚫Netfree",
    "release_date": "16-05-24",
    "duration_minutes": 18.41,
    "spotify_web_url": "https://open.spotify.com/episode/5eKf2vv9AgHvl69O85h5p4",
    "spotify_uri": "spotify:episode:5eKf2vv9AgHvl69O85h5p4",
    "embed_url": "https://open.spotify.com/embed/episode/5eKf2vv9AgHvl69O85h5p4"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "Parshas Behar - Bitachon in Hashem",
    "episode_description": "In this thought-provoking exploration of Parashat Behar, Reb Asaf delves into the profound concept of Bitachon - trusting in Hashem. What's the difference between those who blindly trust and those who question? Discover how our level of faith impacts the quality of blessings we receive, and why Bitachon is considered the primary conduit for Divine abundance. From the Gra's interpretation of \"Bereishis\" to the Chofetz Chaim's timeless wisdom, this episode unravels the power of unwavering trust in Hashem. Learn how cultivating this middah can transform your life, bringing peace and serenity even in challenging times. Prepare to be inspired by real-life examples and gain practical insights on how to strengthen your Bitachon and pass this crucial legacy to the next generation.www.prismoftorah.org Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "30-06-24",
    "duration_minutes": 13.88,
    "spotify_web_url": "https://open.spotify.com/episode/6TkV62w9mCtZgvWuh2LKA0",
    "spotify_uri": "spotify:episode:6TkV62w9mCtZgvWuh2LKA0",
    "embed_url": "https://open.spotify.com/embed/episode/6TkV62w9mCtZgvWuh2LKA0"
  },
  {
    "episode_name": "Parshas Behar - Emotional Wealth, Financial Health",
    "episode_description": "What does it mean when the Torah mentions helping the poor multiple times in a single passage? Is there a deeper significance to the repetition? We analyze a perplexing verse in Parshas Behar, uncovering layers of meaning behind the commandment to uplift those in need. we grapple with the Torah's curious wording, revealing profound insights into the nature of poverty and the essence of true generosity. Discover the spiritual and emotional dimensions of charitable giving, and explore the vital role of empathy and human connection in alleviating suffering. Join Rabbi Prisman on an enlightening journey into the depths of Torah wisdom, and emerge inspired to transform your approach to helping others. Tune in now to uncover the life-changing secrets of authentic chesed! Always on www.prismoftorah.org",
    "release_date": "23-05-24",
    "duration_minutes": 16.62,
    "spotify_web_url": "https://open.spotify.com/episode/53pFBKIZlbtLFx4fLDvqKb",
    "spotify_uri": "spotify:episode:53pFBKIZlbtLFx4fLDvqKb",
    "embed_url": "https://open.spotify.com/embed/episode/53pFBKIZlbtLFx4fLDvqKb"
  },
  {
    "episode_name": "Parshas Behar - The million dollar question",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 15.83,
    "spotify_web_url": "https://open.spotify.com/episode/6uTkuiBzWrVb8R1Gawyuld",
    "spotify_uri": "spotify:episode:6uTkuiBzWrVb8R1Gawyuld",
    "embed_url": "https://open.spotify.com/embed/episode/6uTkuiBzWrVb8R1Gawyuld"
  },
  {
    "episode_name": "2 DT: Behar, You are, where you are",
    "episode_description": "Parshas Behar in Chutz Laretz, with a message for every Jew! The three most important factors that affect property prices are:   Location  Location  Location  The reason your environment and the people you befriend make a difference in your life. We would love to hear your feedback email: prismanoftorah@gmail.com Our website will launch soon. The podcast is available wherever you get podcasts; iTunes, Spotify, anchor, Google podcasts and more.",
    "release_date": "19-05-22",
    "duration_minutes": 17.45,
    "spotify_web_url": "https://open.spotify.com/episode/1E8rCuXjiGYeUuZnIABcac",
    "spotify_uri": "spotify:episode:1E8rCuXjiGYeUuZnIABcac",
    "embed_url": "https://open.spotify.com/embed/episode/1E8rCuXjiGYeUuZnIABcac"
  },
  {
    "episode_name": "50: Parshas Behar/Bechukosai The Security Situation",
    "episode_description": "Welcome to this week's podcast episode, where we delve into the profound lessons of Shemita and Sefiras HaOmer. Join us on a thought-provoking journey as we contemplate the dual nature of questions that ensure future sustenance—can they be a blessing or prove detrimental? Uncover the significance behind the name Seferias HaOmer and delve into the reasons for counting both days and weeks. Within these timeless teachings, we confront a crucial dilemma: should one embrace the truth or risk facing expulsion from school? Tune in to unravel the answers and gain valuable insights from this captivating parsha. Download: https://bit.ly/Behar_download www.prismoftorah.com",
    "release_date": "11-05-23",
    "duration_minutes": 16.76,
    "spotify_web_url": "https://open.spotify.com/episode/2eMgNkAd0R0fUqL8JUDNfB",
    "spotify_uri": "spotify:episode:2eMgNkAd0R0fUqL8JUDNfB",
    "embed_url": "https://open.spotify.com/embed/episode/2eMgNkAd0R0fUqL8JUDNfB"
  },
  {
    "episode_name": "Eleven Blessings You're Missing- Parshas Behar Bechuoksai Ep. 384",
    "episode_description": "What does the Torah really mean when it repeatedly says to help your struggling brother? Why is the word \"Imach\" (with you) placed so puzzlingly in the middle of the verse? In this week's exploration of Parshas Behar, we uncover three different types of poverty requiring our attention - and the transformative secret behind truly effective chesed. Learn how a three-layered cake became the unexpected catalyst for a dramatic spiritual return, and discover the profound teaching from Rav Shimon Shkop that could revolutionize your relationships. Listen now to unlock the power of true connection.",
    "release_date": "22-05-25",
    "duration_minutes": 10.98,
    "spotify_web_url": "https://open.spotify.com/episode/5ihk3M5hvdsarCBi1w46uM",
    "spotify_uri": "spotify:episode:5ihk3M5hvdsarCBi1w46uM",
    "embed_url": "https://open.spotify.com/embed/episode/5ihk3M5hvdsarCBi1w46uM"
  },
  {
    "episode_name": "",
    "episode_description": "",
    "release_date": "",
    "duration_minutes": "",
    "spotify_web_url": "",
    "spotify_uri": "",
    "embed_url": ""
  },
  {
    "episode_name": "3: DT: Bechukosai; Why ask why",
    "episode_description": "Reb Asaf Aron Prisman on the Parsha. The Prisman of Torah Parshas Bechukosai, why ask why! When we do mitzvos is there an advantage to knowing the reasons behind the mitzvah or do we just do it because... The spirit of the mitzvah lives inside each mitzvah, what does this mean? How will it help us keep mitzvos? This and more... For questions, comments or to leave feedback, email: prismanoftorah@gmail.com Produced by Eli Podcast Productions 2022",
    "release_date": "25-05-22",
    "duration_minutes": 17.27,
    "spotify_web_url": "https://open.spotify.com/episode/2SoML5Dl6xdWGlrM7Uko8f",
    "spotify_uri": "spotify:episode:2SoML5Dl6xdWGlrM7Uko8f",
    "embed_url": "https://open.spotify.com/embed/episode/2SoML5Dl6xdWGlrM7Uko8f"
  },
  {
    "episode_name": "Parshas Bechukosai - The Solution to Global Stability",
    "episode_description": "Parshas Bechukosai - The Solution to Global Stability In a world where chaos reigns and the future seems uncertain, the Torah holds the key to the universe's very existence. Join us as we unravel the cosmic code that puts the fate of creation in your hands. Discover the transformative power of mitzvos and how your everyday actions can shape the course of history. Get ready to rewire your reality and unlock your true purpose in this eye-opening episode of Prism of Torah.",
    "release_date": "30-05-24",
    "duration_minutes": 13.25,
    "spotify_web_url": "https://open.spotify.com/episode/5PUbXdbUlyQWtDnusD7vJp",
    "spotify_uri": "spotify:episode:5PUbXdbUlyQWtDnusD7vJp",
    "embed_url": "https://open.spotify.com/embed/episode/5PUbXdbUlyQWtDnusD7vJp"
  },
  {
    "episode_name": "Parshas Bechukosai- The real purpose of life",
    "episode_description": "Hosted on Acast. See acast.com/privacy for more information.",
    "release_date": "04-10-23",
    "duration_minutes": 9.08,
    "spotify_web_url": "https://open.spotify.com/episode/03VOlYtNxSP077zRSK3nvy",
    "spotify_uri": "spotify:episode:03VOlYtNxSP077zRSK3nvy",
    "embed_url": "https://open.spotify.com/embed/episode/03VOlYtNxSP077zRSK3nvy"
  }
]